{"topicId":4649,"forumId":12,"topicTitle":"Moderation Recruitment Length?","topicTime":1319573154,"topicViews":90,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"nicholsml","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1319653016,"posts":[{"postId":36330,"topicId":4649,"posterId":1140,"postTime":1319573154,"postText":"As a dedicated player of the NNJG JB server, I was wondering how long Mod applications will be available. Im guessing you have to be a forum member for a certain amount of time (Like other staff applications) and have 30 posts? I would love to strive for the ability to even apply for this opportunity, but still have some time to be on the forums before I would be able to. Any idea how long NNJG is recruiting for?"},{"postId":36334,"topicId":4649,"posterId":812,"postTime":1319574045,"postText":"Here are the staff applicant requirements. \n\nAnd really staff apps can be open for any period of time, and close when we've found the correct amount of new staff members that we were looking for."},{"postId":36337,"topicId":4649,"posterId":1140,"postTime":1319575396,"postText":"Ah, i see they brought the post count up to 60. Thats good, now they will have more active forum members on their hands :)\n\n(And this is a bit off topic but what's with the whole Based God thing about?)"},{"postId":36373,"topicId":4649,"posterId":464,"postTime":1319587857,"postText":"http://www.youtube.com/watch?v=Yq-jPa2-gdE"},{"postId":36376,"topicId":4649,"posterId":812,"postTime":1319588409,"postText":">> \n\n(And this is a bit off topic but what's with the whole Based God thing about?) \n\n\nWell I don't really know if you're ready for a derailment of your thread, BUT YOU ASKED FOR IT\n\nThis \nis \nBASED \nGOD \nSWAG SWAG SWAG SWAG "},{"postId":36402,"topicId":4649,"posterId":243,"postTime":1319600188,"postText":"Guys, once again: this is not spam box.\n\n\nONtopic: Mod apps are open as long as Gash/Ben/admins see fit, sometimes they open for days, or like now, weeks."},{"postId":36413,"topicId":4649,"posterId":634,"postTime":1319629333,"postText":">> Guys, once again: this is not spam box.\n\n\nONtopic: Mod apps are open as long as Gash/Ben/admins see fit, sometimes they open for days, or like now,  Months . \nfixed."},{"postId":36423,"topicId":4649,"posterId":1016,"postTime":1319648215,"postText":"I had talked to Quack when he was on the server, said it would be sometime either this week or next week (asked him during the weekend). But as Destar bolded months, as his TTT app has been there. Guess we'll see and wait."},{"postId":36432,"topicId":4649,"posterId":115,"postTime":1319653016,"postText":"I intend to pick some moderators by friday or the weekend-ish for Jailbreak (my friday is busy so it may be moved to the weekends).\n\nI'll also most likely promote some of the moderators to administrators as I see fit."}]}