{"topicId":2943,"forumId":24,"topicTitle":"Memory","topicTime":1307499108,"topicViews":59,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"ʎnƃ ʇɐɥʇ","topicLastPosterColor":"","topicLastPostTime":1307502815,"posts":[{"postId":23532,"topicId":2943,"posterId":605,"postTime":1307499108,"postText":"I come out of hiding, since its been a good solid 2 or 3 weeks since I left, and also to release the map I had an itch to make.\n\nStarted off friendly enough untill the few regulars I knew of left. Then you can see what NNJG is without the few actual good people.\n\nEach and every round, the few good people of the server had to stand idly by as people would barrage out different kinds of racial slurs, Nigger being the most commonly used. Not to mention plenty of religious offense going off, but as stupid as it is, there are no rules against that. When a woman decided to use her mic, another boy decided he should do whatever he can to garnish her attention, including asking her to suck him off and the likes.. of course you could argue that its a kid just being a kid, but it ruins the mood for everyone, and places said woman in a very uncomfortable position. Rdm would occur from time to time, but this is fairly standard to see in TTT. The problem with all this is, That Guy, was there for all of it, and did nothing about it.\n\n---snip because of rageing emotions"},{"postId":23534,"topicId":2943,"posterId":397,"postTime":1307499958,"postText":"i try to gag those people but then i get called out for abuse. hope you can come back and play, i love your maps if you ever think of making another DO IT\n\nhmmm your now a mod and thatguy is demoted after you posted this -_-"},{"postId":23538,"topicId":2943,"posterId":377,"postTime":1307502815,"postText":"1 - I don't remember any of this Religious/Sexist/Racist stuff you are talking about, I see a Racist like once a Month, if That\n2 - Why call me out? Out of all the Mods, you call Me out :/"}]}