{"topicId":4550,"forumId":14,"topicTitle":"Unban request","topicTime":1318981835,"topicViews":140,"topicReplies":11,"topicStatus":1,"topicFirstPosterName":"Radiored","topicFirstPosterColor":"","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1319114574,"posts":[{"postId":35710,"topicId":4550,"posterId":1123,"postTime":1318981835,"postText":"Yesterday in ttt different chains of events went on to where considering to talk out a problem that risen turned into blatant arguement of how things got me banned.\nFirst off the game started out on devtown, the map that had been edited so that people would use the full map and not only run to the gunshop. Well it started out me shooting myself in the air with the button at the smaller tower, while in the air i said anyone under me is going to get goombastomped, I have no control of myself while in air except at the peak of the launch, \"now if innos agree to run under me to get goombastomped\" it will happen, which it did happen. I ended up killing an inno while i was inno which the inno was Nutterbutter and considerably i didnt realize i had killed a certain mod. Nutter actually laughed about it because he ran under me. The mod however didn't take too kindly to this saying i will be banned for saying im going to goombastomp people/rdm. We'll i kept my mouth shut didnt say anything considering itd add onto ban time. Next i was a traitor had a rocket jump and while jumping through the air (partyrocker) called me out saying i was a traitor, this i do consider i should be banned for because it was a mistake and shouldnt be said, but i said a racial slur in the heat of the moment not thinking. Well the mod said that it would add onto my ban time again. Again me keeping my mouth shut considering it would add onto more ban time. Two rounds later there are 7 people left in the round and someone issues \"Live check Respond or KOS\". I said \"i'll take the kos >:D\" considering itd be a joke and that no one would really take that as traitorus words. One of the innos whom i cant remember said well then kos radio, i went into the gun shop where i found another inno with me stood beside of him for 30 seconds or so, and he said \"wait radios down here should i kill him\" another person said yes. So he started shooting me took me down to 40 health but i killed him in doing so he also shot first. going out of the gun shop i met 2 other innos one being wheatly, wheatly and the other inno started shooting me which consider im still an inno, no where did i say i was a traitor. Wheatly ended up killing me and was confused because everyone was gunghoe for killing me. While dead the mod said looks like trolling/tbaitings going on they're too. At this point i was fed up and i took it to be the mods personal vendetta against me. Rage does make people do cray things, i said \"we'll what else could i do to add onto this long ass bantime\" the mod then sugjested that i \"Go on a rdm spree\". Which i did consider but never do because i considered this to be a issue between me and the mod. When i saw the mod i shot at him dont know if i wounded him but he ended up killing me. So my ban ended up being (rdm, racism, trolling, tbaiting, attempting to add ban time and as thus, accepted). I consider that we both didnt handle the situation right, and that yes there probally were 2 things that i should be banned for in there but most of this was based on chance/coincidence/personal affairs. So take it how you may but i believe i was wronged"},{"postId":35711,"topicId":4550,"posterId":634,"postTime":1318981930,"postText":"1) Which server:\n2) Your in-game name:\n3) Your SteamID:\n4) When were you banned and for how long:\n5) Reason for ban:\n6) Who banned you:\n7) Why should we unban you or shorten your ban period:"},{"postId":35712,"topicId":4550,"posterId":1123,"postTime":1318982509,"postText":"Server: Nnjg TTT\nIn game name: Radiored\nSteamID:STEAM_0:0:25945520\nBanned: 9/17/11 6 months\nReason for ban: rdm, racism, trolling, tbaiting, attempting to add ban time and as thus, accepted\nBanned me: Udane\nWhy you should shorten my ban: i think i was wronged, i do consider the racism and or tbaiting which i dont consider tbaiting what i did, but i still think it should be shortened"},{"postId":35724,"topicId":4550,"posterId":605,"postTime":1318992034,"postText":"We'll start off with some rdm you left out... in the map zs_mountain whatever its called, despite the fact I was teleporting players who got stuck, you crowbarred a T to death because he was stuck in you during the spawn. Next map, devtown, you said you were going to goomba anyone in the water, which you in fact did. In addition, I was never informed that Nutter found it humorous, you only said you believed he thought it was funny. Nutter never replied.\n\nA good portion of the players were under the impression that you were calling yourself out, so at first I was treating it as such. After talking with some players, I believed you may have not intended to call yourself out, though I dropped that belief after the next actions. (This transgression was filed under trolling, not tbaiting.)\n\nI never said to go on an rdm spree, I said you were missing rdm spree from the ban list, as well as what some of the others listed.\nDuring the round you shot at me, I was a D, and you were inno. It was obvious then that you just wanted to make you're ban longer, more so since it was right after asking what else you could have added to the ban. (This is where you got the tbaiting, since you shot 2 shoots but missed em both, I decided to go with the lesser, tbaiting, instead of attempted rdm.)\n\nNot once did you apologize, you said you did the later because you stand up for what you believe in."},{"postId":35749,"topicId":4550,"posterId":1123,"postTime":1319052280,"postText":"to start out, you said i was being banned after people ran under me allowing me to goomba stomp them, so this is just focusing on my ban you said later that you were banning me for the rdm before in that map but im sure that you just added this in to make it seem more effective.\nNutter did find this humorus because after i was rdmed by a inno nutter typed in chat \"LOL\".\n\n2. You infact did say go on an rdm spree, 3 other people also told me to do that which i never did\n3. I shot at you because this was personally a problem between me and you seeing as how i may have goomba'd you, even tho i thought nutter was the only person that actually died from that and 2 other innos did try to run under me, I never did apologize because i didnt have anything to apologize about, unless you are talking about the racist remark i added on when someone called me out which i do consider i should apologize for that, and attempted rdm but its kinda hard to do that now since i strongly dislike you and its apparent. Sorry for not being apathetic, but i am sorry for my actions, not to whom they concern"},{"postId":35754,"topicId":4550,"posterId":605,"postTime":1319061008,"postText":"Of course I said it after you did the goomba, because you said you will goomba anyone in the water... You didn't ask what all the ban reason was about till later, and just assumed it was for the goomba. Him laughing at you dieing by an inno could easily be assumed he was enjoying you die for rdming.\nI infact said if you wanted to add to your ban time, an rdm spree is what you are missing... no player told you to break the rules, you choose to.\nYou choose to attempt to rdm me by your own discresion, because you believe it was right to rdm someone to prove a point. This is the part where most of your ban length came from, the attempt to add more time to you, by directly targetting the player who banned you. This is the part, where if you apologized, saying you lost yourself in a fit of rage for a bit, you're ban would have been severly lessend to around 3 days, for racism mostly. But because you are so insitintent about it being right to target the player who can ban you, to add more ban time, I have no choice but to assume you are not sorry about any of the situation.\nNo ban is personal, in addition, no one get to break whatever rule they want and walk away. This is why I hate banning players who like me, they assume its a personal vendetta, but it's a cost I'll live with to make the server safer."},{"postId":35775,"topicId":4550,"posterId":1123,"postTime":1319066885,"postText":"I like how everything ive said you've twisted to make it seem circumstantial where anything could be based off chance and not on hard facts, and me saying id goomba anyone in the water was meaning get out of my way because id be sure i wouldn't WANT to cause problems as seen*. No where did i say i WANTED to add to my ban time because, i asked what i could do, but not that i wanted more of a ban time.  \n \nYes 2 other players typed in chat rdm spree. you know they did too, if i had the chat logs id bust that out in an instant but you know that i dont have them because it wasnt a problem at the time. Yes i did choose to rdm you because this was rage between me and you. Anyone that plays on NNJG can testify that if they were an admin and something personal happened to them to where they got goomba'd then they would have the power to instantly ban because they have the power to do so, If i would have goomba'd anyone else by themselves it wouldn't have been a major problem. \n\nYes i did lose myself in rage, and you also not considering anything i said when we talked of how this played out also made me lose it as well. And udane i dont see you as a god or anyone of higher power, because i see humanity truly based on how you are as a person, everyone is equal no one is an exception. And just because i was your friend doesn't mean that i think im exempt from being banned because i did use racism and i did goomba stomp but the goomba was purely accidental. I don't think anyone differently of anyone else like (player,balenti, or even gash to be exact) because i don't see anyone to be of higher standard than me because they are also just people, what truly makes them different? their ability to ban people? No, its their personality. \n\nEver since you and player became mod i can attest that there has been less \"trolls, minges, rdmers, racist's\" on the server.  But i really don't see what else i could argue about because there is nothing thats my side of the story and nothing less nothing more, i know what happened, and if you can't accept what i've said about my side of the story then i don't see what else i can say.\n\nI know that my ban should be for the racist comment, but the other things like the goomba stomp, the call out on me i consider to be minor, if you really feel that me shooting at you because i was in rage was a major problem and you take offense to that im sorry, but sorry for all the harm i caused to the server i dont consider anyone else having major problems from me and if they did they could ask for an apology if not then i do not see anyone that i have harmed or caused major emotional effects to. I still do request that i get a ban shortening"},{"postId":35819,"topicId":4550,"posterId":605,"postTime":1319082786,"postText":"I only stated that I'd ban anyone equally because you stated the ban was personal.\nI'm not asking for an apology for an attack upon myself, I'm only attempting to see if you would apologize for losing yourself, or still believe it was the right thing to do, to \"stand up for what you beleive in\".\nAlso, are you saying that when you rdmed the T with a crowbar, because you were stuck... it was a perfectly fine occurance, and not punishable?"},{"postId":35821,"topicId":4550,"posterId":1123,"postTime":1319083461,"postText":"well i believe the goomba stomp wasn't just on the other innos half from running under me and the call out on me wasnt acceptable ill stay strong to that, losing my temper was an understatement from the previous occurences. Which yea im pretty sure everyones lost their temper in a game of ttt doesn't mean anyone has to provoke it \n\nId still wish i would have been notified the beginning of the game for the previous, game of the 1 case of rdm, that the ban was going to start then."},{"postId":35848,"topicId":4550,"posterId":605,"postTime":1319092326,"postText":"1 case of rdm =/= ban\nI did tell you to not rdm. If I just warn you for everyone 1 rdm per day, you could get a free kill for rdm each and every day, so I don't just warn you that the first kill is part of the ban, I just warn you to not rdm.\n\nI believe the goomba was on your bad for saying youd goomba anyone in the water.\n\nI at first believed the self callout was against you, talked with players, then decided it may not have been your bad, up untill later circumstances.\n\nAnd once again, you did not apologize for losing your temper."},{"postId":35877,"topicId":4550,"posterId":1123,"postTime":1319108951,"postText":"i am sorry for getting angry, i really have nothing else to say or nothing i know that i did wrong, as we have stated everything in the last 4 paragraphs"},{"postId":35888,"topicId":4550,"posterId":605,"postTime":1319114574,"postText":"I think, and I may be totally wrong, but I think you may have been trying to apologize for the transgressions you know you were wrong in, and additionaly the part of losing yourself... but we kept having cases of miscommunication (either the way you worded yourself, or the way I read it). Call me a sap, but I believe in trusting others.\nYour ban will be lessend, but if this same situation occurs, there will be no use attempting to appeal the next ban."}]}