{"topicId":3173,"forumId":1,"topicTitle":"Free games and prizes on steam ? :O!!","topicTime":1309702592,"topicViews":224,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Ghostofyou","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1309782688,"posts":[{"postId":25181,"topicId":3173,"posterId":525,"postTime":1309702592,"postText":"Are you up to get the game Alien Breed 2 for free or prizes on steam ?\n\nFirst ,you need 3 digital summer tickets for steam. How do you get them ?\n\nFollow the three steps below\n\n1- You will need to comment on a friends profile - post anything you want ] +1 ticket\n\n2- Link your steam with your facebook! -Edit profile , browse down , login -complete- ] + 1 ticket\n\n3- I will invite you to the Summer Camp group. (Add me on steam) ] +1 ticket\n\nNote : You can get Digital summer camp steam tickets by doing Trickz in many games.\n\nNote #2: Your tickets are your Entries to The Grand Prize GiveAway!\n\nDone , you now have 3 tickets and can reclaim any prizes or the game Alien Breed 2 in the Summer camp prize booth in the Steam Store !\n\nSincerly \"Ez-AkiMaK_-\" Don't forget to add me on steam so I can invite you to the Summer Camp group OR.. you\n\ncan simply go in community and type \"Summer Camp\" in the search bar to join the group!\n\n~Feel free to post back\n\nExtra Achievement:\n\n4- Bit Trip Beat\n\n Sunbathing – Be perfect in Transition up to the first intermission\n\nHit all the blocks for the level “Transition” – you don’t have to finish the whole level – just the first section.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n6- Warhammer 40,000: Dawn of War II: Retribution\n\nPromethium Summer – Kill 50 enemies while using a flamer\n\nStart a Last Stand game and use the General (Human) or the Mekboy (Orc). Equip the Flamer weapon and start the game.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n 7- Lead and Gold: Gangs of the Wild West\n\nSummer Hits – Kill 7 enemies in a row with headshots without dying\n\nJoin or start a public multiplayer game (cannot be private and playing against bots doesn’t work), choose the Trapper class and take aim.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n8- AaAaAA!!! – A Reckless Disregard for Gravity\n\nAir. Wind. Sun. Pain. I Am All of This, and Your Mom Makes a Fine Pasta Dinner – Complete the Summer Sun level from the main menu with full points\n\nGet over 35,000 points on the Summer Sun Level –\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n9- Toki Tori\n\nGet a Tan – Stand in all sun beams\n\nSun beams are all located in the first chapter – Forest Falls…\n\n        Normal – Levels 6, 8, 11\n        Hard – 1, 3, 4, 5, 6, 7\n        Bonus – 3 (Join the Toki Tori Steam Community Group to unlock this level)\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n10- Swords and Soldiers HD\n\nVamos a la playa – Complete Viking Campaign level 3 by killing all units.\n\nBuy the Lightning spell, upgrade your mana then send out a cheap unit to uncover the level, kill all enemies with your Lightning spell.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n11- Team Fortress 2if you have tf2 you can get the\n\nEscape the heat - Works on maps who contain water\n\nGet ignated by pyro and jump in the water before you die.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n12- Jolly Rover\n\nOnce you get past Melvin and go upstairs for the first time go to the Kitchen on the left.\nPick up the peppercorn from the cupboard on the left.\nPick up the dried fish on the hook nearby.\nUse the oiled scarf on the window to the far left.\nPut the dried fish on the hook near the window you just oiled.\nOpen the window.\nPut the peppercorn in the spilled Rum.\nOpen the window again.\nDone! \n--\n\n13- Recommand a game\n\nRecommand a game that you bought to your friends!\n--\n14- Play a demo\n\nInstall and play a free demo on steam.\n--\n15- Say cheese\n\nLaunch any steam game and take a screenshot (Press F12 or your binded key to it)\n--\n\n16- at-Wetter\n\nHeat wave in the cave! Cool down a sweating bat with a drop of water in The Great Escape.\nGame: And Yet It Moves\n--\n\n17- Molotov Grill\nStart a game in Strategic Mode and pick only four perks: Fire Starter, Friendly Fire, Remote Detonator and Molotov, then detonate 12 Molotov grenades in one game.\nGame: Nation Red\n--\n18-Chicken BBQ\nKill 25 chickens\nGame: Foreign Legion: Buckets of Blood\n--\n\n19- Striptease\nStrip the turrets off 2 bosses and keep them alive for 60s.\nGame:Beat Hazard\n--\n20- Bayheimer\nCool guys don't look at explosions: This achievement can be earned by killing an enemy pro with explosion damage with your back turned.\nGame: Monday Night Combat\n--\n\n21- Heat Wave Brown out\nAccumulate a net energy balance of 300,000.\nGame: AI War: Fleet Command\n\n~ More to come tomorrow !"},{"postId":25183,"topicId":3173,"posterId":112,"postTime":1309705811,"postText":"It works. xD\n\nNote: If you don't want to link to facebook for whatever reason/don't have one, if you have tf2 you can get the \"Escape the heat\" achievement on tf2. (Jump into water while ignited)"},{"postId":25187,"topicId":3173,"posterId":488,"postTime":1309717124,"postText":"A good map to get the TF2 achievement might be 2fort. There's a lot of water in high-combat areas."},{"postId":25194,"topicId":3173,"posterId":595,"postTime":1309731398,"postText":"Im debating on doing this. Is it worth it?"},{"postId":25197,"topicId":3173,"posterId":101,"postTime":1309735452,"postText":"It takes 10 seconds and then you get a freaking prize. How is it not worth it? -_-"},{"postId":25201,"topicId":3173,"posterId":364,"postTime":1309740380,"postText":"Umm... I'll just buy the games."},{"postId":25218,"topicId":3173,"posterId":112,"postTime":1309782688,"postText":">> Umm... I'll just buy the games. \n\nIts only one game, the rest are dlcs. Or extras, like you can get some shades in tf2, or some more characters in killing floor.\n\nAll you have to do is reccomend a game, comment on a friends profile and join the steam summer camp group."}]}