{"topicId":1025,"forumId":14,"topicTitle":"Because Gash is ALWAYS right - Dum","topicTime":1287815221,"topicViews":75,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Stocking","topicLastPosterColor":"","topicLastPostTime":1287816056,"posts":[{"postId":9774,"topicId":1025,"posterId":101,"postTime":1287815221,"postText":"Your In-Game name: Dum\nYour Steam ID:STEAM_0:1:28509590\nReason: \"RDM\", even though it wasnt RDM at all\nLength of Ban: 24 hours\nWhat server were you playing?: PERP\nWho banned you?: Gash\nWhy should we unban you?: Because Gash doesnt like to ask why people kill him. Me and 3 other organization members were growing weed. So Mark (for some reason) randomly warrants us (as pretty much everyone in the server knows that we were growing up there, but had no proof to go up there). Well I walked out into the balcony of the hotel (where we were planting) and he shoots me in the legs. When he gets up to our house to check (breaking NLR, as he did the same thing 10 minutes ago) I attempt to shoot him. I fail (somehow) and he shoots me in the head, knocking me out. He does NOT (repeat, NOTNOTNOTNOTNOTNOTNOTNOTNOTNOTNOT) kill me. In the process, I accidentally broke Kenjis (a org members) legs. He asks gash to be sent to the hospital, but gash responds by beating him down with his nightstick. Afterwards, I get revived and sent to jail. When I get out, I go make myself an AK (i have ammo already) and because I realized the fact that I didnt die, I had a good reason to kill him. So I do, and he bans me for 24 hours. He then claims it was because \"he died and respawned, so it was RDM.\" How the hell am I supposed to know that he died? YOU DONT KNOW? Gash made us all lose about 25k that night, for his stupid fucking abusing. Viral, Fox, Kenji, and I. We want our money back, I want to be unbanned, and something needs to be done about Gash.\n\n\nAlso, Gash was being a total abusing fuck that whole night, and you can ask almost anyone who was on the server. (Viral/Punked, Kenji, Mak, etc.) He was being completely unfair and kicked almost all of us except viral at least once."},{"postId":9776,"topicId":1025,"posterId":2,"postTime":1287815667,"postText":"I only kicked you, Dum. Get your story straight. And Simon said he was getting complaints, so I gave him the story.\n\n>> 11:16 PM - Mr. Gash (inb4 vac ban): Mark said in radio that he needed help. I asked why? He said that he was trapped and was calling for help. He told me where he was, and I rushed over. I opened the door, to see a flash of over 15 pots of drugs. Dum is at the door, and pulls out an ak. Shoots both my legs, and down to 50 hp. I quickly take out my Service Pistol, and shoot him. He drops, and I try to keep anyone out of the house that shouldn't be in. I told a citizen to move (Kenji), and he stood right infront of me. I have my volume low so I couldn't hear his mic (It's late and I'm right by the wall) so he was telling me (Later he told me in chat what he said) that he was hurt and needed to get to a hospital. Me, not knowing what he said, thought that he was trying to protect the drug since he was in the same org. I hit him once with a baton, and it knocked him out. There was another person in the house (Fox) who was with the drugs. He ran in a room and locked the door, and I destroyed the drugs in the first room. The mayor and a medic came, (Mark is the mayor, he got out safly through the window) and got the people back. I then told the mayor to warrent them for having drugs, (since they didn't die) and arrested them. I left the house, with Kenji alive, Mark, and a medic. Then the complaints that it was rdm/nlr started happening.\n \n\nI banned you for one day since you were making excuses to rdm me 2 cases before, and the third time I  just  spawned and you shoot me down with an ak47. I think the ban was justified."},{"postId":9777,"topicId":1025,"posterId":26,"postTime":1287816056,"postText":"Denied; Don't know where the thread went but day bans and less cannot be unban requested (It usually doesn't happen and usually takes more then a day to process anyways)"}]}