{"topicId":3841,"forumId":35,"topicTitle":"Popl43's Mod Application","topicTime":1314568727,"topicViews":136,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"popl43","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1317436661,"posts":[{"postId":31195,"topicId":3841,"posterId":249,"postTime":1314568727,"postText":"1) What position are you applying for: Moderator in TTT\n\n2) Your age: 16\n\n3) Your location: United States, East Coast time, same as New York time i believe.\n\n4) Current In-Game Name: [NNJG] Popl43\n \n5) Steam ID & Link to your Steam Community Profile: http://steamcommunity.com/id/Popl43/ STEAM_0:1:3348458\n \n6) How did you find out about NNJG: Scrolling through server list searching for half full TTT.\n\n7) How long have you been involved with NNJG and/or Shadow's servers: 13 - 14 months\n\n8) What you can bring to the NNJG Team: Moderation of TTT\n\n9) Why do you want to be part of the NNJG Team: Been with NNJG for a long time, and I, personally have been in many situations with trolls and rdming players that use their mic to be racist/insulting to me or other players only and I don't have a high end computer, and cant record with FRAPS or any other program, if I had been a mod in these situations, they would be banned.\n\n10) Do you have any past experience with the position you're applying for: Have been Admin on my best friends TTT server before it became shockingly deserted. And unfortunately it was the target of countless trolls with hacks. Have been Admin on some servers that are not ttt but this should not count.\n\n11) Do you own a decent microphone, and do you frequently utilize it: I did, I broke it, but this has happened multiple times and i assure you once i get a new one it will happen again. I hate typing and always use my mic for every type of interaction with other players.\n\n12) Any other comments or information you can provide: I am also active in the morning when most mods or admins aren't and have little to do when i get home, meaning i can moderate until late in the night.\n\nRecommendations: sorry that their all over the place, but I'm sure its 15, maybe more.\n http://oi52.tinypic.com/15880nn.jpg \n http://oi56.tinypic.com/smf49d.jpg \nuploading second batch of recommendations ASAP, for some reason they got deleted by the site, probably a time limit on uploads... but my theory just doesn't explain why the other batch is fine : /"},{"postId":34609,"topicId":3841,"posterId":4,"postTime":1317436661,"postText":"Unfortunately, we are unable to accept your application at this time."}]}