{"topicId":4789,"forumId":21,"topicTitle":"Name/Paint my Unusual?","topicTime":1320477380,"topicViews":121,"topicReplies":12,"topicStatus":0,"topicFirstPosterName":"Loliconvict","topicFirstPosterColor":"","topicLastPosterName":"NINJABreadMan","topicLastPosterColor":"","topicLastPostTime":1321332942,"posts":[{"postId":37132,"topicId":4789,"posterId":1094,"postTime":1320477380,"postText":"All right, so I have an unusual Nuts and Bolts Flipped Trillby.  I can't decide what color to paint it, and am working on coming up with a name.  If someone creates and interesting name/description for it, I will reward them with a bit of metal, maybe 2 rec or 1 ref or so.  Here is an in-game pic:\n http://cloud.steampowered.com/ugc/594701250438707673/00BE1B879C837CBD1318AF35A011AA846D0E70FE/ \n(Sorry for semi-low quality)\n\nAnd here is the page for it, it shows the coloring options.  Just your opinion on what colors looks good is fine, you don't have to put a lot of thought into it. http://wiki.teamfortress.com/wiki/Flipped_Trillby\n\nThanks for taking the time, leave a suggestion if you think of one."},{"postId":37144,"topicId":4789,"posterId":517,"postTime":1320514045,"postText":"Color it red, and name it the ancestral wrath, with a description of this hat has had the blood and bolts of your ancestors engineers and sentry guns rain upon it for generations."},{"postId":37158,"topicId":4789,"posterId":1087,"postTime":1320523490,"postText":"Color it blue, and name it the Bouncy Blue Bowler, or color it Yellow and call it the Sunny Sunday Shade then give it the Desc: The UV Rays worst enemy (next to sun block)"},{"postId":37207,"topicId":4789,"posterId":1094,"postTime":1320538425,"postText":"My friend bought me white paint and told me to paint it that, so now it is.  I no longer need a color, but if anyone can think of a name that's fitting for the effect or color, I will still reward them.  My current plan is to name it \"Fresh Nuts\" and describe it \"Swag.\"\nA little simplistic I know, but I thought this video was funny and it inspired me: http://www.youtube.com/watch?v=Hn476i40pXk (May contain content inappropriate for children, including a choking hazard (small parts))"},{"postId":37212,"topicId":4789,"posterId":517,"postTime":1320540493,"postText":"Describe it, I had so much fun with this hat, it was also green when i bought it. Rename it Scouts Happy Hat"},{"postId":37234,"topicId":4789,"posterId":1087,"postTime":1320552903,"postText":"White Wheatley Wombo, Desc: This hat harness the power of President Wheatley to enrage its enemies with jealousy"},{"postId":37245,"topicId":4789,"posterId":373,"postTime":1320554961,"postText":"The Ego\n(It's so large it has it's own gravitational pull)"},{"postId":37257,"topicId":4789,"posterId":82,"postTime":1320559767,"postText":"Call it"},{"postId":37309,"topicId":4789,"posterId":1087,"postTime":1320609735,"postText":"Its not more me, its more just the Character of wheatley, because come on, who doesn't love that little A.I from Portal!"},{"postId":37410,"topicId":4789,"posterId":364,"postTime":1320688842,"postText":"since you have it coloured.\n\nI think you should leave the name alone.\n\nIn your disc, you can say \"Stop looking at my nuts, Pervert!\"\n\nI did the same thing for another hat of mine that I coloured pink (Excuisit Rack)\nIn disc it says, \"Stop looking at my rack, Pervert!"},{"postId":37419,"topicId":4789,"posterId":812,"postTime":1320697010,"postText":">> The Ego\n(It's so large it has it's own gravitational pull) \n . "},{"postId":37420,"topicId":4789,"posterId":1094,"postTime":1320698355,"postText":">> since you have it coloured.\n\nI think you should leave the name alone.\n\nIn your disc, you can say \"Stop looking at my nuts, Pervert!\"\n\nI did the same thing for another hat of mine that I coloured pink (Excuisit Rack)\nIn disc it says, \"Stop looking at my rack, Pervert! \n\nI actually do like this description idea a lot.  I do want to name it still, but if I can think up an appropriate name to match this, I would totally use that description."},{"postId":37959,"topicId":4789,"posterId":235,"postTime":1321332942,"postText":"The name could be \"The Bolting Nut\" get it :3"}]}