{"topicId":1903,"forumId":3,"topicTitle":"Upgrade System Ideas (Unofficial)","topicTime":1297667198,"topicViews":364,"topicReplies":32,"topicStatus":0,"topicFirstPosterName":"sarver","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1298584949,"posts":[{"postId":15861,"topicId":1903,"posterId":328,"postTime":1297667198,"postText":"So since everything got Deleted here is my little list of ideas for addition of the upgrade system.\n\n Knife Upgrade  - 500 points, 500 damage. One use.\n Betrayl Upgrade  - 500 points, 100% accuracy. One Bullet.\n Deagle Unique Upgrade  - 1000 points, On Headshot Causes explosion for 5 damage in a 10 yd radius.\n Radar Upgrade  - 1000 points, 2x Radar Recharge Speed.\n Health Station Upgrade (Traitor, But could work for both) - 1000 points, Detonates Health station, causing 50 damage to targets in close proximity.\n\n Gamble  New point earning method. Spend points for a chance at a greater ammount of points. \n10 points = 0-20 points return.\n25 points = 0-50 points return.\n100 points = 0-200 points return\n250 points = 0-500 points return.\n\n Point Amplifier  New point earning method. Spend points to earn double points for a duration of time.\n100 points = 1 day of double points.\n250 points = 3 days of double points.\n500 points = 7 days of double points. \nThis makes Regular players earn 2 points a kill, and remain at -2 a teamkill (obviously changeable) Vips+Admins earn 4 points a kill. \n\n VIP ONLY  The ability to be able to purchase/unlock certain things (not game changing) only if are a VIP.\n(No Real Ideas But Examples below)\n500 points - 10 more mystery box unlocks.\nVip Only Hats/Mask/Heads that have great looking effects,animations or just look badass. Like a head on fire. Something along those lines.\n\n(UPDATE) - Mabye for Vips they get 1 extra upgrade for all things. so 5 mac10 upgrades instead of 4. 6 m16, instead of 5, 5 gravity instead of 4.. you get what im saying\n\n\nPlease be sure to add your own suggestions and modifications to the ones above + criticism. Ty for your time."},{"postId":15862,"topicId":1903,"posterId":438,"postTime":1297667786,"postText":"I like these ideas, sarver."},{"postId":15864,"topicId":1903,"posterId":243,"postTime":1297697082,"postText":"Well, i forgot the ones i had here before, so here are some new ideas:\n\n  Traitor Tools  \n -Radar upgrade : Radar reloads faster; 3 upgrades. [250 Points]\n -Damage station upgrade : Does more damage faster, final upgrade is almost insta-kill; 5 upgrades. [300 Points]\n -Body armor upgrade : Each upgrade increases body armor effectiveness; 5 upgrades. [200 Points]\n -Flare gun upgrade : Adds a clip; 1 purchase. [500 Points]\n\n  Weapons  \n -Cloaker upgrade : Cloaker drains Hp slower, requires cloaker; 3 upgrades. [250 Points]\n -Shotgun upgrade : Shotgun slows enemy down for an amount of time; 1 purchase. [1000 Points]\n -Pistol upgrade : Increases speed/power; 3 upgrades. [200 Points]\n\n  Power-ups  \n -Speed upgrade : Run faster; 4 upgrades. [250 Points]\n -Primary starter kit : Allows you to start out with a weapon of your choice. [500 Points]\n -Secondary starter kit : Allows you to start out with a side-arm of your choice. [200 Points]"},{"postId":15867,"topicId":1903,"posterId":328,"postTime":1297709985,"postText":"Most of that stuff you suggested gash wouldnt approve of BUT... the starter kits sound awesome if we can figure out how to make it simple.. either you can only choose 1 weapon or can cycle through weapon choices the round b4. that way ppl can get a certain weapon for there next rounds play style, or a sniper for long range maps. etc.\n\nHealth station is too op. everyone is gonna say it and... should we really have upgrades of purchasable weapons? like.. Slower Hp Drain and Incind bullet does +1 dmg per upgrade. etc. i think thats a little to much"},{"postId":15873,"topicId":1903,"posterId":68,"postTime":1297716497,"postText":"100 points to get sarver to suck my dick."},{"postId":15875,"topicId":1903,"posterId":101,"postTime":1297718140,"postText":"I love:\n\n-Knife Upgrade\n-Betrayl Upgrade\n-Radar Upgrade\n-VIP only buying more mystery boxes\n\nMeh:\n-Health Station\n-Point amplifier (seems a bit overpowered for that low points :/)\n\nBad:\n-Deagle upgrade, they are already pretty overpowered\n-Gamble, as said in the other topic: \"Oh shit I lost now I'm broke\" *ragequit*, it also doesn't really seem necessary at all, maybe just stick to raffles+lotteries."},{"postId":15876,"topicId":1903,"posterId":328,"postTime":1297718332,"postText":"Well the deagle headshot = 1 shot kill. so all it does is add an explosion to the dead body. And if people cry for losing points after doing a Gamble, its their own fault, they have a chance to lose all points. thats what gambling is. plus its in the point shop so they cant get ripped off"},{"postId":15877,"topicId":1903,"posterId":101,"postTime":1297718546,"postText":"Still, its not just about the losing, its about the winning. Take our old css server,  I had binds for which team would win, and I would pretty much win every time, it wasnt really fun at all."},{"postId":15879,"topicId":1903,"posterId":272,"postTime":1297719317,"postText":"so you could BUY the fucking knife buff. That is actually a great idea!"},{"postId":15882,"topicId":1903,"posterId":328,"postTime":1297724931,"postText":"The gamble feature would take points away then return 0-200 points theres no way to constantly win besides luck i suppose."},{"postId":16018,"topicId":1903,"posterId":286,"postTime":1297917386,"postText":"There shouldnt be Limited use items form the shop,no one will buy it. (unless its cheap)"},{"postId":16019,"topicId":1903,"posterId":375,"postTime":1297917529,"postText":"i like it, it sounds really cool. It will definetley make TTT more fun"},{"postId":16020,"topicId":1903,"posterId":534,"postTime":1297917632,"postText":"Great ideas, too bad they don't benefit me in any way, shape, or form :P"},{"postId":16022,"topicId":1903,"posterId":328,"postTime":1297918548,"postText":" Vampiric Bullets  - Causes bullets to heal you for 10% of the damage. 5% per upgrade. 4 Upgrades. 200 points Ea. (30% life steal)\nTo Be Continues."},{"postId":16027,"topicId":1903,"posterId":389,"postTime":1297920364,"postText":"Mr. Tips (700-1000 points) - Allows innocents to see, the last person seen by dead player like a detective can.\nMr. Tips 2 (800-1000 points) - Allows a traitor to change the last person seen by dead player.\n\nMedic (500-700 points) - Increases healing rate on health station by 1.5x\nMedic 2 (600-800 points) - Increases healing rate on health station by 2x\n\nGeneral (800-1000 points) - As a detective, nearby innocents deal extra damage.\n\nMagnetic Charge (800-1000 points) - Unlocks on traitor buy menu. Cost 1 or 2 credits. Traitor plants a device, and after 15-30 secs, all nearby players lose their weapons.\n\nInnocent Armor (500-700 points) - Gives innocents armor, 10-20% chance.\n\nGraceful Buff (1000 points) - Player has a 2-5% chance of gaining 30 extra health, and increased movement speed.\n\nNewton Launcher Upgrade 1 (500 points) - Gives more pushing power\nNewton Launcher Upgrade 2 (500 points) - Increase the damage dealed by 5.\n\nAnti Grief (2000-3000 points) - Unharmed by flames (flare gun n incin scout), lost speed (from being shot), reduce explosion damage dealt (c4 / jihad damage protection). However damage by weapons hurt 3-5 extra damage."},{"postId":16034,"topicId":1903,"posterId":2,"postTime":1297923374,"postText":">> Mr. Tips (1500 Points) - Allows innocents and traitors to see to see the last player the body has seen, after inspecting it for 10 seconds.\n\nMedic (Max 3 Upgrades - Each 500 Points) - Each upgrade increases Health Station speed by 50%.\n\nNewton Launcher Upgrade 1 (500 points) - Gives more pushing power\nNewton Launcher Upgrade 2 (500 points) - Increase the damage dealed by 5. \n\nThese are the ones I agree with/have edited and agree with."},{"postId":16050,"topicId":1903,"posterId":389,"postTime":1297951242,"postText":"Woot my ideas somewhat works :S\n\nSome of them almost stayed the same XD"},{"postId":16056,"topicId":1903,"posterId":101,"postTime":1297972048,"postText":"Vampiric Bullets = Overpowered imo. Good idea, but it just doesn't seem right for TTT.\n\nMr Tips (Unrevised) seems like a good idea.\n\nMr Tips 2 would also be a good idea.\n\nMedic seems good, I HATEHATEHATEHATEHATEHATEHATE the new healing station. Also at a certain level or new perk, maybe like more health in it?\n\nGeneral COULD be abused in some sort of way, but not likely. I still don't like it though, it isnt necessary.\n\nMagnetic Charge could be REALLY FUCKING STUPID on maps with little weapons, just seems a bit cheap.\n\nInnocent armor = Good, not sure what the % chance means though\n\nGraceful Buff = Nah\n\nNewton Launcher = Does ANYONE even use it anyways? The thing is a piece of shit.\n\nAnti-Grief  doesn't seem very necessary."},{"postId":16061,"topicId":1903,"posterId":389,"postTime":1297979627,"postText":">> Newton Launcher = Does ANYONE even use it anyways? The thing is a piece of shit.\n \n\nIt is because rarely much people use it that there should be a buff to it. (Well I use it hehe its so fun pushing ppl off high places.)\n\nHeres how I'm thinking of things. Things that actually need a buff like health station (seriously ideas for it would be great), but its best to make use of all items right? So thinking of new buffs made for the unused detective/traitor items to make their more effective in game would be better?\n\nAlso my suggestion to Teleporter - Nerf it to 5 uses and then have uprades to increase by 5 or something. (Honestly who da fuck uses all 15/18 effectively?)"},{"postId":16102,"topicId":1903,"posterId":389,"postTime":1298062779,"postText":"Advanced Disguiser Max Upgrade - Allows people to see through disguisers!"},{"postId":16104,"topicId":1903,"posterId":101,"postTime":1298064045,"postText":">> Advanced Disguiser Max Upgrade - Allows people to see through disguisers! \n\nNo"},{"postId":16107,"topicId":1903,"posterId":2,"postTime":1298064707,"postText":">> Advanced Disguiser Max Upgrade - Allows people to see through disguisers! \n\nNo"},{"postId":16125,"topicId":1903,"posterId":328,"postTime":1298077466,"postText":" Primary Spawner  - Generates a selected primary weapon to spawn with at the start of round - 1 clip\n Secondary Spawner  - Generates a selected secondary weapon to spawn with at the start of a round - 1 clip\n Reload Speed Increase  - Either global like, 5,10,15,20,25% reload speed increase on all weapons, or weapon based upgrades. like P90,Ak,Deagle all get reload speed upgrades to purchase.\n Quick Switch  - Allows you to instantly be able to fire your weapon after pulling it out (removes the 1 second animation which allows you to be unable to fire. 1 upgrade. permanent.\n Scavenger  - pick up ammo off of dead bodys (drops a bag with 1 clip for all guns that you can pick up and replenish ammo. Including Huge Ammo)\n Protection Suit  - Reduces Damage from explosions,fire,falling and drowning by 25%\n Improved Newton launcher  - adds 100% push per upgrade. 2 upgrades.\n New Detective Weapon  - Tracker. Fires damageless bullet into target(no detection of fired bullet) that follows target similar to radar, pings every 5 seconds. lasts 30.\n Upgraded Crowbar(Katana)  - Upgrades your crowbar to become a Katana causes 10 damage then crowbar per swing.\n Upgraded Magneto stick(Funny)  - Upgrades magneto stick to allow you to pick up every prob not attached to the map.\n Upgraded Hands  - Allows an extra left click(jump) while using hands\n Improved Health Station  - increases health stations output speed by 200%\n Innocent Armor  - 10% damage reduction while innocent.\n\nPost suggestions may have been taken from other players, costs will be added shortly"},{"postId":16133,"topicId":1903,"posterId":2,"postTime":1298080348,"postText":">> \n Reload Speed Increase  - Each upgrade costs 100 points, and increases selected weapon reload speed by 5% each upgrade. Max 5 upgrades.\n Flak Jacket - Reduces Damage from explosions by 25%\n Improved Newton launcher  - adds 50% push per upgrade. 2 upgrades. 250 Points each.\n Improved Health Station  - increases health stations output speed by 200% \n\nName: Oh shit!\nPrice: 2000 points.\nSay !shit in chat, and your player model flashes different colors, and you get your HP set to 500 for 10 seconds. While doing so, this song plays from your model: http://www.youtube.com/watch?v=iNGBAwKCfgM\n10 seconds after you do this, you explode with a smaller blast radius then the Jihad, but still explode and cause damage. Only usable as a traitor. When you say !shit, it doesn't show in chat. The person that does this also has red glowing text over their head saying \"OH SHIT\" that can be seen through walls."},{"postId":16191,"topicId":1903,"posterId":272,"postTime":1298226718,"postText":"Is this serious? I'd contemplate spending money on it.\n\nMake the FUCKING KNIFE a buff upgrade."},{"postId":16194,"topicId":1903,"posterId":331,"postTime":1298227891,"postText":"Also if you wanted to increase cash flow? offer the sale of points ? then with doing so you could creat VIP only buffs? or things like\nThe cloaker? maybe VIP has less of a hp loss ?\nVip gets to use a ability once a map that doubles point gain that round\n\nCrowbar charger? Holding right click would let you charge the push to 2x, or 3x the push\n\nBut the offer of sale should greatly increase amount of donations, as well as overall point flowage? just a thought, plus then people will buy points and if there are vip/admin only items people will get that as well. just a thought\n1$-50/100 points or so? 10$ is 2 upgrades? worth looking into imo, or just an increase on points gained by vip? so more will be interested in buying."},{"postId":16195,"topicId":1903,"posterId":328,"postTime":1298228026,"postText":"these ideas are all serious and will soon be added to the upgrade system. the ones gash approves. althought he has terrible approve rates... scavenger is amazing but he doesnt want it :("},{"postId":16196,"topicId":1903,"posterId":389,"postTime":1298231466,"postText":">> Also if you wanted to increase cash flow? offer the sale of points ? then with doing so you could creat VIP only buffs? or things like\nThe cloaker? maybe VIP has less of a hp loss ?\nVip gets to use a ability once a map that doubles point gain that round\n\nCrowbar charger? Holding right click would let you charge the push to 2x, or 3x the push\n\nBut the offer of sale should greatly increase amount of donations, as well as overall point flowage? just a thought, plus then people will buy points and if there are vip/admin only items people will get that as well. just a thought\n1$-50/100 points or so? 10$ is 2 upgrades? worth looking into imo, or just an increase on points gained by vip? so more will be interested in buying. \n\n\nThe only thing is.... is that admins can distribute points. I remember Gash told me that they cant give out points.\nAlso VIP already gets 2x points + 1/2 the lost of points (2 points per kill, 1 point lost per bad kill)"},{"postId":16218,"topicId":1903,"posterId":272,"postTime":1298264247,"postText":"Admins can't distribute points. :p\n\nI agree with flame, however."},{"postId":16246,"topicId":1903,"posterId":389,"postTime":1298322188,"postText":"Tracking Device (1000 points) - Innocents put a tracking device on killer if they are within x range.\nDetective who have the radar gain a new signal (orange circle)."},{"postId":16373,"topicId":1903,"posterId":153,"postTime":1298579732,"postText":">> Tracking Device (1000 points) - Innocents put a tracking device on killer if they are within x range.\nDetective who have the radar gain a new signal (orange circle). \nHow about after pointshop purchase, detectives can buy it(with credits) and plant it on anyone they want."},{"postId":16378,"topicId":1903,"posterId":389,"postTime":1298583948,"postText":">> Ben\":p0l3l50f]>> Tracking Device (1000 points) - Innocents put a tracking device on killer if they are within x range.\nDetective who have the radar gain a new signal (orange circle). \nHow about after pointshop purchase, detectives can buy it(with credits) and plant it on anyone they want. \n\n\nSoooo you mean? like?\n\nA shop where it seems detective items?? for innocents at the cost of points?"},{"postId":16382,"topicId":1903,"posterId":153,"postTime":1298584949,"postText":">> >> Ben\":26xqbxn0]>> Tracking Device (1000 points) - Innocents put a tracking device on killer if they are within x range.\nDetective who have the radar gain a new signal (orange circle). \nHow about after pointshop purchase, detectives can buy it(with credits) and plant it on anyone they want. \n\n\nSoooo you mean? like?\n\nA shop where it seems detective items?? for innocents at the cost of points? \nThe tracker is in pointshop AND detective menu already. You try to buy it as detective. A message tells you that you need to purchase it in Pointshop. You go to pointshop. You buy it with 10,000 points. When you get detective again, you open the detective menu. You buy it with a credit. You go to a player, and right click on them. A tracker has been placed on them. You can purchase as many trackers as you want, but after placing the trackers, you can't tell which icon is which player until you follow it and go to the player."}]}