{"topicId":2504,"forumId":122,"topicTitle":"Smoogles","topicTime":1304055262,"topicViews":98,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1304095100,"posts":[{"postId":19980,"topicId":2504,"posterId":79,"postTime":1304055262,"postText":"Prof. Smooglez A. Flyingnarwhal\nSTEAM_0:1:29973972\nThat Guy was on\n\nHe said he was gonna rdm me several times. He crowbarred me on several occasions in which i killed him after he hit me twice. Few rounds he just started aimlessly shooting me, one of which he was detective and of course i killed him for doing so. (took me to 20 some hp when he was detective)"},{"postId":19981,"topicId":2504,"posterId":79,"postTime":1304055430,"postText":"I have 2 more pics of similar occasions that i can post, but wont let me because of the quota. These are pics of him just straight up shooting me for no reason or after im proven innocent and pics of him saying that he's gonna rdm.\n\nOverall from what I've seen from him, he's always been a troll and a rdmer. His reasoning is that he's a anti-troll. But in reality, anti-trolling is trolling. There is no right/wrong with trolling. This went on for about 2-3 rounds before map change then 3-4 rounds after map change. That guy slayed him and kicked him as warnings then banned him for 60 minutes. But i believe a 60 minute ban is too lenient and i am requesting a perma-ban for his actions.\n\nPic explanation\n\nPic1: Him pre-meditating his rdm\nPic2: Him bragging that he's gotten away with it often.\nPic3: Him crowbarring me twice before i shoot him in the head."},{"postId":19996,"topicId":2504,"posterId":272,"postTime":1304076182,"postText":"Banned for two weeks. This isn't near the first time he's done that."},{"postId":20015,"topicId":2504,"posterId":79,"postTime":1304094508,"postText":"To be honest i think it should be perma. Overall he is disrespecting everyone and just shouting how no one would dare ban him for longer. He knows what he's doing is not allowed and does it anyway. He purposely said he was gonna rdm me a few rounds and even said that he would only get banned for 1-2 weeks. It seems he doesn't care about his attitude and will continue doing it when he gets back. Lot of people dislike him and he's already said many times that he's a troll. With the evidence provided the ban should be perma. If not perma, anything less then a few months of ban is way too lenient, even that is lenient in my opinion for how much disrespect and proof there is against him."},{"postId":20016,"topicId":2504,"posterId":2,"postTime":1304095100,"postText":">> To be honest i think it should be perma. Overall he is disrespecting everyone and just shouting how no one would dare ban him for longer. He knows what he's doing is not allowed and does it anyway. He purposely said he was gonna rdm me a few rounds and even said that he would only get banned for 1-2 weeks. It seems he doesn't care about his attitude and will continue doing it when he gets back. Lot of people dislike him and he's already said many times that he's a troll. With the evidence provided the ban should be perma. If not perma, anything less then a few months of ban is way too lenient, even that is lenient in my opinion for how much disrespect and proof there is against him. \nHe was banned. The punishment has been given. There is no need for further discussion."}]}