{"topicId":1324,"forumId":35,"topicTitle":"I would like too be a mod","topicTime":1292592119,"topicViews":106,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"Swaim","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1292616211,"posts":[{"postId":12000,"topicId":1324,"posterId":366,"postTime":1292592119,"postText":"1. Tyler Lawrence\n2. Swaim\n3. STEAM_0:1:21439061  http://steamprofile.com/steam/profile/default/76561198003143851.png  \n4. REDACTED@REDACTED\n5. I am a frequent player of late afternoons and late nights.\n6./7.Well I have notice quite a lot of admins or no admins are not on in the later times such as 12am through 5am so, what I could potentially bring to the jail server is a night time mod. Quite a lot of forerunners get on late at night and the general rules cannot be upheld. Multiple accounts of abusive behavior witch I have multiple people complaining about are not accounted for. I also believe this would also become a great source of revenue for the admins, if the integrity of the server is upheld, by showing late night players and forerunners how fun it is with the game being played correctly and then encouraging them to donate. \n8. Not really but I know how to be fair with players.\n9. No but I understand how they're ran.\n10. yes\n11. A lot of moderators are aware of what I'm trying to accomplish and also agree, (hopefully they will vouch for me)\n     Oh and about that 15 posts I will accomplish that today I will be actively posting, if I would have signed up the day I joined the server, I would have had that done by\n     now"},{"postId":12006,"topicId":1324,"posterId":112,"postTime":1292594864,"postText":"You still need 10 recommendations before you even have the chance to be accepted."},{"postId":12011,"topicId":1324,"posterId":366,"postTime":1292597768,"postText":">> You still need 10 recommendations before you even have the chance to be accepted. \nCan you please explain what recommendations are too this subject I must have misread."},{"postId":12028,"topicId":1324,"posterId":101,"postTime":1292615690,"postText":">> >> You still need 10 recommendations before you even have the chance to be accepted. \nCan you please explain what recommendations are too this subject I must have misread. \n\n\nAsk people who often go on our servers \"Do you recommend me for moderator in NNJG?\"\n\nYou have to get 10 people to say yes.\n\nAnd I wouldn't accept you right away, considering I've only seen you play for about 2 weeks or so, if I were the person who got to chose who to accept I would say wait a few weeks, but then again I'm not."},{"postId":12029,"topicId":1324,"posterId":4,"postTime":1292616211,"postText":"You have been reviving dead threads and replying to discussions without any contributions at all. This will not make up for the post count rule anymore, you need to follow the official rules and guidelines before posting.\n\nhttp://nonerdsjustgeeks.com/forum/viewtopic.php?f=19&t=65\n\nand at the updated staff application for more specific rules for the post count requirement.\nhttp://nonerdsjustgeeks.com/forum/viewtopic.php?f=16&t=4\n\nplease feel free to post again with the updated template and requirements once you have them all."}]}