{"topicId":2987,"forumId":1,"topicTitle":"Admin Disrespect?","topicTime":1307820587,"topicViews":153,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1308012784,"posts":[{"postId":23774,"topicId":2987,"posterId":79,"postTime":1307820587,"postText":"I would like someone to explain this overall:\n\n1) Disrespect is judged from person to person not really a basic rule since trolling and disrespect change from person to person. (dont argue this fact, its the way english is, like the N word. Means different things depending on who you say it to and your own race)\n\n2) How can you disrespect an admin if he is disrepects you first? (slay you or do other random things towards you without any rule-breaking or otherwise unallowed conduct first)\n\n3) Are you allowed to just assume someone disrespected an admin for a general statement/basis. (such as saying 90% admins are corrupt(i dont see how that is overall disrespect towards anyway, its a relatively true statement))\n\n4) If you get denied steam chat towards the person or you have proof they started saying shit first, are you to be punished (they talk shit to a friend over steam chat and post those comments to you(this one is a personal basis since its happened many times and the cowards too scared to say shit directly))\n\nThese are to clarify some points in the rules that i don't see fit, disrespect is a person to person basis and should as such be clarified or removed from the rules in most cases. General statements arnt disrespect and when you can't talk to them privately because of there ignorance to answer or them blocking you what are you lead to do other then bringing it up on forums or game chat. \n\n This is NOT debatable by the players and as such there should be NO RESPONSES other then that of an admin or higher. "},{"postId":23775,"topicId":2987,"posterId":377,"postTime":1307821243,"postText":"I considered Disrespect as stating the Admin or Mod is Dumb for making them Follow the rules and State that they will continue to break the rules and the Admin can Kiss their Ass.\nThat and people refusing to follow the Rules stating they know the rules better than the Admin or Mod does.  There were only 3 times I banned someone for Disrespect, 1- First Scenario, 2 - Second Scenario, and 3 - Some guy that Cussed me out for slaying him (Not one F you and that's it, he started a rant that went on for a minute that eventually led to the size of my Testicles :/)\nI believe If people are gonna call out the Admins because they enforce a rule they don't like, and refuse to listen to them, they deserve a Ban."},{"postId":23777,"topicId":2987,"posterId":634,"postTime":1307823119,"postText":"Maybe you should PM an admin and ask rather than making a forum topic that non-admins can and will comment on?"},{"postId":23778,"topicId":2987,"posterId":79,"postTime":1307827642,"postText":"I agree with you That Guy, but the cases im trying to point out is where you yell at a admin for slaying you for something that isn't slay able and them saying disrespect then banning you for it. (hasnt happened to me personally yet but i know it has happened) Some admins also don't tell people why they are slayed in first place, so a lot of ranting happens. (like in your case (dunno if you told them why they were slayed))\n\nOverall i just want a agreed upon outcome on what all disrespect is, instead of everyone's own personal view on what disrespect is to them. Trolling is also a bad case, in my opinion, trolling is saying/doing something that pisses someone off. Which is the correct view on what a troll is according to the definition. But in the eyes of most mods and admins, being a troll involves rdm or random shooting as well, and is not JUST labeled to them saying shit over the mic. (actual definition is for chatting as well, in which case just spamming something to piss someone off is trolling)\n\na troll is someone who posts inflammatory[citation needed], extraneous, or off-topic messages in an online community, such as an online discussion forum, chat room, or blog, with the primary intent of provoking readers into an emotional response[2] or of otherwise disrupting normal on-topic discussion.\nintentionally provocative actions\n\nWikipedias definition.\n\nSo as admin disrespect goes out of hand in one direction (randomly banning someone for what one might personally consider disrespect), trolling (intentionally provocative actions) is going the other direction in which no one slays/bans for it UNLESS it involves rdm.\n\nSo all in all, this post is made for players to read on the current course of action mods and admins have been taking from my personal view of things. I just want some answers as to what defines disrespect and troll. Since these 2 rules in general are blatant to whichever mod or admin is on and there current thoughts on the definition of these 2 subjects."},{"postId":23921,"topicId":2987,"posterId":693,"postTime":1307988542,"postText":"It's kinda circumstantial. If it's disrupting play, people begin complaining about siad player leading to flame wars, or if it goes on well past any reasonable point, I usually gag and mute to let them cool down. If they other leave and rejoin immediatly after to avoid punishment or they start arguing the second they are ungaged/muted, I kick or ban for a few minutes with the reason filled as \"Chill and come back once you've calmed down.\" If they start doing it again, it's at this point I ban them. I've given them enough opportunities to correct themselves, but the insist on ruining the experience for the other people on the server.\n\nHowever, I've seen some admins and mods go straight for the ban just for accusing them of hacks or some shit *coughGashcough*"},{"postId":23950,"topicId":2987,"posterId":112,"postTime":1308012784,"postText":"Randomly slaying isn't disrespect, it's abuse."}]}