{"topicId":4530,"forumId":3,"topicTitle":"Epic Strategy you ever done in TTT","topicTime":1318905288,"topicViews":167,"topicReplies":17,"topicStatus":0,"topicFirstPosterName":"binlaninja","topicFirstPosterColor":"","topicLastPosterName":"SMOOGLY","topicLastPosterColor":"","topicLastPostTime":1319353793,"posts":[{"postId":35630,"topicId":4530,"posterId":1097,"postTime":1318905288,"postText":"Post here about strategy that you seen, or made by accident\n\nMy Story:\n\nThis afternoon, playing in devtown. RadioRed using rocket jump jumping around the new building and we having hard time shooting him while on top of the building. Wheatley stand on top of the small building under the opposite building of the new building. He aims headshot and everyone, no one knows really what happen."},{"postId":35632,"topicId":4530,"posterId":517,"postTime":1318906253,"postText":"Hang an unid body in a doorway, hold out a deagle, inno comes to investigate faceshot, also diguise as innocent go into traitor room"},{"postId":35648,"topicId":4530,"posterId":375,"postTime":1318908387,"postText":"Yesterday I was on devtown and I grabbed a rifle and hid on the ladder of the launch pad tower, I waited till one person was on teh roof and then chucked a knife at der face :P den I bought a rocket jump because someone called me out and I flew to the other tower and sniped. I got two moar ppl till I dieds! :D"},{"postId":35656,"topicId":4530,"posterId":1094,"postTime":1318911542,"postText":"This one time I bought a knife, and then I stabbed a guy in the face with it. Awww yeah.\n\nBut in seriousness, using the advanced disguiser to hide myself as a random innocent (pick ones without mics and who don't chat much) and go about killing them, switch it up when necessary.  Works out well sometimes.  Other than that I usually just call detectives to a dead body then knife/headshot them."},{"postId":35658,"topicId":4530,"posterId":1097,"postTime":1318911985,"postText":"well, thanks for all the guide/strategy guys. I appreciate it :D"},{"postId":35664,"topicId":4530,"posterId":605,"postTime":1318925399,"postText":"well, heres one... I killed mimey, disguised as him, shot at lua and darklight (the only other 2), then as they got close, I rocket jumped away from a higher place (to avoid being seen or them hearing it that well). They found the body belonging to mimey. I then used my ability to verbally lie to insinuate that darklight was falseifying the kos and is prob the T or that mimey was randomly shooting. This proceeded untill lua decided for sure dark had to be the T and murdered him. The next few words out of her mouth was priceless \"Udane, you monster.\""},{"postId":35671,"topicId":4530,"posterId":612,"postTime":1318929733,"postText":"Kill detectives. Scrounge up credits. Buy 7 rocket jumps.\nWait\nWait\nWait\n\nAhf\nAsd\nKufxdf\n\nProfit."},{"postId":35674,"topicId":4530,"posterId":1087,"postTime":1318932855,"postText":"Okay i was on Dev-town, and i hid out on the roof to one of the houses by the gun store, I would just sit there and snipe at people on the tower, thus making them kill whoever was on the other.\nI cause mass rdm AKA  Mind Fucked  all the  innocents  into killing each other."},{"postId":35678,"topicId":4530,"posterId":634,"postTime":1318939008,"postText":"Wait until a large group (4+) of innocents is at the traitor tester in 67th. Go to T room entrance, if there are 3 or less innocents waiting there, you can use a deagle-knife-shoot combo to handle them and then go in the T room. By this time you will be called out unless you use an advanced disguiser. Watch the trap for anyone trying to leave. If no one tries to leave, place a c4 on the wall and arm for 45 seconds. If someone tries to leave, close the trap on them and then immediately place a c4 for 45 seconds (if not already done). The trap takes less than 45 seconds so it's a good idea to plant the c4 before you activate the trap. be sure not to be in the T room for more than 1 minute. if everything works as planned you should have anywhere from 4 - 7 kills by now and a good amount of health left, along with the possibility of not being called out. You can leave and still have a betrayal for a detective or hard-to-kill player and you can gun down another 1-2 players easily before dying. Assuming everything goes fine, this strategy is a good way to nail an easy 10+ kills.\n\ntl;dr Too bad; you will never know the secret."},{"postId":35722,"topicId":4530,"posterId":735,"postTime":1318990313,"postText":"Devtown\nGet in armory underground in the OG part of the map.\nStay there until round starts.\nBuy a knife. Throw it at the person going out the door.\nKill everyone w/ help of t-buddies in the armory.\nGet shotgun, Stand right next to the door.\nSoon as person comes in shoot. (aim for head).\nShotgun the next person that goes to check the body. \nRampage.\n\nThat is how I got the most kills in 1 round,7. Yes, I'm n00b."},{"postId":35740,"topicId":4530,"posterId":82,"postTime":1319029786,"postText":"Buy a teleporter\nTelefrag\n\nTo my knowledge this isn't possible anymore D: About a year ago I would walk around, trapping people into a corner, setting that as my teleporter location, teleporting there and kill them, my record was 5 innocent telefrags in one round.\n\nNow my strategy is to rocket jump up once, then quickly down on top of the head of an innocent. It works some times, go up twice just for safe measure. The rocket jump down increases your fall speed so you can goomba stomp a whole lot easier. I've only gotten 2 people this way."},{"postId":35742,"topicId":4530,"posterId":252,"postTime":1319030195,"postText":"Walk up to a random innocent and ask them what there favorite color is on a random day. Then shoot them in the head. \n\nOr\n\nSet mouse dpi low and pull out a deagle infront of a large group."},{"postId":35759,"topicId":4530,"posterId":605,"postTime":1319061686,"postText":"It was me as a T and just one inno left... so, I decided to play with him a bit.\nBought a c4 and planted it in a random room, then bought a teleporter, and set its location on the other side of the wall of the c4.\nRan up to the last inno and said, \"I don't want this teleporter anymore, I found something else to play with... you want it?\" I proceeded to taunt him with it for a second until the timing was right and tossed it at him. I teasingly said, \"I wonder where it would lead, I bet it's someplace special~\"\nHe foolishly pressed it, and just as he teleported over, the c4 went off... I enjoyed myself. So much so, I had to recreate the situation to show other players ;~;"},{"postId":35794,"topicId":4530,"posterId":1061,"postTime":1319073238,"postText":"Be Inside Vent on Devtown_uda Threaten Them to Jihad if they Enter They ending up coming In Jihad Killing 5 People"},{"postId":35800,"topicId":4530,"posterId":1087,"postTime":1319075441,"postText":">> Be Inside Vent on Devtown_uda Threaten Them to Jihad if they Enter They ending up coming In Jihad Killing 5 People \n\nYou sir, are such a No0b for doing that today >.<"},{"postId":35989,"topicId":4530,"posterId":605,"postTime":1319178109,"postText":">> Be Inside Vent on Devtown_uda Threaten Them to Jihad if they Enter They ending up coming In Jihad Killing 5 People \nI do something similar, I go into a house, and say \"This is my house, if you come in, I will kill you\", then kill the people who are curious if I'd really kill them. I make sure to move every couple of kills, both to not t camp, and to prevent unideds from stacking up."},{"postId":36149,"topicId":4530,"posterId":1061,"postTime":1319345304,"postText":"DO Jihad in Cramped Room And Enjoying The Noise Of the Jihad Dane Laugh"},{"postId":36163,"topicId":4530,"posterId":397,"postTime":1319353793,"postText":"in theory, and i think i told destar this is you know theres 2 ways to kill your self by bind, well as atraitor \"jihad\" your t buddies but while you are alalala-ing press the kill bind that shows up as you exploding and have your t buddies proven ino for the rest of the game, make sure they are good liers like playa or destar,"}]}