{"topicId":2163,"forumId":116,"topicTitle":"Puzzle mapping","topicTime":1300592195,"topicViews":503,"topicReplies":23,"topicStatus":0,"topicFirstPosterName":"๖Mr. Gash","topicFirstPosterColor":"000000","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1302725469,"posts":[{"postId":17552,"topicId":2163,"posterId":2,"postTime":1300592195,"postText":"I've recently seen a few users starting to map for our puzzle server, and I'm happy you all enjoy it. You can post any work in progress pictures in this thread, discuss new ideas for your map, and discuss things about mapping for the puzzle gamemode. \n\nYou can download an example map for the Puzzle gamemode: here. \n\nI'd love to see everyone's progress on their maps :D"},{"postId":17559,"topicId":2163,"posterId":4,"postTime":1300597658,"postText":"  puz_ZoidBox   \n\n Status:    Work in progress...  \n● 3/18/2011 - Project Started (Picture) \n● 3/19/2011 - Spawn Finished (Picture)   [Still need to add lights, i'll do that at the end.] \n\n Possible Future Ideas: \n● Rings in a non-aligned sequence going downwards in the sky, you have to jump from a platform and fall through all the rings, everything else is #trigger_hurt.\n● Pool room near spawn point to hang out. (with a small waterfall/fountain like thing?)\n● Room for racing/betting purposes near the beginning of the first obstacle.\n● Non-tangible floor trap that leads you in a room with 3 Antlion Guards.\n ● Sex \n\n I'll update this post constantly with new progress points if i remember to. If you want, you can suggest ideas or offer help by adding me on Steam.  "},{"postId":17560,"topicId":2163,"posterId":272,"postTime":1300598204,"postText":"Alright, so so far, on my map, I have one trap done. Basically, there are 5 rows of two blocks, and one of each set of 2 is intangible, so you fall through to a trigger_hurt floor. I'm, at the moment, not sure how to do what I want to do with the hallway (not seen in the screenshot), so it's on hold while I watch 23423 youtube videos and procrastinate. \n\nIt's practically nothing yet.\n\npuz_experiment\n\n Status:    Work in progress...  \n\n● 3/19/11 - Spawn/first trap: http://www.picdrop.net/images/screenshot1.png\n\n\n Possible Future Ideas: \n● The hallway has saws or axes swinging side to side.\n● Run away from a boulder, Indiana Jones style\n● Jump rope\n● Run up an obstacle course away from lava (No idea how to do)"},{"postId":17565,"topicId":2163,"posterId":605,"postTime":1300602074,"postText":">> ● Run up an obstacle course away from lava (No idea how to do) \nTo do this,\n1. Make a box with what will look like the \"lava\" using whatever texture you find suitable, make sure its a big enough box to cover every inch of the obstacle course they are running up, from bottom to the top of where you want the lava to go. \n2. Press Ctrl+T while having this box selected in the Camera window, and make it the class \"Func_brush\". In the properties, name it anything, ie \"lava\", then set the \"Solidty\" to \"Never Solid\". For completetion sake, set the \"Input Filter\" to \"Ignore All\"\n3. Make a box the exact same size with the material \"Trigger\". Place this box exactly on top of the previous box. Press Ctrl+T, change the class to \"Trigger_hurt\", setting its damage to instant kill for clients. Name it whatever, ie, \"lava_hurt\", and IMPORTANTLY, parent it to the previous box, ie, \"lava\".\n4. Make another box with nodraw, and for ease of editing, make it the same size as the box for the lava directly on top of the lava box. Then move it somewhere outside the playing area while still keeping the same Z axis height. \n5. Press Ctrl+T, and make it the class \"Func_movelinear\". Name it, ie, \"lava_move\" then set the \"Move Direction\" to \"Up\" or in numerical terms \"-90 0 0\". Next set the speed to however fast you want it, and the distance to however high it should go... these will take a bit of time to get to work perfectly, so play with it, but first finish up these steps.\n6. Select all of these objects, and move then down by their Z axis equally to about where you want the lava to start at.\n7. Go back to the first lava box, the visual one, and Parent it to the move box, ie \"lava_move\". All of this parenting will make it so that when the move object moves, they all move exactly with it.\n8. Use your choice of trigger to activate it and end it, I suggest \"trigger_proximity\" with the whole \"OnStartTouch\" and \"OnEndTouchAll\" thing it comes with. \nNote, in reference to the move box, Open means to move it, while Close means to move it back where it started.\n\nPhew, that was alot to explain, and I hope Im clean of typos XD\nMoving along, the next map im working on is puz_trickery_adv. Basically, some of the same types of stuff you witnessed in puz_trickery_adv, but longer/harder. No, there are no screenshots, I feel weird leaking such things."},{"postId":17566,"topicId":2163,"posterId":272,"postTime":1300602797,"postText":"Hory shet, thank you."},{"postId":17567,"topicId":2163,"posterId":605,"postTime":1300603749,"postText":"No problem dude, and if anything aint working up to par, feel free to add me on steam or something, i'll help you through it... Actually, if anyone has any questions or what not, add me on steam, I love helping :o"},{"postId":17577,"topicId":2163,"posterId":3,"postTime":1300645022,"postText":"  Escape  \n\nStatus: Released!\n● (Picture) \n● (Picture) \n● (Picture) \n\nThings left to do:\n● Tweak lighting.\n● Add Decor.\n●  Add atleast 3 more traps.  (Yet there's a small possibility I'll add more)\n●  Add checkpoints, checkpoint spawns, etc. \n●  Fix a few bugs. \n\n I will update as time progresses. "},{"postId":17578,"topicId":2163,"posterId":101,"postTime":1300649079,"postText":"I can give you guys a download to the map I started to make that has a few traps done, just PM me if you want it, it works fine for what I have down."},{"postId":17609,"topicId":2163,"posterId":605,"postTime":1300700455,"postText":"Much to my dismay, alot, and as far as I care, ALOT, of people got into my map while it was still in beta. That being said, I'm confident puz_trickery_adv_b4  is the final iteration... fixed a few things that b3 still did not fix...\nI feel as though I should also publicly release puz_trickery_basic_b4  while I am it.\n\nFor both of these maps, expect a few memory teasers, and plenty of fake footholds or walls. Basic is perfect for many new player to grasp the skills required to go about being a puzzler, while being short to help put off pressure. Sadly, the shortness carries over to adv, but the difficulty does increase, in addition to the memory required from you.\n\n*Screenshots may be added later if I ever remember to do them. I linked to the download for the sake of reference, or if people wanted to dl the map before getting into the server (provided they dont already have it)\n\nMaking these maps was mostly one gaint expirment for me to learn the distances you can jump, sprint jump, bhop, jump around walls, jump height, etc. From here on out, hopefully, I'll be churning out serious game... as for the difficulty of it, I'm going to probably waver from time to time... dont want all the maps in the rotation to be hard, now do we? ;p\n\n... also... is it just me... or are all my maps going to end in b4, out of revisioning till they work properly... ;~;\n\nExtra info for the curious.\nTime used on the maps, versions went through till the most up to date, average time spent per day on the map.\nbasic- ~14 hours (had to revise after learning jump distances). 7 versions. All 14 hours in one run.\nadv- ~9 hours. 5 versions. 4.5 hours per day."},{"postId":17642,"topicId":2163,"posterId":101,"postTime":1300758680,"postText":"I played basic yesterday (before you made the post o.o) and to me the first jump was pretty freaking hard... but other than that I thought it was entertaining :D"},{"postId":17645,"topicId":2163,"posterId":605,"postTime":1300763840,"postText":"I'm glad you enjoyed it, but i'm sorry to say, adv is around 2 or maybe even 3 times as hard... and the next map I plan on working on is going to be even harder then that. But as long as someone enjoys it, it's worthwhile for me.\nOn a side note, should we post like a new topic in either mapping, or in puzzle gamemode, to annouce the release of each map, or just keep posting them in here... and if we do that, eventually, should we have a topic which is just a long list of links to all the maps created?\n\n*edit\nI've been informed its probably better to start a new topic for each map release. As such, I'll be just posting any information ima leak about maps here (highly unlikely), or assist in any questions the community may have about mapping. ^.^"},{"postId":17685,"topicId":2163,"posterId":605,"postTime":1300847300,"postText":"First off, I apologize for the double-post.\n\nOk, so, I'm getting really antsy for this map, so much so, I feel like I should share 2 screenshots to try to make yall antsy as well.\n http://img694.imageshack.us/img694/894/2011032200001.th.jpg   http://img859.imageshack.us/img859/9206/2011032200002.th.jpg  \nClicky Clicky pics for bigger versions... I like playing in 1600x1200, so the screenshots are that size as well, and well, that size is too large to put into the forum directly...\n\nI'm again trying some new things, in addition to attempting to make it both longer, and even harder then the last one. This one... wont be done overnight like the others XD"},{"postId":17699,"topicId":2163,"posterId":4,"postTime":1300853802,"postText":">> First off, I apologize for the double-post.\n\nOk, so, I'm getting really antsy for this map, so much so, I feel like I should share 2 screenshots to try to make yall antsy as well.\n http://img694.imageshack.us/img694/894/2011032200001.th.jpg   http://img859.imageshack.us/img859/9206/2011032200002.th.jpg  \nClicky Clicky pics for bigger versions... I like playing in 1600x1200, so the screenshots are that size as well, and well, that size is too large to put into the forum directly...\n\nI'm again trying some new things, in addition to attempting to make it both longer, and even harder then the last one. This one... wont be done overnight like the others XD \nLooks interesting!"},{"postId":17856,"topicId":2163,"posterId":3,"postTime":1301059437,"postText":"  Facility  \n\nStatus: Work in Progress\n● Pictures will be added shortly\n\nThings left to do:\n●  Add rooms (Hey guise, everything starts somewhere)\n● Add lighting\n● Add obstacles\n● Add decoration\n● Add checkpoints\n\n I will update as time progresses. "},{"postId":18340,"topicId":2163,"posterId":573,"postTime":1301809140,"postText":"Ah, my map is almost completed! After all this time (procrastination) and effort (blundering about trying to figure out what I'm doing) I'm nearing the end!\n\nTwo things I need assistance with:\n1) I need to figure out how to make a laser -- chosen randomly out of three possible lasers, each in a different position -- appear, travel horizontally to the end of the hallway, then disappear. Then another laser appears, etc.\n2) I need to know how to make the end that kills the player, transports them to the spawn, and gives them credit for finishing the map. Kinda hard to have a puzzle map without an end. :P\n\nHelp is appreciated!"},{"postId":18482,"topicId":2163,"posterId":3,"postTime":1302035012,"postText":">> \n2) I need to know how to make the end that kills the player, transports them to the spawn, and gives them credit for finishing the map. Kinda hard to have a puzzle map without an end. :P \nWell, it's not possible to do this, unless Gash modifies the gamemode to allow that.\n\nEdit: Woops, misread that, I thought you wanted it not to kill them."},{"postId":18483,"topicId":2163,"posterId":2,"postTime":1302035264,"postText":"Just make the last trap a door with trigger_hurt, when they walk into it the puzzle should finish."},{"postId":18498,"topicId":2163,"posterId":612,"postTime":1302042624,"postText":"I have a puzzle server you guys could test maps on. Its hl2 but its easily changeable"},{"postId":18504,"topicId":2163,"posterId":2,"postTime":1302044612,"postText":">> I have a puzzle server you guys could test maps on. Its hl2 but its easily changeable \nWe're using a custom gamemode, hl2dm won't support the entities."},{"postId":18505,"topicId":2163,"posterId":612,"postTime":1302044926,"postText":"Awe okay."},{"postId":18862,"topicId":2163,"posterId":605,"postTime":1302658708,"postText":"Ok, so, as someone may have noticed, i've been gone for like forever due to personal issues. This brings me to my topic, i've not touched this map in over 3 weeks. The problem is, after a large amount of time, I just cant restart work on something I used to be doing, it just drives me nuts. Instead, I'll drop the .vmf file here for anyone to take apart/get ideas from/finish. Random note, it has both actual textures and fairly decent lighting, along with guns and their spawn zones+gun puzzles.\nhttp://www.garrysmod.org/downloads/?a=view&id=120204"},{"postId":18865,"topicId":2163,"posterId":101,"postTime":1302659177,"postText":"If this is as hard as trickery expert i will fucking murder you."},{"postId":18870,"topicId":2163,"posterId":605,"postTime":1302662133,"postText":">> If this is as hard as trickery expert i will fucking murder you. \nHella easier, but nowhere near done. Like I said, touching up something I had working in the past, and trying to feel what I felt while making it back then, just does not work. It's here for anyone to play with in the editor, not the gamemode. Unless they finish it up or something of course."},{"postId":18893,"topicId":2163,"posterId":605,"postTime":1302725469,"postText":">> First off, I apologize for the double-post. \nI'm such a dirty boy ;~;\n\n>> Ok, so, I'm getting really antsy for this map, so much so, I feel like I should share 2 screenshots to try to make yall antsy as well. \nExplains my sentiment again.\n\nYa... I forgot to upload to the other image site, so no thumbnails...\nPic 1 \nPic 2 \nIf you may or may not notice from the pics, the second room is also the first room, but on the side of wall. If all goes well, you will be swapping from the walls, roof, and ceiling alot.\nAnd yes, thats water on the roof/floor of the first picture.\n\nAnd no, it wont be anywhere near as hard as expert. I wont repeat that mistake XD"}]}