{"topicId":4868,"forumId":24,"topicTitle":"11/11/11 Contest","topicTime":1320988634,"topicViews":156,"topicReplies":26,"topicStatus":0,"topicFirstPosterName":"eclipse","topicFirstPosterColor":"","topicLastPosterName":"eclipse","topicLastPosterColor":"","topicLastPostTime":1321120743,"posts":[{"postId":37665,"topicId":4868,"posterId":798,"postTime":1320988634,"postText":"Hello there, I've decided to hold a contest for whoever can make the most posts during the hour of 11(pm/am) on 11/11/11. In addition, who ever posts the most during 11:11(pm/am) will recieve a sperate prize.\n\nThe contest rules:\nThis thread will be story. You may only add new sentences, or end a paragraph and start a new one (if you wish), please try to make sense of the story, no random posts strafing too far away from the stories topic. No double posting, as always.\n\nThe story topic/begining sentence:\nYou are a normal kid, but you soon realize you have super powers. :O (topic)\nI was strolling down the street when I realized... (begining sentence)\n\n\nThe contest winner for the single hour will receive either a 150 point gift on TTT, or a special item (of my choosing) on tf2. \nThe contest winner for the single minute will recieve either a 100 point gift on TTT, or a lower quality tf2 item (of my choice).\n\nLet the games begin.\n\n(Side note) I will be reviewing the posts seeing if they count or not in the total. :3"},{"postId":37667,"topicId":4868,"posterId":856,"postTime":1320990001,"postText":"I was strolling down the street when I realized that I was glowing green. My heart stopped for a second as I inspected my self. It started beating rapidly as I poured a thousand thoughts into my head about what had happened to me."},{"postId":37673,"topicId":4868,"posterId":4,"postTime":1320991464,"postText":"My memory was weak, but i could remember something, a hand of some sort; the one that would later grab me and tear through my existence."},{"postId":37687,"topicId":4868,"posterId":82,"postTime":1321020337,"postText":"All of a sudden, a giant grain of sand fell in front of me. I later realized it was just a rock."},{"postId":37688,"topicId":4868,"posterId":798,"postTime":1321020701,"postText":"Suddenly, the rock began to shake, along with the ground beneath it.\n\n(My posts wont count, just to help the story continue.)"},{"postId":37689,"topicId":4868,"posterId":82,"postTime":1321021621,"postText":"The great rock moaned, as it was torn apart from unknown forces. Dust dropped from the cave walls like rain in a storm. A single crack had opened, a crack that led into a cavernous tunnel."},{"postId":37690,"topicId":4868,"posterId":925,"postTime":1321023767,"postText":"that tunnel let into a misterious place. But there was a single light swinging back and forth."},{"postId":37693,"topicId":4868,"posterId":517,"postTime":1321027864,"postText":"But what was inside the tunnel, was something that made my blood run ice cold"},{"postId":37695,"topicId":4868,"posterId":82,"postTime":1321029927,"postText":"With much hesitation, I crept into the tunnel. Ancient scriptures decorated the inside of this water-carved path. The rock has been eroded by the water for what I could only have imagined as an eternity."},{"postId":37696,"topicId":4868,"posterId":517,"postTime":1321029997,"postText":"The symbols on the wall were from a period long before man roamed the Earth, what they meant I could only dream."},{"postId":37699,"topicId":4868,"posterId":612,"postTime":1321030927,"postText":"I began investigating. It was like they'd been carved into the rock with very delicate hands with very precise and advanced tools. It was as if they meant something that only I could determine, something big."},{"postId":37701,"topicId":4868,"posterId":798,"postTime":1321039358,"postText":"I rubbed my hand against the wall, the memories of the symbols came flashing back, I fell back, terrified."},{"postId":37702,"topicId":4868,"posterId":1087,"postTime":1321040117,"postText":"I looked to my right and saw a light,seamed to be a flashlight, then a shadow of some strange beast behind it pointing at me and made osme terrifying noise. I ran into a nearby corridor. Scared and Paniced trying to figure out if what i saw was real, or fake!"},{"postId":37718,"topicId":4868,"posterId":4,"postTime":1321051732,"postText":"I opened my leather handback. \"Shit!\" i screamed. Only a toothpick and some old magazines . Oh well, i'll make the best of it."},{"postId":37731,"topicId":4868,"posterId":82,"postTime":1321062811,"postText":"I tore the magazines to shreds, used them as tinder for a fire that would keep me warm during my first night in this place..."},{"postId":37753,"topicId":4868,"posterId":798,"postTime":1321069504,"postText":"As I attempted to light the fire, I notice something; a spark in my hand that flew into the tinder, and lit the tinder as it bursted into flames."},{"postId":37758,"topicId":4868,"posterId":517,"postTime":1321071065,"postText":"At first I was terrified, but then i realized, the spark shooting from my hand caused me no pain."},{"postId":37760,"topicId":4868,"posterId":82,"postTime":1321071869,"postText":"With my new found powers, I took some well needed rest, the things I had seen that day where astonishing."},{"postId":37762,"topicId":4868,"posterId":517,"postTime":1321072404,"postText":"When I awoke the next day I felt energy coursing through my veins!"},{"postId":37765,"topicId":4868,"posterId":82,"postTime":1321073681,"postText":"However, this sensation quickly diminished. I was still weak, hungry and alone in this uncharted cave system, I didn't know when, or if, anyone would see me again, or if I could ever return to the surface world."},{"postId":37766,"topicId":4868,"posterId":517,"postTime":1321074012,"postText":"I began to hobble through the dark tunnel towards the rushing water"},{"postId":37769,"topicId":4868,"posterId":798,"postTime":1321075808,"postText":"(Ending edited out on Corey's request)\n\nThanks to everyone who competed, the winning results are:\nMain winner: Domineeto\nSecondary Winner: NBLCKK (I know it says 12:11 but I suspect you live in Eastern Time so it was 11:11 for you)\n\nPlease post on this thread whether you would like the points or tf2 items. (I'm guessing tf2 since you two don't play TTT that much :3)"},{"postId":37777,"topicId":4868,"posterId":82,"postTime":1321078304,"postText":"TF2 and it is 11:11 now here :D"},{"postId":37780,"topicId":4868,"posterId":798,"postTime":1321106548,"postText":"Once NBLCKK posts, could you please add me to receive your gift. (I already have Domineeto as a friend)"},{"postId":37781,"topicId":4868,"posterId":517,"postTime":1321114898,"postText":"I choose hat simulator 2 and I will add you when I get to a computer :)"},{"postId":37784,"topicId":4868,"posterId":612,"postTime":1321120187,"postText":"Let's keep this going. Erase eclipses last ending post. This is a good story"},{"postId":37785,"topicId":4868,"posterId":798,"postTime":1321120743,"postText":"Ending was edited out, continue as you wish."}]}