{"topicId":2927,"forumId":116,"topicTitle":"New map i have made, no bugs, works perfectly!","topicTime":1307377172,"topicViews":87,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"Killer Rabbit","topicFirstPosterColor":"","topicLastPosterName":"Killer Rabbit","topicLastPosterColor":"","topicLastPostTime":1307470819,"posts":[{"postId":23432,"topicId":2927,"posterId":839,"postTime":1307377172,"postText":"so as the title says, i have made a new map called  Haven_byOrgxer  like always, i SUCK at naming, so if you want to name it then say so.    LINK TO THE VIDEO WILL BE MADE AT THE BOTTOM OF THE POST, YOU MAY AS WELL READ YOUR WAY DOWN TO GET A GOOD IDEA OF WHAT ITS LIKE.   \n\nits has alot of good effects but unfourtuantly you cant escape on my map due to lack of textures et. so that was 1/3 of my map deleted..\n\nhere are some of the effects and random things about my map:\n\n-A deagle is hidden in a toilet >.>\n\n-you don't spawn with any weps unless you have weps in your cell, knifes are under you so you automatically pick it up.\n\n-there is a health station that is basicly a block with..well...a cat on it, and when you use it, its says:       Barney: did you just hear a cat?!?      Alyx:  what cat?    for a random effect\n\n- ALL DOORS HAVE A 3 SEC DELAY AFTER PUSHING THE BUTTON! if you dont want this, say so!\n\n-there is a radio!!!!!!! ^.^   in cp control room there is another room with a big blue button, unfourntunatly the sound thing can only play hl2 or counter strike music >.<... so it plays a hl2 music thing...\n\n-there 2 cp spawn, 3 spawn in cp control room, the rest spawn on the roof where the armory is. the reason fr this is because if they ALL spawn on the roof, they cant get in, so some will spawn in cp control room to open stuff.\n\n-the armory is of course on the roof like a said, to get to it you have to go up a tower, onto the wall, and walk up to it, no jumping or ninja skills needed unless you really insist.\n\n- to get to the cp control room you have to get to the broken elavator, it has a hole at the top so you can climb out, no ninja skills needed, just wall up to it and a invisible ladder takes you up, and then when your out the elavator, walk to the side wall and it will again, take you up like a ladder.\n\n- there elavator is closed of by a energy field which can be put down by hitting some buttons (again, 3 sec wait!) but you can just take a vent to get there which the opening to is a battered fail wall,\n\n- to find the entrance, face the elavator, to the left corner of that, there will be a wall, just hit it and it will break, there are in total 4 layers to break otherwise its to easy. \n\n-because it is against rule no.18 to close cell doors, i have made just one button to open the cell doors, it cant be closed once open because there is no button to close it  XD   suck on that rule breakers! \n\n\nand thats about it,  i am just about to put up some pics so you can view them,\n\n http://www.youtube.com/watch?v=X7fTax7GW_g "},{"postId":23447,"topicId":2927,"posterId":2,"postTime":1307389583,"postText":"How about an in-game video? And our Jailbreak server doesn't use weapon_knife, all weapons are handled by the gamemode, not the map."},{"postId":23505,"topicId":2927,"posterId":839,"postTime":1307470819,"postText":"i didnt know about the game mod, i did it just in case, and i will be making a in game vid but im going to wait a while because it laggs every one, it laggs like hell when i upload it to. i meen come on, 30 mins for a 5 min vid?!!?"}]}