{"topicId":1380,"forumId":35,"topicTitle":"Mark's attempt at a promotion to admin","topicTime":1293195045,"topicViews":137,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1293250392,"posts":[{"postId":12437,"topicId":1380,"posterId":54,"postTime":1293195045,"postText":"1) Admin\n2) 14\n3) Texas, US\n4) Mark\n5) http://steamcommunity.com/id/monkeyfire + STEAM_0:0:32816200\n6) REDACTED@REDACTED\n7) I've been involved for a long time. Since Shadows jail (I didn't have an account at the time I was on Shadow's jail, I shared one)\n8) I'm not good with really anything involving coding, but I'm a good admin\n9) Currently I'm mod in the NNJG team and I just am wanting to try to get admin only on jail. Everyone asks for me to change the map and I have to call an admin in to do it. I am on jail a lot more than any other NNJG server, and the admin commands will be useful.\n10 ) I have super admin on a perp server, I quit as an admin on another perp server, mod on NNJG server, admin on NNJG perp.\n11) I owned a TF2 and a GMod server. Both donated to NNJG (gmod turned into TF2)\n12) Yes, I have a mic and I use it a lot.\n13) I would only like to be an admin on jail. The jail server only needs mods, I understand that, but it also needs admins. I would like the commands and what not, I have been with NNJG for a long time and worked my way up. I know how to handle administration well and I can handle rule breakers. Thank you for your time."},{"postId":12439,"topicId":1380,"posterId":54,"postTime":1293195423,"postText":"10 ) I have super admin on a perp server, I quit as an admin on another perp server, mod on NNJG  servers , admin on NNJG perp.\n\nMistype and couldn't edit it. It said \"mod on NNJG server\" it's supposed to be servers."},{"postId":12443,"topicId":1380,"posterId":153,"postTime":1293216825,"postText":"We dont need admins for the time being"},{"postId":12454,"topicId":1380,"posterId":54,"postTime":1293224508,"postText":"Well, without map changes and what not, it gets boring being on the sammeeee map for hours.\n\nEdit: That's the main reason I want admin on jail"},{"postId":12497,"topicId":1380,"posterId":153,"postTime":1293250392,"postText":">> Well, without map changes and what not, it gets boring being on the sammeeee map for hours.\n\nEdit: That's the main reason I want admin on jail \nSorry, no"}]}