{"topicId":134,"forumId":35,"topicTitle":"VCITUSESESES Template for mod, or admin. any of which would work","topicTime":1274141392,"topicViews":113,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"Victus","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1274653795,"posts":[{"postId":1219,"topicId":134,"posterId":5,"postTime":1274141392,"postText":"Name: Daniel Cozzo\nSteam name: Victus\nSteam ID: STEAM_0:1:16444080 \nEmail: REDACTED@REDACTED\ninvolved??: im a frequetnt player atleast i play oon TTT alot. have been for about 3 months now i think....\nbring to server?: hmmmm i can bring a clean server. make people not RDM... keep it clean and make sure noone is not satisfied.\nwhy do iwanna be part?: i think NNJG is a fun community. nice people. they seem to know whats going on. and i enjoy playing on the servers\nGMOD experiance: yea ive been admin on numerous servers. as well as CSS, TF2, DOD:S, CS, DOD, and TFC... so i do have experiance in alot of fields :)\nGMOD server?: no but i have had TF2 and DOD servers in the past.\nany other comments: nah not really. just that id liek to be an admin or a mod. thanks bye :)"},{"postId":1237,"topicId":134,"posterId":12,"postTime":1274148827,"postText":"Please have you're recommendations before posting your application.  Also it seems that you just made te account to get admin. You have one post on the forums aswell so please be more active in the whole community. Also play on our other servers, not just the ttt"},{"postId":1282,"topicId":134,"posterId":5,"postTime":1274233453,"postText":"yea im not active on forums. but i was one of the first who signed up on the forums. i dnt post much but i watch it sometimes. and ive played flood sometimes. thats bout it"},{"postId":1297,"topicId":134,"posterId":12,"postTime":1274236525,"postText":"Well it's a start but you still need 10 recommendations. Ge tthise before you can even be considered"},{"postId":1436,"topicId":134,"posterId":2,"postTime":1274653795,"postText":"Locked. Create a new thread when you have everything you need."}]}