{"topicId":4285,"forumId":126,"topicTitle":"Puzzle mapping guide","topicTime":1316784724,"topicViews":109,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1316916568,"posts":[{"postId":34130,"topicId":4285,"posterId":605,"postTime":1316784724,"postText":"So gash asked me to make a guide to help players build maps for puzzle... So I did... took me like, 3 hours, maybe 4.\nWhile I was at it, I threw in some details in the guide to help those who never really used source sdk hammer before/that much.\nActually, I went a bit overboard with my screenshots, considering my resolution, and the amount of them I took... the wordpad file is around 400mb (Thank you zip files, turning 400mb into 17mb to dl) but either way, it may take a lil bit to open the file itself.\nI also included the map I made while working on the guide, for those who perfer a hands on appraoch.\n\nAll I really did was cover the basics... if people can somehow understand what I was teaching in this, not only would I be shocked, but I could start turning out more tutorials of this fashion. Might even start some basic video recordings if I get this thing working right.\nDecided to add a poll for after reading through it/dont wanna touch it\n\nDetails of the download;\n1 rtf(rich text file, aka wordpad or the likes required), size 400mb~, contains a slew of images alongside some text explaining the basics of mapping in addition to puzzle mapping, in addition to some statiscal numbers of the length of jumps of the average puzzler.\n1 vmf, 84kb, the map for use in hammer after the results of the guide (with modified textures so other players can see them)\nhttp://www.mediafire.com/?t2nvfbmv6g76tbr\n\nAlso, you may want to dl the gamemode for single player testing;\nhttp://www.garrysmod.org/downloads/?a=view&id=52065"},{"postId":34151,"topicId":4285,"posterId":243,"postTime":1316820178,"postText":"I actually found this very useful, but it contained nothing about lighting, and I was disappointed with that, but overall, great!"},{"postId":34154,"topicId":4285,"posterId":605,"postTime":1316828219,"postText":">> I actually found this very useful, but it contained nothing about lighting, and I was disappointed with that, but overall, great! \nYa when i was about to goto sleep last night, i noticed i was missing lighting... just stick some \"light\" entities in the map here in there, when it comes to puzzle, you dont really need to worry that much about the lighting... if you really are interested in making it look nice, your going to need to look up tutorials about it :o"},{"postId":34168,"topicId":4285,"posterId":612,"postTime":1316868237,"postText":"is thinking of making a map!"},{"postId":34177,"topicId":4285,"posterId":1094,"postTime":1316886896,"postText":"Udane already gave me ALL of his viruses, I doubt the file is unsafe :D\n\nThanks for making the effort and taking the time to make this!"},{"postId":34206,"topicId":4285,"posterId":605,"postTime":1316916568,"postText":"I was recently shown the gamemode, for use in single player testing of your maps.\nhttp://www.garrysmod.org/downloads/?a=view&id=52065"}]}