{"topicId":784,"forumId":24,"topicTitle":"HALP MEH!  Anyone know Python???","topicTime":1284004275,"topicViews":96,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Meathook","topicFirstPosterColor":"","topicLastPosterName":"Meathook","topicLastPosterColor":"","topicLastPostTime":1284692656,"posts":[{"postId":7168,"topicId":784,"posterId":113,"postTime":1284004275,"postText":"Alright, so I haven't even aknowledged that Python existed since like 2 years ago.  Today, riding the inevitable high that comes from coding for NNJG (totally not bragging or anything), I decided I should probably test myself and see what I remember about Python.  I have come to regret that desicion.  I start typing out a basic DOS-like program designed to take information from people and generate feedback, and do some basic math.  I did all of this successfully, except for, I shit you not, the \"print\" command. The very same print command that I used 6 times previously in the same program.  For whatever reason, Python looked at the 7th \"print\" command and promptly decided to fuck with my shit.  Anyone know what the hell is going on?  I'll post the full code if someone helps.  Thanks in advance."},{"postId":7745,"topicId":784,"posterId":113,"postTime":1284605733,"postText":"Nevermind guys, I got it.  Thank you sincerely for all your raging torrents of deep, deep wisdom, though.  I truly appreciate it."},{"postId":7752,"topicId":784,"posterId":82,"postTime":1284610449,"postText":"Thanks, mine was invisible but I'm glad you can see invisible things!"},{"postId":7753,"topicId":784,"posterId":113,"postTime":1284641291,"postText":"So am I, Domineeto.  So am I.  :P"},{"postId":7781,"topicId":784,"posterId":222,"postTime":1284679725,"postText":"Lol I didn't even get what you were asking - I could of helped you a lot, but never mind..."},{"postId":7806,"topicId":784,"posterId":113,"postTime":1284692656,"postText":">> Lol I didn't even get what you were asking - I could of helped you a lot, but never mind... \n\nNah, it was my fault.  I put one little quote where it shouldn't have been and Python was like \"DIE\";  You know how computers are.  :P"}]}