{"topicId":314,"forumId":22,"topicTitle":"Add the Camera","topicTime":1276652785,"topicViews":122,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"DethSlayr","topicLastPosterColor":"990000","topicLastPostTime":1277320597,"posts":[{"postId":2941,"topicId":314,"posterId":26,"postTime":1276652785,"postText":"Basically what the title says..\nYou know so you can take screenshots easier."},{"postId":2965,"topicId":314,"posterId":2,"postTime":1276658927,"postText":">> \nBasically what the title says..\nYou know so you can take screenshots easier.\n\n\n \n...\nCamera = Slot 6.\nHolster = Removed, replace with hands again.\nYeees....\n\nWait, Noooo...\nI would have to add the code so it can't be dropped.\n\nIt's a hl2 item, can't do that.\n\n:c"},{"postId":2978,"topicId":314,"posterId":6,"postTime":1276661482,"postText":"Or a Detective weapon could be a rt camera, you place it and it shows that place on your hud, so if any killings happens there, Detective could see it."},{"postId":3308,"topicId":314,"posterId":13,"postTime":1277088282,"postText":">> \nOr a Detective weapon could be a rt camera, you place it and it shows that place on your hud, so if any killings happens there, Detective could see it.\n \nSounds really useful but complicated, especially with multiple detectives. As far as camera for just screenshots, I think it is already super easy, just press F5 and it is auto saved in gmod folder. Do it all the time for LOLZ pics."},{"postId":3363,"topicId":314,"posterId":2,"postTime":1277146223,"postText":"The current version TTT is using (Custom, I edited this version...)\n>> Version 10-06-10:\n\n- Ragdolls colliding with eachother is now disabled by default to prevent ragdoll-related physics glitching causing lag. Can be re-enabled with ttt_ragdoll_collide (default 0).\n\n- Added (experimental!) new weapons, one for Traitors and one for Detectives:\n  * Traitors get the Newton Launcher, a gun that pushes a target with much more force and a longer range than the crowbar. Has a recharge rather than ammo.\n  * Detectives get a UMP SMG that slightly shocks a target with each bullet, screwing with their aim.\n\n- When Fretta voting is enabled, TTT now always starts a gamemode vote when the round/time limit is reached (and mapcycle isn't forced on), instead of only starting one when enough players vote for it when the round ends.\n\n- Added proper kill attribution when an attacker pushes his victim into water with leeches that end up killing him.\n\n- Added logging of DNA sample retrieval in the damage log (ie. server logs or ttt_print_damagelog).\n\n- Fixed non-TTT-compatible weapons not being removed when players pick them up. \n\nNow the CURRENT version, the LASTEST update.\n\n>> Version 13-06-10:\n\n- Fixed ragdolls sometimes becoming un-interactable (ie. couldn't be searched or picked up, didn't show on target ID).\n\n- Greatly reduced damage dealt by UMP.\n\n- Made DNA Scanner part of default loadout given to Detectives. Also made it easier to add (custom) weapons to the loadout (of everyone or specific roles only). \n\nWant to know why I don't use the latest? because it fucks ALL the custom weapons. So, in order to add the camera, I have to update. And that would mess up all the weapons."},{"postId":3521,"topicId":314,"posterId":48,"postTime":1277320597,"postText":"Yeah F5 works good enough for me. \nI think it's fine."}]}