{"topicId":4514,"forumId":122,"topicTitle":"Ninja Cyborg Pirate Jesus","topicTime":1318799383,"topicViews":69,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"ryancarson025","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1318808439,"posts":[{"postId":35525,"topicId":4514,"posterId":672,"postTime":1318799383,"postText":"1) Which server:TTT\n2) Offender's name:Ninja Cyborg Pirate Jesus\n3) Offender's SteamID:ID: STEAM_0:0:34942934\n4) Explain the situation in detail: I was traitor he was innocent. In the first few seconds of the round he kills me. I asked him why he killed me, he said that he didnt kill me and that he was afk. Then he said that his brother killed me. He also called me a douche\n5) Were any specific server rules broken: RDM, disrespect\n6) Any staff members on the server at the time of the offence: Playerhata slayed him and said that he would give him a 1day ban, i didnt think that was the appropriate punishment\n7) Proof: \nLanguage:\nhttp://steamcommunity.com/profiles/76561198024933003/screenshot/577811079464246219\nDamage logs:\nhttp://steamcommunity.com/profiles/76561198024933003/screenshot/577811079464514387\nLying about rdm:\nhttp://steamcommunity.com/profiles/76561198024933003/screenshot/577811079464244503\n\nPLAYER I POSTED THIS ON HERE SO ANOTHER ADMIN CAN REVIEW IT. DO NOT LOCK IT"},{"postId":35526,"topicId":4514,"posterId":812,"postTime":1318799810,"postText":"I'm not going to lock this. Even though I should, he's already banned.\n\nWhat happened was I asked him why he had killed you, he said \"Sorry, I let my brother on my account, slay me\", which I did. Then you provided me with screenshots of him subtly trolling you about it so I banned him for a day.\n\nAnd, he's not 'lying'' about the RDM, he said he was gone from his computer (afk), in which his brother got on and comitted the act, which is exactly what what he told me, so he was slayed.\n\nYou then decided to argue with me in admin chat bringing up a past ban of yours by another staff member, which was irrelevant, then subtly disrespecting my moderation.\n\nAnd sure, I'm glad to hear another staff members position on this, but you don't decide the punishment, as I had to tell you three times in psay."},{"postId":35529,"topicId":4514,"posterId":672,"postTime":1318800059,"postText":"So you just believe him? In the rules it says that it doesnt matter if someone gets on your account because its your responsibility. Then you ban some other kids for rdming and lying for 5 days. When we were talking i questioned your ban consistency then you do this"},{"postId":35536,"topicId":4514,"posterId":812,"postTime":1318802483,"postText":">> So you just believe him?  In the rules it says that it doesnt matter if someone gets on your account because its your responsibility .   \nExactly, which is why he was punished.\n\n>> Then you ban some other kids for rdming and lying for 5 days. \nYes, I banned a person for randomly shooting me as I was in Steam Overlay banning Ninja, as I saw that I was being shot I returned from Steam Overlay and saw him shooting me, barely killing me. I asked him why over voice, he said \"because you're trying to kill me\". I called him out, he was killed, then I was called out for calling out an innocent. I again asked him after the round, and he said I was shooting him and barely killed him, which was obviously not true, so I banned him for 3 days.\n\nIf you're trying to relate this to Ninja, in my opinion, AGAIN, he was not lying. He said he was AFK, in which his brother came on and RDM'd you. He apologized, and asked for a slay, which of course I did. I didn't feel that justified a ban, being it was a first offense, and that he was also being honest.\n\n>> When we were talking i questioned your ban consistency then you do this \nOnce again, you do not decide the punishments."},{"postId":35542,"topicId":4514,"posterId":672,"postTime":1318806843,"postText":"Are you really that naive to believe anything that someone says and how does apologizing fix anything. I was pretty sure that mods were supposed to ban people based on the situation, not your sympathy for the person. It is ridiculous that saying \"sorry\" can remedy the situation."},{"postId":35545,"topicId":4514,"posterId":812,"postTime":1318807567,"postText":">> Are you really that naive to believe anything that someone says and how does apologizing fix anything \n*Cough* Nice Disrespect. *Cough* And it did not fix anything, he was SLAYED.\n>>  I was pretty sure that mods were supposed to ban people based on the situation, not your sympathy for the person. It is ridiculous that saying \"sorry\" can remedy the situation. \nI was not being sympathetic. The justification for why he killed you was wrong, he had realized that, so he was punished. He had no record of rule-breaking prior, so that is why it was left at a slay. After you provided me the other evidence, I took it as minor trolling and banned him for a day. There is no universal punishment length. Just look at the bans page, every ban is different, because every SITUATION is different.\n\nIn dealing with him before you revealed to me the screenshots, he knew what he had done was wrong, and was aware of the punishment. Had I actually seen him troll you, or something along those lines, sure he would have been banned rather then slayed. \n\nWhile there is no bias in the administration, I disagree with the debate that staff members should be 100% apathetic. I'm not saying that there's an excuse for everything, but everything is situational. This is a community and the end of the day, and it should stay that way.\n\nAnd seeing as this is going no-where, I'm having another staff member look at this shortly seeing that is your request, so really there's nothing else to discuss further."},{"postId":35546,"topicId":4514,"posterId":101,"postTime":1318808439,"postText":"The offender was slayed and punished, he cannot be punished further for the same action.\n\nLocked, no ban extension."}]}