{"topicId":1480,"forumId":19,"topicTitle":"Question about the Staff Applications","topicTime":1293764939,"topicViews":159,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"Flame","topicFirstPosterColor":"","topicLastPosterName":"DethSlayr","topicLastPosterColor":"990000","topicLastPostTime":1294435035,"posts":[{"postId":13206,"topicId":1480,"posterId":389,"postTime":1293764939,"postText":"So I have some questions about the Staff Applications. The first few will be very easy to answer, and the rest are probably easy to answer too.\n\n1. Are the Staff Applications closed currently (answer is most likely yes due to recent 2 new mods)?\n2. When will Staff Applicaitons reopen(answer is prob when you get start needing mods again)?\n\nOkay so I am a recently new player that has joined the NNJG's TTT server (about less than 2 weeks before christmas). My goal in this community / clan is to become a member and get admin / mod for NNJG's TTT server and CS:S server.  So I recently asked Mr. Gash (questions) and Kobooold (recommendation), and both of them told me that I should wait a month or 2 before trying to do a staff application. So below are my questions.\n\nPre-3. So I will wait a month before I make a staff application, so I'll probably make one late January -> late February. Below is my actual question.\n\n3. Is that sufficient enough or should I wait a longer time before posting a staff application?\n\nPre-4. So currently I have been asking for recommendations (last 2 days), I've gotten about 5 of them right now.\nBelow is my actual question.\n\n4. Will I be able to use the recommendations I have right now and the recommendations I earn up till my staff application?\n\n5. I think thats about it? Awww i wanted to make a poll asking \"Is Flame gonna fail his staff application?\" \"Yes\" \"No\" \"DEFINITELY!\" :( too bad :("},{"postId":13208,"topicId":1480,"posterId":48,"postTime":1293765552,"postText":">> Ben\":3ao6sn8z]I'm gonna say no.\nWe just added two mods, and for the time being, I feel as though we should close staff apps.\nThat being the case, if we decide to re-open staff apps for global or ttt mods, then I'll re-open your application.\n\nLocked. \n\nBen posted that on Luigi's app which answers #1.\nThe rest I don't really know what to say about... \n\nHope that helps atleast somewhat."},{"postId":13211,"topicId":1480,"posterId":389,"postTime":1293766338,"postText":"LoL yeah i read that XD\n\nThats why i added my own personal answers for 1 n 2 XD. I just wanna know 3+ honestly."},{"postId":13212,"topicId":1480,"posterId":142,"postTime":1293766875,"postText":"3) It's not really of how much you need to wait, just that when they open up applications again, then you can go for it. Or you can keep being a good player and such then you could possibly be like that guy. xD\n4) If the people of those recommendations still play by the time you apply then sure, you can use them, at least I think that's it."},{"postId":13812,"topicId":1480,"posterId":48,"postTime":1294435035,"postText":"Seeing as the issue was atleast somewhat resolved, and this isn't actually an application; locked.\n\nAlso, some of this information could be added to a staff application FAQs thread,\nbut I believe this should be moved to recycle bin/denied."}]}