{"topicId":3842,"forumId":35,"topicTitle":"Moonrakerone's TTT Mod App (about 8 months in the making?)","topicTime":1314571275,"topicViews":186,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"Moonrakerone","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1317437108,"posts":[{"postId":31205,"topicId":3842,"posterId":237,"postTime":1314571275,"postText":"1) What position are you applying for: TTT Mod.\n\n2) Your age: 17, sir.\n\n3) Your location: Colorado (USA, obviously) MST\n\n4) Current In-Game Name: Moonrakerone [NNJG]\n\n5) Steam ID & Link to your Steam Community Profile: http://steamcommunity.com/id/Moonrakerone/  STEAM_0:1:25064241\n\n6) How did you find out about NNJG: Decided one day to play TTT, happened upon this one.\n\n7) How long have you been involved with NNJG and/or Shadow's servers: Ummm, august of last year i believe, with a very large gap of three to four months.\n\n8) What you can bring to the NNJG Team: (Web/Graphic Design, Lua/Other Coder, Moderation, Map Maker, etc.) Moderation...crappy mapping?\n\n9) Why do you want to be part of the NNJG Team: Because it's awesome, i know most of the regulars, and i can handle the great responsibility that comes with mod.\n\n10) Do you have any past experience with the position you're applying for: Nope, well VIP powers i suppose, and some extinct forum moderation.\n\n11) Do you own a decent microphone, and do you frequently utilize it: Someone told me it was \"awesome\", so i guess it is. I use it a lot. A LOT A LOT.\n\n12) Any other comments or information you can provide: I've been here for quite awhile, i know the rules pretty well, and i'm more than willing to learn how to be a decent moderator. I understand when mercy should be given, but also when enough is enough. I will be a bit less active as i'd prefer (High level classes demand sacrifice) but I'm usually on at weird hours on the weekends that are usually mod/admin-less. I'm working on recommends right now, give me a minute. :)\n\n\nRecommends: http://www.dropbox.com/gallery/870345/1/Recommends?h=296fb3\n(if this isn't an okay way to do this, let me know.)\n\n\n\n\n\n\nHEY, UPDATE LOOK HERE LOOOOOK\n9/16/11\n\nI've been inactive as shit lately. BUT, after i kick some Extended Essay ass this weekend i'll be able to play at least 2/7 days of the week, but more likely 3 or 4.\n\nI'm adding this because i see more people being denied, and i know i'm looking pretty bad being so inactive, but it's not that i want to be, and it won't be permanent. <3"},{"postId":34611,"topicId":3842,"posterId":4,"postTime":1317437108,"postText":"Unfortunately, we are unable to accept your application at this time."}]}