{"topicId":3149,"forumId":14,"topicTitle":"completely random perma -maybe a incorrectly aimed ban","topicTime":1309411094,"topicViews":187,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"mr. bubbles","topicFirstPosterColor":"","topicLastPosterName":"mr. bubbles","topicLastPosterColor":"","topicLastPostTime":1309491940,"posts":[{"postId":25061,"topicId":3149,"posterId":917,"postTime":1309411094,"postText":"Your In-Game name: mr.bubbles\nYour Steam ID: 0:0:28836396\nReason: apparently trolling/rdming?\nLength of Ban/Date and Time of Unban: 6/28/2011\nWhat server were you playing?: TTT\nWho banned you?: ?\nWhy should we unban you?: banned for no reason"},{"postId":25062,"topicId":3149,"posterId":373,"postTime":1309411303,"postText":"There is a reason. I quote, \"long list of trolling, some cases of rdm\" it wasn't accidental\nit was intentional."},{"postId":25063,"topicId":3149,"posterId":917,"postTime":1309411918,"postText":"what did i do exatly? i seriously don't think i have ever trolled or killed someone without a real good reason."},{"postId":25064,"topicId":3149,"posterId":2,"postTime":1309412369,"postText":"http://www.nonerdsjustgeeks.com/bans\n\nCtrl + F to search."},{"postId":25065,"topicId":3149,"posterId":917,"postTime":1309414521,"postText":"No, I know the \"reason\" I just don't understand why it was what it was. He only thing I have done bad on this server is thinking someone is T, and kill them, though that is really uncommon that I kill an innocent."},{"postId":25066,"topicId":3149,"posterId":2,"postTime":1309414905,"postText":">> 11:20 PM - Udane: he has lightly trolling for a great deal of time, with alot of false callout included, but he always claimed they were an accident\n11:21 PM - Udane: there was one or two times he rdmed\n "},{"postId":25067,"topicId":3149,"posterId":917,"postTime":1309417060,"postText":"I seriously don't think I have ever trolled.\n\nI dont random call out, and how would 1-2 rdm's even play into a permanent ban? I am sure One of the \"rdm's\" was on udane yesterday who said that I \"rdm'd\" him after he Was called kos (apparently as a joke, which I found out later)"},{"postId":25076,"topicId":3149,"posterId":917,"postTime":1309468895,"postText":"ok, for a couple hours i was un-banned, then i was suddenly re-banned? why :/"},{"postId":25084,"topicId":3149,"posterId":79,"postTime":1309489151,"postText":"I was on when you were banned. You ALWAYS play the innocent guy but false call out and troll non-stop. You have gotten away with it for extended periods of time and this time you got unlucky that a mod that actually takes steps to stopping trolling was on. You were warned several times as well as kicked/slayed for your actions. You never learned your lesson and now your trying to act like something you did never happened in the first place.\n\nTo admins looking at thread: The next step might be him saying it wasn't him on his account at the time of incident, he's known for outright lying and bragging about getting away with it. From my perspective from when he was banned, it was a rightful ban and deserves to stick to at min a year."},{"postId":25086,"topicId":3149,"posterId":917,"postTime":1309491940,"postText":"uuh, two of the three rounds i was on before i left because of intense lag i was traitor... only 1 round was i not and the only thing i did that round was say that LJ was suspect because he was alone with someone and i come back and they are knifed... and i was right.\n\n\nand WHY would i claim it was someone else, you apparently think i'm some mastermind troll or just a bad person, when all i do is play the game like most other people...\n\nEDIT: and someone still has yet to post/say any particular incident of trolling...\n\nEDIT 2: and if i DID happen to be calling out people that werent, why did no one warn/tell me that i was? i have not been kicked more than once, let alone banned or warned otherwise."}]}