{"topicId":3011,"forumId":19,"topicTitle":"Being a medic is tough.","topicTime":1308005485,"topicViews":94,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"Mimeyy","topicFirstPosterColor":"","topicLastPosterName":"Storm","topicLastPosterColor":"","topicLastPostTime":1308026094,"posts":[{"postId":23938,"topicId":3011,"posterId":769,"postTime":1308005485,"postText":"In general, being a medic is hard shit. Let me first say that out of my 90+ hours so far on PERP, a good 50 of them have been played as a medic.\n\n   Problems:   \nFirst and most troublesome is the ambulance. What the hell? It only goes up to 40 and cant handle the smallest turn. It can't even handle GOING STRAIGHT. This motherfucker couldn't make its way up a small hill if there were 37 unconscious babies at the top of it. I make it a point to get the ambulance, drive to the bank, and never touch it again. Thus, if you're unconscious outside of the city, you're not my damn problem.\n\nSecond is the Health Kit. 10 seconds is a VERY long time when you have five different people asking to be healed. And then there's that awkward moment when somebody needs to be healed twice and you're just staring into each others eyes for 10 seconds. It's a real bitch when someone comes running up to you, moves to the side a bit and you completely miss and still have to wait 10 seconds anyway.\n\nLastly, there's no way to get healed yourself. Being a medic, you have to run into some pretty nasty situations. Sometimes there's unconscious people laying in the road and you have to put yourself in danger to revive them. Sometimes there's a raging Huntley coming at you at 80 MPH, giving you little time to move slightly out of the way and get nudged by it. All for this dumb fucker that decided running blindly into the middle of the road was a good idea. Other times you have to be roasted in a fire to revive an unlucky vehicle crash victim. There is absolutely no way to heal yourself unless there is another medic(which believe me, that's rare), and the seemingly lost medic in the firestation won't heal you because SURPRISE, there's already a medic. You.\n\n   \nMy Suggestions   \n\n For the ambulance issue: \n◘ Use the ambulance you used in Ascension's PERP.\n(or)\n◘ Let us use our own vehicle.\n(or)\n◘ Replace it with a red Minicooper, because those things are badass.\n \nFor the Health Kit issue: \n◘ Reduce the cool-down time to 5 seconds or less.\n\n◘ Fix it so it doesn't have to cool down if you miss the person you're trying to heal.\n\n For the health issue: \n◘ Have the stationed medic be able to heal paramedics for free\n(or)\n◘ Let right-click be a \"heal self\" option\n(or)\n◘ Make medics be indestructible bosses(not really)\n\nNot related to any of that, the First Aid skill takes a ridiculous amount time to level up. Out of the 50 or so hours I've been a medic, I've only gained 1 level. It's because you only gain experience for reviving people and you get a very small amount of it. For this I would suggest giving experience for healing people as well, but only like 1/3 of the experience gained for reviving someone.\n\nSo yeah."},{"postId":23962,"topicId":3011,"posterId":115,"postTime":1308017916,"postText":"I agreed with everything you said here. But its not suppose to be easy, just keep in mind.\n\n\nUse ascensions ambulance, and lower medkit refresh time"},{"postId":23982,"topicId":3011,"posterId":760,"postTime":1308026094,"postText":"There is no \"ascension\" ambulance, I need a new script for it."}]}