{"topicId":4304,"forumId":1,"topicTitle":"[01/10/2011] NNJG Game Night [DONE]","topicTime":1316930147,"topicViews":230,"topicReplies":16,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Domineeto","topicLastPosterColor":"","topicLastPostTime":1317520181,"posts":[{"postId":34225,"topicId":4304,"posterId":82,"postTime":1316930147,"postText":"   Intro and Info   \n Hello, this is the first official organized night, and somewhat of a test, future game nights will depend on this one. This first time we will play games with small downloads, so more players can download on shorter notice.\n\n If you are interested in participating please reply with the time(s) (and your timezone) that is ideal for playing , when you have no work, school, social obligations or such. I will crunch these through a math magician and make the ideal date & time for gaming with a great community!  If you don't see anything you don't like up for voting, suggest a title (preferably free, and fun!)  and I might put it up for the next game night. \n\n\n\n\n\n\n\n\n   Voting   \nThis first week we got 3 games up to play Gang Garrison 2, King Arthur's Gold and Ace Of Spades.\n http://ganggarrison.com/img/header.png \n  Gang Garrison 2  is a side-scrolling multiplayer shooter inspired by Team Fortress 2, I haven't played it in three years but from what I can recall, it can be a blast! \nOfficial Website  \nGameplay  \n\n http://i.imgur.com/VjPA1.png \n  King Arthur's Gold  is a great cross of Terraria and TF2, classes, siege weaponry, building, physics-based destruction and much more. There is also some strategic elements that encourage teamwork! \nOfficial Website  \nGameplay  \n\n http://i.imgur.com/zh6gP.png \n  Ace of Spades  is essentially Minecraft with a ton of Battlefield elements, and it is amazing to dig around, sneaking friendly troops behind enemy lines and pick off an entire unsuspecting team! \nOfficial Website  \nGameplay  \nThe image for Ace of Spades doesn't do it justice, I was just to lazy to do anything but copy the website's header :P"},{"postId":34227,"topicId":4304,"posterId":812,"postTime":1316932430,"postText":"Holy fuck, Ace of Spaded all the way. Haven't played this immensely fun game with bros in months"},{"postId":34235,"topicId":4304,"posterId":612,"postTime":1316935012,"postText":"Move it closer. Topic will be forgotten by then"},{"postId":34236,"topicId":4304,"posterId":812,"postTime":1316935084,"postText":">> Move it closer. Topic will be forgotten by then \nI think he's using his dirty Canadian dating meaning it's October 1st 2011."},{"postId":34240,"topicId":4304,"posterId":292,"postTime":1316935620,"postText":"No, he  obviously  means January 10th of 2011."},{"postId":34246,"topicId":4304,"posterId":595,"postTime":1316955205,"postText":"I dont wanna use crossover. So whichever one works for mac.\n\nINB4: macfag"},{"postId":34252,"topicId":4304,"posterId":82,"postTime":1316960566,"postText":">> >> Move it closer. Topic will be forgotten by then \nI think he's using his dirty Canadian dating meaning it's October 1st 2011. \nThe rest of the world uses Day/Month/Year,   also post a time that is good for you or I will make it 6 or 8 MDT  "},{"postId":34260,"topicId":4304,"posterId":243,"postTime":1316972885,"postText":"I think I wanna try Ace of Spades.\nAnd the time thats good for me is 7-8:00 PST "},{"postId":34262,"topicId":4304,"posterId":115,"postTime":1316975371,"postText":"GG2 all teh way bro"},{"postId":34324,"topicId":4304,"posterId":82,"postTime":1317004929,"postText":"Are you joking me? KAG is easily the best choice"},{"postId":34325,"topicId":4304,"posterId":373,"postTime":1317006041,"postText":"And then there was Ace of Spades, completely dominating the other candidates."},{"postId":34335,"topicId":4304,"posterId":82,"postTime":1317007932,"postText":"Well it is a lot of fun, I just prefer King Arthur's Gold"},{"postId":34479,"topicId":4304,"posterId":82,"postTime":1317185943,"postText":" Well voting is close enough to ending so I am proud to present the winner, it came a lot closer than expected.\n\nAce Of Spades will be played  October 1st 7:00 PM PST , server is undetermined, join chat prior or during the event to keep updated. I may be hosting, but I don't have very fast internet, if you are interested in testing the server please contact me wednesday, thursday or friday. \n\n http://i.imgur.com/zh6gP.png \n\n I hope to see a few of you there, to change your name in Ace Of Spades you must go into the install location and change it in the config file! "},{"postId":34483,"topicId":4304,"posterId":987,"postTime":1317208324,"postText":"A sign up sheet would be good."},{"postId":34490,"topicId":4304,"posterId":634,"postTime":1317226293,"postText":"Ok so is there a signup sheet or anything so we can get a grasp of how many people will be participating?"},{"postId":34649,"topicId":4304,"posterId":812,"postTime":1317505529,"postText":"How about all the people attending gather in the NNJG Game Night group  chat room, just so we can organize everyone and such?"},{"postId":34661,"topicId":4304,"posterId":82,"postTime":1317520181,"postText":"The event is currently starting. Visit http://ace-spades.com/ download the game and get playing! The server is NNJG Ace of Spades\n\nEDIT: WOW, wasn't at all expecting such a great turn out, the server was nearly full for the two hours I was there. I will be adding map cycle, auto balance, more maps tonight. Thanks everyone who played, I look forward to the next game night (in 2-3 weeks)"}]}