{"topicId":1392,"forumId":19,"topicTitle":"Nevertheless, this was bound to happen.","topicTime":1293261253,"topicViews":404,"topicReplies":19,"topicStatus":0,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1294223111,"posts":[{"postId":12519,"topicId":1392,"posterId":26,"postTime":1293261253,"postText":"I'll be leaving today, And not coming back.\n\nFor you people to TL;DR, Get the fuck out and don't bother to post.\n\nThe reason i am leaving nnjg is because of all, The same for you and me. Is that there is no reason for me to stay, If not theres reason for me to LEAVE.\n\n\nAll i ever tried to do was keep order around the admins and forums, and i did somewhat, But its like you guys try to fucking tear apart everything i try to establish\n\nI ask you all Why do YOU stay at nnjg (Mainly applying to staff).\n\nIs it because of the good community? Good community? Have you been active at all? Its total fucking shit. Nonstop every day and rdmer or two, A troll or five and people who just live to piss you off, You say these as a bump in the road, but looking back it happens every day, And not only in nnjg, But in every other ttt server or jail, or nearly all with a large set of rules or rp based game modes.\n\nGood staff? Yes the type that can't seem to give two shits about what happens to the players, or those who can't seem to attain common knowledge and judge something not blatantly written in rules, Or taking the fabric of rules and smashing it down into everyones throat, And slaying people for 2 innocent kills, It doesn't matter that they attacked you now does it? (FYI im giving the usual point of view of certain admins.)\n\nThe extra mods? You mean the few stolen things from other servers, and those 1 or 2 extra weapons they added that appear to be simple? And don't forget that anything posted on nnjg is theirs and solely theirs!\n\nThe fun game play? Think of it correctly, Is it truly fun? You're there every goddamn day dealing with bullshit from people who seem to not understand that something isn't rdm, or who suspect ghosts on the whim that they die. Its all thinking straight and thinking you're the one who is always correct (Call me a hypocrite as you please, But i don't stand down if someone can't give me a good reason for something)\n\nThere is few to no reasons to stay. And im not meaning to drive you out of nnjg, But explain to me via steam of why you still are here. Please do.\n\nNow to move on to the big three\nBird flu - Possibly the only good one, Hes very inactive but i can understand why, But either way if he can't spend time to help and run the clan, Why the fuck should he be a \"Secretary\"\n\nBen- I used to like you ben, But all you're doing now is trying to make the clan look more \"Professional\" (Who gives a shit if it does? you're just making it less efficient to do practically anything and loaded the website up with random shit), Refusing to buy things for the big few servers (HEY GASH CODE ON THAT MORE, Why the fuck not hire a expert coder with all that cash you keep implying you have? (I can add more slots to the server if i wanted to ~ You))\nRefusing to add admins or mods? WHY SO? We need more and you damn well know so, the servers are shit and the current \"Hand picked\" staff you choose? They either never do shit (Somewhat me, Only on servers however) Or give ridiculous punishments (Week ban for two kills, Slaying without knowing shit if they were traitor or not, Slaying for accidents (Sure you don't need to forgive them, but all it does is establish you're more of a dick) and etc. From what you have shown, I personally think you use donation funds along with gash for you're own personal wants and needs.\n\n\nGash- Oh wow, Need i say more? The abusive fuck, The one who rdms more then most rdmers a day, The one who nobody ever tries to defy because he owns the big server, We all want you gone, if not most gash. Probably even ben. He's just scared the clan will die (FYI, it already is. Take a look back at the people quitting because they've come to a realization)\nYou despise me, Why? Am i too serious? Is it because i fight against higher ups due to the bullshit they spit out and try to make me accept? Fuck it, You never could give me a good reason and i doubt you ever will, The furthest you ever got was \"How you act\".\n\nThats all for the big 3, Now on to board of directors\n\nThe board is a fake excuse for a way of choosing shit, Its never been active, The people chosen were bullshit, Its just a label. A fucking label. Theres no reason for it, The people inside barely look at the wrongs and ups of things, Ben takes things there so i can't say shit about it, If you want a government make it public, For the PEOPLE, They're the ones this is affecting, Not us. You took a name, Slapped a bit of power on it and chose people you liked for it.\n\nOh, Not much to complain about, But I wasn't invited for inactivity, Yet fucking sanya was? Sanya hasn't posted nor been to a fucking nnjg server in MONTHS, Im pretty damn sure he quit nnjg.\n\nNow to address a few admins or general important people\n\nPharoah: Too quite, Gives too unreasonable bans\n\nDum: Chooses sides too easily, Unreasonable bans, A plain dick at moments but i still like him.\n\nViral: Nothing too bad, But agrees with sides too fucking easily\n\nKryzoid: too non-serious, Pisses me off at points when he shitposts or just doesn't take things seriously\n\nMark: Trying too hard to remove everyone known of fucking power just so he can get it, you call me a traitor when YOU fucking set me up for it.\n\nDeth - Nothing bad\n\nOthers - Nothing bad\n\nNow, I even spent my own time asking a few admins why they stay\n\nThey couldn't come up with a reasonable answer, The only thing was to hang out with friends\n\nCould you not possibly do it any where else?\n\nThings were left out, things were added. I just hope i got my damn point accross.\n\nGoodbye nnjg, and have a merry fucking Christmas.\n\n http://i156.photobucket.com/albums/t22/gaaracatchan/bye.gif "},{"postId":12521,"topicId":1392,"posterId":4,"postTime":1293262370,"postText":"i pretty much agree with you 99% on this, the reason i stay is of course to hang out with friends in the same community, but also because i enjoy tracking the (bad) development of the clan and having the experience to moderate a server, because back about 3 years when my older brother made MMO servers, i wasn't allowed to have any staff position at all, i've been happy learning through this and i think it's fun for the very reason as why i joined, because having the ability to take care of players making the game unfun for others only makes your gaming better.\n\nbut the community bit of the server(s) is complete shit now, yes.\n\nthe creation of S3G should definitely not happen with a clan that has it's shit straight."},{"postId":12522,"topicId":1392,"posterId":2,"postTime":1293267456,"postText":"I try to keep the community together, and dealing with IRL issues makes me stressed. The only reason you say I break rules is because you don't have patience to listen to what my reasoning is. I don't play on the servers much, and yet you act like everything I do and say is wrong. I've wanted you gone for a long time, and finally you are. I never acted upon it because I knew you would scream abuse and cry about it, or at least make this thread 10x worse with more rage. \n\nThe community isn't dying, and the players have fun on the servers. We're working on new additions, and have been trying to get things better under control. You haven't been helping much, since you don't go on any NNJG servers, or help with anything, besides complaining about every single post that isn't 100% on topic with the OP and reporting a post that you don't like/doesn't fit your standards. \n\nBasing the administration team was not needed, nor was saying 90% of things said on the OP. If you want to leave, just say so quietly. We're not an e-drama forum. If you want to tell people you're leaving, send them a PM or put it in your signature. I see no point to have made this besides to complain and try to go out with a \"bang\" hoping others will follow you so you can act important."},{"postId":12523,"topicId":1392,"posterId":54,"postTime":1293267736,"postText":">> Oh, Not much to complain about, But I wasn't invited for inactivity, Yet fucking sanya was? Sanya hasn't posted nor been to a fucking nnjg server in MONTHS, Im pretty damn sure he quit nnjg. \n\nSanya was on jail with me for a weekend non-stop.\n\n>> Mark: Trying too hard to remove everyone known of fucking power just so he can get it, you call me a traitor when YOU fucking set me up for it.  Or trying to remove dumbfucks like you who think their above owners.\n---------------\n\nRain, you think you're above everyone in this damn community. You're not. You ar-- were an admin, you're not above super admins, owners, no. But you sure as HELL act like it. Like unlocking locked threads and posting in them. All you're doing is trying to is gain post count. \n\nAnd I never liked you ever since the incident with Sanya. When you said \"You don't even deserve admin\" when you're the one who never did. You were never on the servers, and you complain about others never being on. Sure, you're active on the forums, but you got on the servers like once a month.\n\nGood fucking riddance kid."},{"postId":12535,"topicId":1392,"posterId":153,"postTime":1293283599,"postText":">> But all you're doing now is trying to make the clan look more \"Professional\" \nSince when?\nI'm trying to make it easy to manage for everyone.\n>> Refusing to buy things for the big few servers (HEY GASH CODE ON THAT MORE, Why the fuck not hire a expert coder with all that cash you keep implying you have? (I can add more slots to the server if i wanted to ~ You))  \nYou fucking buy something.\nCoders are expensive, if you wanna pay one, go ahead.\nTo ask me to pay for a coder, is just fucking retarted.\nDo you even listen to yourself?\nYou're one of the most ungrateful people, I've EVER met.\n>> Refusing to add admins or mods? WHY SO? We need more and you damn well know so, the servers are shit and the current \"Hand picked\" staff you choose? They either never do shit (Somewhat me, Only on servers however) \nOur servers shouldn't be 50% admins.\nMore admins = More Abuse\n>>  Or give ridiculous punishments (Week ban for two kills, Slaying without knowing shit if they were traitor or not, Slaying for accidents (Sure you don't need to forgive them, but all it does is establish you're more of a dick) and etc. From what you have shown, I personally think you use donation funds along with gash for you're own personal wants and needs.\n \nWhat the fuck is wrong with you?\nI never give ridiculous punishments.\nAnd the reason I said I can upgrade slots is BECAUSE OF THE DONATION MONEY.\n\nThink about what you post before you post it you mother fucker."},{"postId":12537,"topicId":1392,"posterId":112,"postTime":1293290347,"postText":"Well... bye...\n\nI don't understand how I'm too quiet? and yeah, my bans are too long, but fuck ''em. If they want to break the rules and troll and be retards then they don't deserve to play.\n\nBut yeah... The board of directors doesn't seem to have power. Shouldn't we have voted on the ban system before it was in place?\n\nBut honestl, you suck the fun out of everything. I understand you want the forums to be clean and proffessional, but on nearly every post you have to comment saying \"Is this really forum worthy?''\n\nNot to mention you fucking complain about ANYTHING that happens. You complained when people didn't answer with long enough posts. Seriously does anything ever make you happy?"},{"postId":12540,"topicId":1392,"posterId":396,"postTime":1293291067,"postText":">> Ben\":3mx55r9y]>> But all you're doing now is trying to make the clan look more \"Professional\" \nSince when?\nI'm trying to make it easy to manage for everyone.\n>> Refusing to buy things for the big few servers (HEY GASH CODE ON THAT MORE, Why the fuck not hire a expert coder with all that cash you keep implying you have? (I can add more slots to the server if i wanted to ~ You))  \nYou fucking buy something.\nCoders are expensive, if you wanna pay one, go ahead.\nTo ask me to pay for a coder, is just fucking retarted.\nDo you even listen to yourself?\nYou're one of the most ungrateful people, I've EVER met.\n>> Refusing to add admins or mods? WHY SO? We need more and you damn well know so, the servers are shit and the current \"Hand picked\" staff you choose? They either never do shit (Somewhat me, Only on servers however) \nOur servers shouldn't be 50% admins.\nMore admins = More Abuse\n>>  Or give ridiculous punishments (Week ban for two kills, Slaying without knowing shit if they were traitor or not, Slaying for accidents (Sure you don't need to forgive them, but all it does is establish you're more of a dick) and etc. From what you have shown, I personally think you use donation funds along with gash for you're own personal wants and needs.\n \nWhat the fuck is wrong with you?\nI never give ridiculous punishments.\nAnd the reason I said I can upgrade slots is BECAUSE OF THE DONATION MONEY.\n\nThink about what you post before you post it you mother fucker. \n\n@Unfair punishments\n\nnot directed at you, but rather a few of the people you donated.\n\n@ More admins comment\nI never implied it has to be a majority admins, But the current amount is pathetic, 1 ACTIVE super (Viral) and about 4 admins (Kry who isn't that active from what he told me, Dum , pharoah, both fairly active, Sanya Very inactive)\n\n@ Funds for lua coder\nYou keep implying that you do infact have the cash ben, But the thing wasn't directed solely at a lua coder (and fyi it wouldn't be THAAT expensive unless the guy is super good at it), Just overall spending cash to server and not just to hosting it, With the average donations you get its almost as if you gain personally from it\n\n@ Trying to make things easier\nYou say you try to make things easier, But in reality all you care about is how good or professional it looks (Proven before as even YOU stated you wanted things to look professional, or complained that things didnt). The ticket system if anything makes it go through more trouble, Changing forum engines wasn't needed, fucked quite a few things up too.\n\n@ Rest\nI took care of things with mark on steam, and along with gash.\n\n\nAlso, My main being perma-banned makes replying remarkably easier.\n\n\n@ Pharoah\n\nDon't sum things up and say the direct truth, The matter of fact of how long the post is doesn't matter as long as they contribute (Sorry kryzoid for forcing you to add more detail to a post once saying you agree, in retrospect that was pretty stupid, but it was only once)\n\nI was never supposed to be a fun admin, I wanted to keep things in order and to give the rest a basis to judge from, Which unfortunatley failed because nobody appears to care to listen\n\n\"Oh nooo rainrain, we're the same rank/higher rank, we don't need to listen to your shit, we own you and command you so don't even try to tell me what to do\"\n\nThankfully that wasn't the case with viral (Who occasionally went to ME for advice on what to do, And i did to him as well)"},{"postId":12542,"topicId":1392,"posterId":112,"postTime":1293292077,"postText":"You raged at Dum for saying that he disliked minecraft.\n\nPlus I haven't seen you play in months, and when you were playing you left punishing people up to somebody else. So don't go complaining about how the servers are when you don't even play."},{"postId":12566,"topicId":1392,"posterId":396,"postTime":1293328294,"postText":">> You raged at Dum for saying that he disliked minecraft.\n\nPlus I haven't seen you play in months, and when you were playing you left punishing people up to somebody else. So don't go complaining about how the servers are when you don't even play. \n\n\nI have played more then before recently, But i still can't deny that i wasn't active.\n\nAnd i have no idea what you're talking about saying i left decisions for others, I did it about once or twice when i didn't know the full story or was very etchy about the decision, But thats about it."},{"postId":12567,"topicId":1392,"posterId":153,"postTime":1293328451,"postText":">> >> You raged at Dum for saying that he disliked minecraft.\n\nPlus I haven't seen you play in months, and when you were playing you left punishing people up to somebody else. So don't go complaining about how the servers are when you don't even play. \n\n\nI have played more then before recently, But i still can't deny that i wasn't active.\n\nAnd i have no idea what you're talking about saying i left decisions for others, I did it about once or twice when i didn't know the full story or was very etchy about the decision, But thats about it. \n\nYou shouldn't be giving input if you're inactive."},{"postId":12569,"topicId":1392,"posterId":396,"postTime":1293329050,"postText":">> Ben\":3tv2rmrn]>> >> You raged at Dum for saying that he disliked minecraft.\n\nPlus I haven't seen you play in months, and when you were playing you left punishing people up to somebody else. So don't go complaining about how the servers are when you don't even play. \n\n\nI have played more then before recently, But i still can't deny that i wasn't active.\n\nAnd i have no idea what you're talking about saying i left decisions for others, I did it about once or twice when i didn't know the full story or was very etchy about the decision, But thats about it. \n\nYou shouldn't be giving input if you're inactive. \n\n\nNothing is stopping me from doing so, My way of deciding things would not change, if not by little."},{"postId":12578,"topicId":1392,"posterId":82,"postTime":1293337359,"postText":"I am surprised you have nothing to say about me, somewhat disappointed.\n\nI will miss you, honestly.\n\nGoodbye."},{"postId":12599,"topicId":1392,"posterId":153,"postTime":1293367612,"postText":"You give bad input, most likely because you're clueless about what goes on, being so inactive."},{"postId":12615,"topicId":1392,"posterId":101,"postTime":1293388403,"postText":"Yeah.... I didnt read all of the shit. At all. I only skipped to my name :D\n\n\nIndeed I am a pingas.\n\nBai, good times and bad."},{"postId":13517,"topicId":1392,"posterId":13,"postTime":1294056727,"postText":"I have stayed out of clan business for many reasons, we put up with all the problems and corruption and plain out not enjoyable experience for the very few people I still really cared about (Ben being number one), but you, and your attack on Holly, was the final reason I just stopped putting us through it. So it makes sense that I make an appearance again just for you.\n\nThis isn't news to you but most people didn't like you. You can tell yourself that it was because you did things people didn't like that needed to be done, and that's why you were hated, but I think anyone empty headed enough to believe that, really shouldn't have their opinion heard, but then again if they liked you in the first place, it speaks enough to what kind of person they are. All the things you did you just played up as something really big or good, but it was never anything more than any of the average people here can't or haven't done. Although I will give you credit for being one of the few that are willing to speak against the problems where most the rest of us will only complain about quietly to each other. I do have a level of respect for you under the very deep seeded hate, but for as forgiving and passive person as I am, even I can't really bite my tongue and try to brush it off.\n\nAnd don't get me wrong, I am not hating everything you are saying, a lot of it does have truth to it, just the way you come in and think you can put down something that Ben works so hard on, again proves how you think way too highly of yourself. To someone who has never had the stress of running a community and managing the staff to attempt to run healthy servers, can never never really know what it is like. Of course he like others here know it's not perfect, but it's not as easy you try to make it seem when you constantly insult it. With any group of people, clan or not, you cannot simply set a objective and have them complete it. People are different, people don't do exactly what they are told, people don't get along, and probably most importantly, people have personal agendas and will do what they want, to get what they want, which shows when you talk about \"bad admins\". Bottom line this is a volunteer position in all honesty, not a paying job, there is no need for people to truly do what you want.\n\nAnd then there is the very pure and universal thing that everyone should understand, time and money. Servers cost money, coders cost money, and what doesn't cost money, costs a mass amount of time and effort that just isn't possible for someone with other things to do.\n\nSo before you come and insult someone's love child, go out, start your own clan, try to achieve the perfect little set up you demand from here, make it half as populated with the number of servers here half as active, and then talk crap you actually know about. Because even with the infighting that has been going on for months, the servers are still active, growing and developing with new things all the time, and that on it's own is really an achievement. And the few good people here that have refused to be dragged into the mud people like you have dragged our once peaceful community into.\n\n\n\nAs for my personal redemption, you are completely right, I have been inactive, for things just like this. Fight after fight, backstab after backstab, friends being turned on each other one too many times, plus personal things a few of you know, a lot of us are sick and tired of it. Instead of raising a stink to try to get attention like you however, I just silently excused myself and left you to tear yourselves apart without me getting caught in the middle. And in no way have I quit, I have talked to a few from here since I have \"left\" (which is completely wrong I still do consider myself NNJG), and have explained myself to the few who have cared enough to ask, because honestly I still do care for the group and the few people I still have faith in, because these people have been like a family to me. \n\nYes I don't play Garry's Mod as much as I used to, I play other games (on and off Steam), and since I have not been active here I have been letting her use my account more, but despite what you think I still do play sometimes as Mark will tell you, but only when I know none of the problem people here are on, and the fact that you don't know I play says I am doing a good job.\n\n\n\nSo please do leave, it is one less problem that this community needs, maybe I will even start being a bit more active now. However seeing as you have done this before at least once that I remember, I don't expect to see the last of you."},{"postId":13528,"topicId":1392,"posterId":82,"postTime":1294087157,"postText":">>  Cake\":3nqz02rv] you think way too highly of yourself. \nYeah, I thought it was bullshit when he came back telling Ben and Gash to give him his admin back, then abuses the power the second he gets it. He acted like he was the second coming of Christ. and Hi Sanya =D"},{"postId":13534,"topicId":1392,"posterId":4,"postTime":1294090371,"postText":">> >>  Cake\":3vst7yar] you think way too highly of yourself. \n Hi Sanya =D \n\nOh hey.\nWho's Holly? O_o"},{"postId":13579,"topicId":1392,"posterId":262,"postTime":1294162330,"postText":"If your going to leave then do so. Nobody wants to be bashed or wants to deal with your drama."},{"postId":13586,"topicId":1392,"posterId":13,"postTime":1294173284,"postText":"Hi Dom and Kryzoid\n\nI told a few in private about her but never really said to the community for fear of punishment for sharing account, but since I have kinda eased up on worrying about it and half of you already now why not say it lol. She uses my account and has taken over my Steam community profile, but I never really used it so ehhh. I still play and chat but about half the time it is her on. Honestly anyone who has even glanced at my profile in last few months should know though XD"},{"postId":13617,"topicId":1392,"posterId":4,"postTime":1294223111,"postText":"She a friend? I talked to her, but she didn't say much at all."}]}