{"topicId":1799,"forumId":1,"topicTitle":"I'm back to being active","topicTime":1296470808,"topicViews":137,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"Bird Flu","topicLastPosterColor":"000099","topicLastPostTime":1296524829,"posts":[{"postId":15201,"topicId":1799,"posterId":54,"postTime":1296470808,"postText":"Don't pull a \"TL;DR\" it's a good story.\n\nSo, today I was going server to server hacking on them in CS:S, the usual. Then I see a message I usually don't see, it says something like \"banned visit *kac site here* for more information\" So I go there, it's the KAC site. Didn't think anything of it. I turn OFF my hacks and go in the server I have super admin on, it's an office server with KAC on it. It tells me I'm banned from all KAC server. FUCK\n\nFor those of you who don't know what KAC is, it's a anti-cheat addon for servers. It detects if you have hacks or not. A lot of servers use it now a days, including the server I have admin on. So I tell the owners, they laugh, told me they'll fix it tomorrow.\n\nSo I visit the KAC site, I was gonna pretend I got hacked or some shit. I try to register, I failed twice. Then I get banned from the site for using a spam bot, WHAT?! At that point I was laughing hard. \n\nThen some dude \"Kornpops\" a little ginger kid who is realllly dumb comes into teamspeak. He was asking people to DoS someone from Exiled for him, EthanTheGreat. Ethan is a cool guy, so I tell him. Everyone in the vent laughs like hell. They go on the server I have admin on and used a hack I guess. So then he got banned, and aparnly I told them to do it. Which I didn't. \n\nI told them that I told them about Kornpops only, some dude Soltez rages his ASS off on me. \"WHAT THE FUCK, ARE YOU DUMB?! You should lose your admin you dumb piece of shit, get the fuck out of here you dumb fuck\" I respond with \"umad? Stop raging, I only told them about Kornpops being dumb, calm down bro\" He rages more, I didn't care.\n\nA little bit later I get dragged down with the owners, they call me dumb, blah blah. I told them I only told Exiled about Kornpops being dumb and asking to DoS Ethan. He says it caused problems. After a bit, he removed my admin. I was a bit mad at this point. I asked him why he said \"You're inactive, you're KACed, you talk about Exiled all the time\" Now, I only talk about exiled every so often. Like when I got 2 admins demoted from there.\n\nSo he demoted me, I talk to him on steam, bitching. He says it's only for a week, so at this point I'm a bit relieved. I talk to Sadistic Slayer on vent (owner of Exiled Servers) about what happened. He said \"Why is Clearshot so mad? If they're really gonna demote you for THAT, why even care? It's not even worth it\" \n\nHe was TOTALLY right, I got demoted for even talking about Exiled, which is bull shit. It's like me talked to Gash on steam about some other community, yeah, that dumb. So, I'm going to be more active now that I'm done with their server. I've been apart of that place for 8-9 months, and they do me like this? Fuck that, no, I'm not gonna take it. Done."},{"postId":15213,"topicId":1799,"posterId":366,"postTime":1296500803,"postText":"You forgot to add.\n\nOpen the door, get on the floor, EVERYBODY WALK THE DINOSAUR."},{"postId":15216,"topicId":1799,"posterId":112,"postTime":1296501937,"postText":"I'm glad NNJG is your backup. >.>\n\nWelcome back to being active though I guess. Sucks that you got KAC banned..."},{"postId":15218,"topicId":1799,"posterId":101,"postTime":1296503438,"postText":"Quick question: Why did you tell us this?"},{"postId":15231,"topicId":1799,"posterId":54,"postTime":1296513939,"postText":">> Quick question: Why did you tell us this?  Because I like share my inner feelings, problem?\n\n@ Swaim - lolwut?\n\n@ Pharaoh - It's not a backup.. I was kinda switching back and forth due to me having mod on NNJG and admin on the other server."},{"postId":15245,"topicId":1799,"posterId":3,"postTime":1296524829,"postText":">> >> Quick question: Why did you tell us this?  Because I like share my inner feelings, problem? \nThat's how I coop with insanity."}]}