{"topicId":3685,"forumId":35,"topicTitle":"GHost app for superadmin jail","topicTime":1313733062,"topicViews":121,"topicReplies":3,"topicStatus":1,"topicFirstPosterName":"Ghostofyou","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1313782592,"posts":[{"postId":29874,"topicId":3685,"posterId":525,"postTime":1313733062,"postText":"1) What position are you applying for: Super Admin\n2) Your age: 21\n3) Your location: Canada\n4) Current In-Game Name: Holykittens\n5) Steam ID & Link to your Steam Community Profile: http://steamcommunity.com/id/Holykittens/ STEAM_0:0:23550316\n6) How did you find out about NNJG:friends\n7) How long have you been involved with NNJG and/or Shadow's servers: 3 months\n8) What you can bring to the NNJG Team: Moderation\n9) Why do you want to be part of the NNJG Team: Because id like to moderate the jail server since not alot of admin does thing\n10) Do you have any past experience with the position you're applying for: yes ive already been admin on the flood server\n11) Do you own a decent microphone, and do you frequently utilize it: Yes\n12) Any other comments or information you can provide: Not really"},{"postId":29885,"topicId":3685,"posterId":101,"postTime":1313736506,"postText":"Only moderator/admin positions are open, and you do not have any recommendations. Also, you do not meet the post count-requirements.\n\nIf you get the recommendations and meet the post count requirements, feel free to post again. Locked.\n\nAlso, I have no idea how to move a topic to Denied, so some other admin please do that (and teach me how.)"},{"postId":29908,"topicId":3685,"posterId":115,"postTime":1313770626,"postText":"Dum, at the bottom of the page, there are admin \"quick tools\". Click on it, and it will give you all these options to do with the topic.\n\nGo down to move, then press ok. Uncheck \"leave a ghost topic\" and move it to Denied."},{"postId":29925,"topicId":3685,"posterId":101,"postTime":1313782592,"postText":"Done."}]}