{"topicId":4780,"forumId":14,"topicTitle":"Dr. William L. Fudge","topicTime":1320395349,"topicViews":131,"topicReplies":3,"topicStatus":1,"topicFirstPosterName":"wlfudge","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1320552015,"posts":[{"postId":37083,"topicId":4780,"posterId":706,"postTime":1320395349,"postText":"1) Which server: TTT\n2) Your in-game name:DR William L. Fudge\n3) Your SteamID:STEAM_0:1:26710649\n4) When were you banned and for how long: \t11-03-11 23:53  Perm\n5) Reason for ban: Trolling, falsely attempting to get a player banned, player disrespect.\n6) Who banned you: MrGash\n7) Why should we unban you or shorten your ban period:\nUm not really sure why i am banned. It said trolling/Falsifying evidence/Player disrespect. Not sure how i falsified evidence at all i had proof of the rdming in the ban request. Trolling i can see when i kept calling shameless and rdmer. Player disrespect, also i did call shameless a rdming retard out of madness when he false called me out, but other than that nothing.  Also I said I was going to post it when i stopped playing which i did. I even warned shameless i was going to post it if he didn't slay himself, which obviously he didn't, because normally if an admin was on he would have been slayed"},{"postId":37095,"topicId":4780,"posterId":2,"postTime":1320434142,"postText":"Please follow the format if you wish to be unbanned or have your ban shortened."},{"postId":37101,"topicId":4780,"posterId":706,"postTime":1320441907,"postText":"LOL my bad. I was just in shock when i got banned"},{"postId":37231,"topicId":4780,"posterId":2,"postTime":1320552015,"postText":">> Um not really sure why i am banned. \nI do not believe this.\n\nI have reconsidered your original ban time, and it has been shortened to one month. \nPlease take note that if this was anyone else, it would stay permanent. But, considering how long you have been with us, and this seems to be the first time you have been involved in an incident with this level of severity, it has been shortened. Take it as a warning, I will not tolerate this kind of behavior. I'm disappointed one of our regulars would treat a player how you did when he was not breaking any rules."}]}