{"topicId":1694,"forumId":30,"topicTitle":"Reduced player amount. please.","topicTime":1295380711,"topicViews":243,"topicReplies":17,"topicStatus":0,"topicFirstPosterName":"Swaim","topicFirstPosterColor":"","topicLastPosterName":"zemey","topicLastPosterColor":"","topicLastPostTime":1295905370,"posts":[{"postId":14469,"topicId":1694,"posterId":366,"postTime":1295380711,"postText":"Now think about this, when is the last time you played a game of  Jail, when everything was going okay and people actually understood the rules with 25 other people around you and mods/admins didn't have to be on there for people to listen, that's right you probably didn't.(If you actually did then, I really wish I could be you. I wish for something like that everyday.) Here's my Example of the things that I have seen with 26 people playing at once. Imagine this, you're the warden, \n(not an Admin/mod warden) there's 25 other players, witch maybe 4 people who actually know the rules, 3 of them being prisoners, and 1 being the warden, because let's face it, the only reason he would be acting like a warden is because he knows how to play game right. Then all the guards have no idea what they're doing, so all they do is freekill after the warden is giving orders because they, not only didn't read the rules, but they did not hear the warden because 5 people are talking at once. Now here's where the prisoners come in. Because of the enormous amount of prisoners, guards get overwhelmed and shoot when to many people are near. With so many prisoners running around the warden can't even have his orders given out because, the second they decide to rush the fuck out of cops \"prisoners have won the round\" so it's no match for the warden and his uneducated guards. Half of the time guards don't even give a shit. \n\nSo basically to put it all in a nutshell, you're a warden trying to control a total of 25 people that don't know what they're doing and to top it off you're not an Admin/mod so they won't listen no madder what. It's basically a nuke five feet from blowing up on the ground, you cannot stop it.\n\nNow remember this is just a suggestion, please at least think about it, I'm only asking a reduction to at least a minimum of 18 players, now that's just me, but at least understand where I am coming from."},{"postId":14472,"topicId":1694,"posterId":372,"postTime":1295383374,"postText":"Minimum of 18 players?  I think you meant maximum because setting a minimum would just further increase the problems you have stated."},{"postId":14473,"topicId":1694,"posterId":101,"postTime":1295383758,"postText":"I think it's fine how it is."},{"postId":14475,"topicId":1694,"posterId":389,"postTime":1295384081,"postText":"Heres what I think. Change the swap list thing. Make it so people can just directly join the position as guard or prisoner.\n\nMake a new rule saying. \n1 Guard for Every 4 Prisoners (1 Traitor for Every 4 Innos).\nGuard must have possession of a mic.\nGuards must have read the rules on MOTD.\nand so on.\n\nI don't like the swap list thing currently, people might have accidently changed or people who don't know rules and want to freekill will be on there and will stay there causing others to be unable to change into guard. TROLLS\n\nAlso make it so whenever someone joins, they must automatically join in as a prisoner first, and then if they want to be guard, he can change into a guard."},{"postId":14479,"topicId":1694,"posterId":101,"postTime":1295384822,"postText":">> Heres what I think. Change the swap list thing. Make it so people can just directly join the position as guard or prisoner.\n\nMake a new rule saying. \n1 Guard for Every 4 Prisoners (1 Traitor for Every 4 Innos).\n \n\n\n NO! \n\n\nHow the HELL do you think that would do ANYTHING, and how do you THINK people will obey that rule?"},{"postId":14485,"topicId":1694,"posterId":389,"postTime":1295386665,"postText":"I dont understand whats so bad about it? It more about organizing the server and the players so that it isn't so chaotic all the time."},{"postId":14489,"topicId":1694,"posterId":366,"postTime":1295387975,"postText":">> Minimum of 18 players?  I think you meant maximum because setting a minimum would just further increase the problems you have stated. \nYou know what I meant by that, don't try to instigate."},{"postId":14490,"topicId":1694,"posterId":389,"postTime":1295389412,"postText":"Whats the current ratio for guard:prisoner?"},{"postId":14491,"topicId":1694,"posterId":101,"postTime":1295389785,"postText":">> Whats the current ratio for guard:prisoner? \n\n\nAbout 1:2"},{"postId":14492,"topicId":1694,"posterId":366,"postTime":1295389818,"postText":">> Whats the current ratio for guard:prisoner? \nusually it's half and half because people don't don't know how to make it even."},{"postId":14513,"topicId":1694,"posterId":2,"postTime":1295397671,"postText":"TL;DR\n\nFrom what I skipped through it looks like you want the player count reduced.\n\nThink of this: On CS:S Jailbreak servers, some have up to 50 players on at one time, and since the Jail server doesn't lag with that many people, I'd say we keep it at what it is."},{"postId":14527,"topicId":1694,"posterId":389,"postTime":1295400351,"postText":"Or we can go with my idea about changing the ratios\n\nOR\n\nWe can choose to have different something in the server to solve people not knowing rules. Having the !motd pop up randomly every 30 mins?\n\nForce every player to open the !motd every 30 mins. Do this for about a week and see if it helps. This will probably piss people off and thus they'll complain about it. Just tell them it will happen until most people know about the rule or something.\n\nSuggestion is 30 mins, but better choice is 10 mins."},{"postId":14530,"topicId":1694,"posterId":101,"postTime":1295401547,"postText":">> Or we can go with my idea about changing the ratios  \n\nNo\n\n\n\n>> Having the !motd pop up randomly every 30 mins? \n\nNo\n\n\nAgain flame, how do you think all of your ideas will HELP? They all just suck to be honest."},{"postId":14545,"topicId":1694,"posterId":366,"postTime":1295417258,"postText":">> Again flame, how do you think all of your ideas will HELP? They all just suck to be honest. \nHow often do you play the jails servers man?\n\nBecause every time I join no one knows the rules, they always say freekill at anytime they die because they don't read the rules.\nAlso every time I join there, it seems to be a distinct 1.0 ratio between guards and prisoners.\n\n>> TL;DR\n\nFrom what I skipped through it looks like you want the player count reduced.\n\nThink of this: On CS:S Jailbreak servers, some have up to 50 players on at one time, and since the Jail server doesn't lag with that many people, I'd say we keep it at what it is. \n but it does have lag man, not to an extreme amount but high enough that it's noticeable.\nAlso you got to read all of what I said man because it's not lag that needs to be fixed, it's just it's impossible to play with 26 people because, half of them don't understand the rules. If we reduced the number, and I am not saying perma. but merely until we have a better working system for the jail server, it would help to control it when people are braking rules. Because with 25 other people complaining and yelling I can't moderate alone."},{"postId":14548,"topicId":1694,"posterId":389,"postTime":1295459161,"postText":"Okay, so do you guys want me suggestion or no? I have a 2 1/2 page suggestion."},{"postId":14550,"topicId":1694,"posterId":101,"postTime":1295466693,"postText":">> >> Again flame, how do you think all of your ideas will HELP? They all just suck to be honest. \nHow often do you play the jails servers man?\n\nBecause every time I join no one knows the rules, they always say freekill at anytime they die because they don't read the rules.\nAlso every time I join there, it seems to be a distinct 1.0 ratio between guards and prisoners.\n\n>> TL;DR\n\nFrom what I skipped through it looks like you want the player count reduced.\n\nThink of this: On CS:S Jailbreak servers, some have up to 50 players on at one time, and since the Jail server doesn't lag with that many people, I'd say we keep it at what it is. \n but it does have lag man, not to an extreme amount but high enough that it's noticeable.\nAlso you got to read all of what I said man because it's not lag that needs to be fixed, it's just it's impossible to play with 26 people because, half of them don't understand the rules. If we reduced the number, and I am not saying perma. but merely until we have a better working system for the jail server, it would help to control it when people are braking rules. Because with 25 other people complaining and yelling I can't moderate alone. \n\n\nI play several times a day, thank you very much. And you must play for only 1 round, because a 1:1 ratio between guards and prisoners is a glitch, and it gets fixed the round after.\n\nI only notice lag that is FPS lag, I don't notice ANY server lag."},{"postId":14554,"topicId":1694,"posterId":366,"postTime":1295471037,"postText":">> I play several times a day, thank you very much. And you must play for only 1 round, because a 1:1 ratio between guards and prisoners is a glitch, and it gets fixed the round after.\n\nI only notice lag that is FPS lag, I don't notice ANY server lag. it does get fixed but, 1.2 is still pretty bad if you're counting a high amount of players. I actually play for hours when I get on there, and again, you probably don't see me because I'm a nighttime mod."},{"postId":14775,"topicId":1694,"posterId":392,"postTime":1295905370,"postText":"More players the better, as long as there isn't mic spam and arguing over who can be the warden or when you play last reaction and another dumbfuck guard cuts in and does a command"}]}