{"topicId":3001,"forumId":3,"topicTitle":"The Unlisted Rules","topicTime":1307926865,"topicViews":782,"topicReplies":71,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"Playerhata27","topicLastPosterColor":"009900","topicLastPostTime":1315272298,"posts":[{"postId":23867,"topicId":3001,"posterId":634,"postTime":1307926865,"postText":" Intro \nThere are some rules that are in use on the TTT server which are not mentioned in the MOTD. \nI will attempt to explain most of them in an organized fashion using this thread. If I miss any rules,\n besides the ones already listed in the MOTD,  post them here or pm me and I will add them.\n Note:  Many of these rules make references to suspicion, traitorous activities, and rule-breaking.\nSuspicion is not kill-able, no matter how suspicious they are.\nTraitorous activities are kill-able and are usually the only time you may kill someone.\nRule-Breaking is not allowed ever and will result in punishment\n\n  Traitor Baiting     ADDED  \nTraitor Baiting is shooting around someone or near them to make it seem like you are attempting to shoot them.\nIt is against the rules to Traitor Bait.[/s]\n\n  Traitor Tester     ADDED  \nOn certain maps there is a place that tests you for being a traitor.\nYou can be proven innocent using these testers.\nNo one can force anyone to use a tester.\nNot using a tester only makes suspicion.[/s]\n\n  Advertising     ADDED  \nIt is against the rules to advertise another server or product.[/s]\n\n  Naming     ADDED  \nTaking someones name or making your name very similar in pronunciation is called impersonation and is against the rules. After 1 warning you may be kicked, after that you may be banned.\nYour name may not be racist or advertise anything.\nClan tags are permitted.\nDifferent treatment may not be applied to people based on their clan.\nAnyone can wear the NNJG clan tag, it signifies that they enjoy the NNJG servers, nothing else.[/s]\n\n  Leaving the Map     ADDED  \nTo read about what is considered leaving the map. Click Here. [/s]\n\n  Point Farming     ADDED  \nYou may not afk in spectator or just sit around and do nothing \njust to earn points from the 10 points you get per 30 minutes on the server.[/s]\n\n  False Call-out     ADDED  \nCalling out someone without proof or based on suspicion \nThis is against the rules if you are an innocent. \nIf someone dies due to a false call-out then the person who did the false call-out has done a traitorous activity and may be killed.\nCall-outs are retractable, you can cancel them.\nTraitors can use False Call-Outs as a mean of furthering their goal to kill the innocents.\n Example \nPlayerX calls out PlayerY without proper evidence. (Both are innocent)\nPlayerZ kills playerY due to the call-out.\nPlayerX has broken the rules. PlayerZ has not.[/s]\n\n  Ammo Checking     ADDED  \nNo one can force you to show ammo. \nYou cannot be killed for not showing your ammo. \nThis can only be used for suspicion and suspicion is not kill-able. \nAmmo checking never proves innocence.\nKilling based on ammo/not showing ammo is against the rules.[/s]\n\n Self Call-Out \nIf you say anything that refers to you as being a traitor you may be killed.\n Example \nPlayerX says \"I would crowbar fight you if it wasn't my traitor round.\"\nAnyone may now kill PlayerX.\n\n  Weapon Call-outs     ADDED  \nYou cannot kill someone based on what weapon they have under most circumstances. \nIf you use deductive reasoning to come to a conclusion and a weapon is one of the factors, that is permitted.\n-- Example \nPlayerX says to kill anyone with a HUGE\nPlayerY has a HUGE\nPlayerZ kills PlayerY because of PlayerX's statement.\nAt this point PlayerX has broken the Weapon Call-out Rule and PlayerZ has RDMed\n-- Logic Example \nPlayerX says to kill anyone with a sniper on the roof of BuildingX.\nOnly PlayerY and PlayerZ both have snipers and are on the roof of BuildingX\nPlayerY is innocent and he knows it.\nPlayerY may kill PlayerZ and it is not RDM.[/s]\n\n  Live Checking     ADDED  \nA live check is when you ask who is still alive. \nPeople that do not respond to live checks can be killed because this is considered a traitorous activity. \nYou must allow people around 30 seconds to respond. \nLive checks must be typed and you must respond to a live check with text. This can be easily done with the Suit Zoom function.\nIf you shoot at someone who does not respond to a live check and they kill you then it is RDM.\n-- Example \nPlayerX says \"Live check. Respond or die.\"\nPLayerY does not respond after 30 seconds.\nPLlayerX may now kill PLayerY[/s]\n\n Prolonging the Round \nAs a traitor you must make some attempt to kill the innocents.\nMods may give warnings. \"Traitors better trait\"\nIf you are the last traitor do not wait for extended periods of time before killing someone in hopes that it will help you win. It will not.\n\n  The Following Rule     ADDED  \nYou cannot kill someone for following you without giving three warnings first.\nThis does not apply to detectives. They may follow you.\nYou have to give at least 3 seconds of time in between these warnings.\nEach warning must include the person's name.\nAfter the third warning it is considered traitorous activity you may shoot them and it is not RDM. \nIf they shoot back at you for this then they are RDMing.[/s]\n\n  Last Seen     ADDED  \nYou cankill based on last seen if you use a visualizer and it shows that they were killed from the front.\nOther than these you can not use Last Seen.[/s]\n\nEDIT: Changed Last Seen rule, courtesy of Dum.\nEDIT: Added Advertisement rule, courtesy of Smooglez\nEDIT: Changed Following rule, courtesy of Moonrakerone\nEDIT: Changed Following rule, courtesy of Pharaoh\nEDIT: Added Point Farming rule and Traitor Tester rule, courtesy of Overclocking\nEDIT: Changed Last Seen rule, courtesy of NinjaBreadMan\nEDIT: Added Impersonation and Prolonging the Round rules, courtesy of Overclocking\nEDIT: Changed Impersonation rule into Naming rules\nEDIT: Added Leaving the Map rule\nEDIT: Crossed out rules that have been added to the official rules."},{"postId":23868,"topicId":3001,"posterId":2,"postTime":1307928132,"postText":">> \n Last Seen \nYou cannot kill based on last seen, it is only suspicion. \nBut if Viral was the one last seen, it's OK, right?"},{"postId":23869,"topicId":3001,"posterId":101,"postTime":1307929130,"postText":"You may want to edit that so that if they are looking at the person when they die (visualizer) then you may kill them. Love doing that as detective."},{"postId":23874,"topicId":3001,"posterId":6,"postTime":1307931305,"postText":">> >> \n Last Seen \nYou cannot kill based on last seen, it is only suspicion. \nBut if Viral was the one last seen, it's OK, right? \nI would hope not >.>.\n\nAnyways, good job on writing these."},{"postId":23878,"topicId":3001,"posterId":272,"postTime":1307933263,"postText":">> >> \n Last Seen \nYou cannot kill based on last seen, it is only suspicion. \nBut if Viral was the one last seen, it's OK, right? \nYes"},{"postId":23881,"topicId":3001,"posterId":397,"postTime":1307934034,"postText":"you forgot advertizing other servers that are not of nnjg."},{"postId":23885,"topicId":3001,"posterId":4,"postTime":1307936343,"postText":">> >> \n Last Seen \nYou cannot kill based on last seen, it is only suspicion. \nBut if Viral was the one last seen, it's OK, right? \nYes, that is perfectly acceptable."},{"postId":23922,"topicId":3001,"posterId":235,"postTime":1307988948,"postText":">> \n\n Last Seen \nYou cannot kill based on last seen unless you use a visualizer and it shows that they were killed from the front.\n\nEDIT: Changed Last Seen rule, courtesy of Dum. \n\nBut what if you are detective and the person was knifed in the front, can you kill the person last seen?"},{"postId":23923,"topicId":3001,"posterId":634,"postTime":1307989346,"postText":">> \nBut what if you are detective and the person was knifed in the front, can you kill the person last seen? \nI think that would be reasonable but we need an admin ok on this."},{"postId":23924,"topicId":3001,"posterId":237,"postTime":1307989881,"postText":"Add that you  must include their name in the follow warning."},{"postId":23948,"topicId":3001,"posterId":112,"postTime":1308012543,"postText":"Following is a warning every 3 seconds"},{"postId":23954,"topicId":3001,"posterId":79,"postTime":1308015200,"postText":"Also, just a note about self incrimination (calling yourself out).\n\nYes you are allowed to be killed on sight, BUT, and this is a major but, if you kill a traitor before you are killed yourself, ID the body. You can not be killed for self incrimination earlier. Yes you called yourself out (as a joke as people often do) but soon as you are confirmed inno from killing a T it is then blatant RDM. (blatant rdm is directly shooting someone in the face or killing after someone is confirmed (if memory suits me correctly))"},{"postId":23959,"topicId":3001,"posterId":252,"postTime":1308017499,"postText":"What about detectives and traitor testers/weapon checks? \nAnd you forgot about points farming."},{"postId":23966,"topicId":3001,"posterId":634,"postTime":1308018615,"postText":">> Also, just a note about self incrimination (calling yourself out).\n\nYes you are allowed to be killed on sight, BUT, and this is a major but, if you kill a traitor before you are killed yourself, ID the body. You can not be killed for self incrimination earlier. Yes you called yourself out (as a joke as people often do) but soon as you are confirmed inno from killing a T it is then blatant RDM. (blatant rdm is directly shooting someone in the face or killing after someone is confirmed (if memory suits me correctly)) \nAn Admin has to confirm this but it sounds reasonable."},{"postId":25059,"topicId":3001,"posterId":252,"postTime":1309400650,"postText":"Please add the Impersonating rule and holding up rounds as a traitor."},{"postId":25398,"topicId":3001,"posterId":634,"postTime":1310060712,"postText":">> Please add the Impersonating rule and holding up rounds as a traitor. \nDone.\n\n>> Also, just a note about self incrimination (calling yourself out).\n\nYes you are allowed to be killed on sight, BUT, and this is a major but, if you kill a traitor before you are killed yourself, ID the body. You can not be killed for self incrimination earlier. Yes you called yourself out (as a joke as people often do) but soon as you are confirmed inno from killing a T it is then blatant RDM. (blatant rdm is directly shooting someone in the face or killing after someone is confirmed (if memory suits me correctly)) \n\n>> But what if you are detective and the person was knifed in the front, can you kill the person last seen? \nThese two adjustments still need admin approval."},{"postId":25404,"topicId":3001,"posterId":243,"postTime":1310068396,"postText":"I don't know if this is a \"rule\", I think i should put it here anyways. It would be nice if people knew:\nAnyone can wear the [NNJG] Tag, people wearing the tag may or may not be part of NNJG."},{"postId":25405,"topicId":3001,"posterId":665,"postTime":1310068636,"postText":">> I don't know if this is a \"rule\", I think i should put it here anyways. It would be nice if people knew:\nAnyone can wear the [NNJG] Tag, people wearing the tag may or may not be part of NNJG. \nAnd that just because they are wearing the tag, does not mean that they are an admin."},{"postId":25415,"topicId":3001,"posterId":634,"postTime":1310078290,"postText":"Can you be banned based on what clan you are in?"},{"postId":25416,"topicId":3001,"posterId":101,"postTime":1310078479,"postText":"No."},{"postId":26179,"topicId":3001,"posterId":634,"postTime":1311530735,"postText":">> >> Also, just a note about self incrimination (calling yourself out).\n\nYes you are allowed to be killed on sight, BUT, and this is a major but, if you kill a traitor before you are killed yourself, ID the body. You can not be killed for self incrimination earlier. Yes you called yourself out (as a joke as people often do) but soon as you are confirmed inno from killing a T it is then blatant RDM. (blatant rdm is directly shooting someone in the face or killing after someone is confirmed (if memory suits me correctly)) \n\n>> But what if you are detective and the person was knifed in the front, can you kill the person last seen? \nThese two adjustments still need admin approval. \nStill."},{"postId":26463,"topicId":3001,"posterId":237,"postTime":1311784001,"postText":">> >> I don't know if this is a \"rule\", I think i should put it here anyways. It would be nice if people knew:\nAnyone can wear the [NNJG] Tag, people wearing the tag may or may not be part of NNJG. \nAnd that just because they are wearing the tag, does not mean that they are an admin. \n\nAND VIP IS NOT ADMIN JESUS CHRIST"},{"postId":26471,"topicId":3001,"posterId":769,"postTime":1311790102,"postText":">> >> >> I don't know if this is a \"rule\", I think i should put it here anyways. It would be nice if people knew:\nAnyone can wear the [NNJG] Tag, people wearing the tag may or may not be part of NNJG. \nAnd that just because they are wearing the tag, does not mean that they are an admin. \n\nAND VIP IS NOT ADMIN JESUS CHRIST Meh, its really only the newbs that believe that. Once you tell them the color codings, they've pretty much got it down forever."},{"postId":26505,"topicId":3001,"posterId":812,"postTime":1311800633,"postText":"Can't remember who, but I asked a Mod and they said that only Detectives can force to be tested, and if the person that is being forced blatantly declines, they can be killed for it.\n\nIS THIS TRUE. DAMMIT WE NEED TO KNOW. CAN DETECTIVES FORCE?"},{"postId":26506,"topicId":3001,"posterId":634,"postTime":1311800941,"postText":">> Can't remember who, but I asked a Mod and they said that only Detectives can force to be tested, and if the person that is being forced blatantly declines, they can be killed for it.\n\nIS THIS TRUE. DAMMIT WE NEED TO KNOW. CAN DETECTIVES FORCE? \nno."},{"postId":26509,"topicId":3001,"posterId":812,"postTime":1311801091,"postText":">> >> Can't remember who, but I asked a Mod and they said that only Detectives can force to be tested, and if the person that is being forced blatantly declines, they can be killed for it.\n\nIS THIS TRUE. DAMMIT WE NEED TO KNOW. CAN DETECTIVES FORCE? \nno. \nAre you sure dude? Could we have an Admin confirm this, because it's frustrating going back and forth with this rule."},{"postId":26511,"topicId":3001,"posterId":101,"postTime":1311801128,"postText":"No."},{"postId":26515,"topicId":3001,"posterId":812,"postTime":1311801309,"postText":"Alright, roger that"},{"postId":26698,"topicId":3001,"posterId":812,"postTime":1311912698,"postText":"What's the rule on self callouts yet they were lying? Slayable?"},{"postId":26701,"topicId":3001,"posterId":634,"postTime":1311914523,"postText":">> What's the rule on self callouts yet they were lying? Slayable? \nhmmmmm well I'd say no because the person already got killed for their self callout but I can see how that would be a false callout as well.\nBut the only person who is harmed in a self callout is the person doing the callout soooooo.... Dum? Quack? Pharaoh? Gash?"},{"postId":26705,"topicId":3001,"posterId":812,"postTime":1311915715,"postText":"Also, going along with that kinda, say there are three innos, Playerhata, Destar, and Crisis.\n\nPlayerhata RDM'd Destar, so Crisis Kills Playerhata.\n\nMimeyy comes in and kills Crisis for killing an innocent. Does Mimeyy get slayed for killing someone that was pretty much following the rules?"},{"postId":26840,"topicId":3001,"posterId":101,"postTime":1311974640,"postText":"They said they were traitor and they paid by dying, I doubt that either should be punished - the killer or the person killed."},{"postId":26856,"topicId":3001,"posterId":79,"postTime":1311979211,"postText":"Imo, it hurts the person who killed the one calling themselves out. For instance. I call myself out as traitor. A inno kills me as inno. He loses 2 points and the 100 or so karma that goes with it. Personally this could be a form of trolling, you get enough friends to do it you can get the person karma banned. I believe some punishment should be needed to stop rdm. Since some people will just continue the chain. Keep killing the one who killed previous. Overall this could turn into a huge rdm spree and the person who started it called their self out. If that happens, everyone who continued the spree lost 2 points and 100 karma.\n\nOverall i think it should be a slay able offense or at least a warning then repeated offense can become a slay/slap."},{"postId":26966,"topicId":3001,"posterId":1,"postTime":1312056713,"postText":"~I think we should just update all of the rules whether they are stated or not. It's starting to really get annoying having people bitch and moan about something they have done or something that someone has done to them because rules aren't clarified.\n I can understand if the player doesn't care, but some people who play TTT take is waaaay too serious and get butt hurt every time.\nThe worse part is they would just come back and try doing the same crap thinking they can get away with it because they saw someone else do it and whine when they get caught.\n-_-"},{"postId":26967,"topicId":3001,"posterId":79,"postTime":1312057522,"postText":"Just do what i do ;). If a admin does it, it must be allowed ;).\n\nSomething about self call out should be done though if they are inno. Cause karma/point loss does get annoying and id think it is a form of trolling. Can we get a admin or someone to make comments on this so far."},{"postId":26982,"topicId":3001,"posterId":377,"postTime":1312067587,"postText":"I thought Calling yourself out was instant KOS???"},{"postId":26986,"topicId":3001,"posterId":101,"postTime":1312067813,"postText":"Crisis, you think everything is \"trolling\" tbh.\n\nOn a side note, if someone is doing is constantly, then you should just learn not to kill them. If you do then that's just you giving yourself an excuse to kill them (which technically is not wrong on your part), but it is your own fault you're losing karma incredibly fast. If you get banned for it, that is your fault. You chose when to kill and not kill somebody."},{"postId":26993,"topicId":3001,"posterId":79,"postTime":1312071307,"postText":"This is true Dum, you chose when and when not to kill them. But overall false call out is one of the rules, and calling yourself out as inno is a false callout. Even if done by yourself. Also, doing it constantly is just plain out purposely trying to get yourself killed non-stop as a inno, causing someone to get a rdm. If that person happens to kill someone else he gets slayed for the 2 inno = slay rule. So unless that 2 inno = slay rule gets changed around to specify that it doesn't count as your rdm if someone else calls the person out, then it is very detrimental to that persons playing. \n\nExample: Lets say 4 players total. A, B, C, and D.\n\nPlayer A calls himself out.\nPlayer B kills Player A.\nPlayer C is traitor and calls out Player D for shooting him.\nPlayer B again kills Player D from the call out.\nPlayer B kills Player C for false call out and finally gets a traitor.\nPlayer B gets slayed next round for 2 inno kills of which were not his fault. (From random call outs on other players)\n\nFrom this example, Player C is traitor so he's allowed. But because Player A wanted to just call himself out, Player B gets a extra inno kill tied to his score and gets slayed next round.\n\nSo overall i believe that the 2 inno = slay rule should be reworded to not allow someones slay from false call outs or the people who initially call out need to get punished for their own wrongdoings."},{"postId":26998,"topicId":3001,"posterId":101,"postTime":1312073928,"postText":">> \nExample: Lets say 4 players total. A, B, C, and D.\n\nPlayer A calls himself out.\nPlayer B kills Player A.\nPlayer C is traitor and calls out Player D for shooting him.\nPlayer B again kills Player D from the call out.\nPlayer B kills Player C for false call out and finally gets a traitor.\n Player B gets slayed next round for 2 inno kills of which were not his fault. (From random call outs on other players) \n An admin asks why Player B killed 2 people, and then Player B explains.\nPlayer B does not get slayed.\nThe end.  \n\nFixed."},{"postId":27017,"topicId":3001,"posterId":634,"postTime":1312082385,"postText":">> >> >> Also, just a note about self incrimination (calling yourself out).\n\nYes you are allowed to be killed on sight, BUT, and this is a major but, if you kill a traitor before you are killed yourself, ID the body. You can not be killed for self incrimination earlier. Yes you called yourself out (as a joke as people often do) but soon as you are confirmed inno from killing a T it is then blatant RDM. (blatant rdm is directly shooting someone in the face or killing after someone is confirmed (if memory suits me correctly)) \n\n>> But what if you are detective and the person was knifed in the front, can you kill the person last seen? \nThese two adjustments still need admin approval. \nStill. \nHey Dum wanna like approve or deny these for me???"},{"postId":27026,"topicId":3001,"posterId":101,"postTime":1312084710,"postText":"1. Kinda\n\n2. Yes"},{"postId":27052,"topicId":3001,"posterId":79,"postTime":1312089494,"postText":"Then maybe a notice in the rules about the 2 kill thing. Cause i know some will demand a slay because the rules specifically state 2 inno = slay. I got slayed by Gash even though i was defending myself when i killed 2 inno's. So just a update on the wordings for a few rules would be nice as well. Wording can be discussed in Kryzoids MOTD post tho."},{"postId":27091,"topicId":3001,"posterId":6,"postTime":1312127570,"postText":"I have a question, say, 5 people are alive, D is a detective, and C has been around the detective the entire time. So the detective says it's probably either A or B, C kills A, A is a traitor, but didn't do anything, is it rdm?"},{"postId":27140,"topicId":3001,"posterId":634,"postTime":1312153497,"postText":">> I have a question, say, 5 people are alive, One is a detective, and one person has been around the detective the entire time. So the detective says it's probably either A or B, B kills A, A is a traitor, but didn't do anything, is it rdm? \nI'm not an admin, but I can almost guarantee you this is a yes. If the traitor is narrowed down to 2 players then only those 2 players may attack each other."},{"postId":27155,"topicId":3001,"posterId":1,"postTime":1312157531,"postText":">> Just do what i do ;). If a admin does it, it must be allowed ;).\n\nSomething about self call out should be done though if they are inno. Cause karma/point loss does get annoying and id think it is a form of trolling. Can we get a admin or someone to make comments on this so far. \n\nJust don't be so eager to kill someone because they always do it to troll."},{"postId":27165,"topicId":3001,"posterId":115,"postTime":1312158316,"postText":"I think a summerization of each rule shut be put into the MOTD (just the rule itself, no real explanation) while a full explanation of the rule should be put somewhere on the forums."},{"postId":27168,"topicId":3001,"posterId":634,"postTime":1312158685,"postText":">> I think a summerization of each rule shut be put into the MOTD (just the rule itself, no real explanation) while a full explanation of the rule should be put somewhere on the forums. \nLike here...."},{"postId":28318,"topicId":3001,"posterId":812,"postTime":1312919038,"postText":"Okay, say someone stand in the doorway of a room and forbids you to leave. You give them three warnings to move, after three warnings you give them a warning crowbar hit. Is that acceptable?"},{"postId":28319,"topicId":3001,"posterId":101,"postTime":1312920470,"postText":">> Okay, say someone stand in the doorway of a room and forbids you to leave. You give them three warnings to move, after three warnings you give them a warning crowbar hit. Is that acceptable? \n\nJust right click them with a crowbar, you dont even need to give them warnings."},{"postId":28321,"topicId":3001,"posterId":812,"postTime":1312920712,"postText":">> >> Okay, say someone stand in the doorway of a room and forbids you to leave. You give them three warnings to move, after three warnings you give them a warning crowbar hit. Is that acceptable? \n\nJust right click them with a crowbar, you dont even need to give them warnings. \nI tried that but they just pushed me back and moved into the spot again :|"},{"postId":28334,"topicId":3001,"posterId":634,"postTime":1312930315,"postText":"After 3 warning I blow their face off. js"},{"postId":28369,"topicId":3001,"posterId":693,"postTime":1312940582,"postText":">>  Last Seen \nYou cankill based on last seen if you use a visualizer and it shows that they were killed from the front.\nOther than these you can not use Last Seen.e \n\nGotta stop you quick quick right here.\nBlood marks only appear on the body where they are hit. So logically, if their are only blood marks on the front of the body, and of course with a bit of common sense (No one's using a shotgun to snipe and no ones using a sniper rifle at close range) then I think it's fair to say that last person seen CAN be used as evidence without a visualizer, based solely on the evidence available."},{"postId":29425,"topicId":3001,"posterId":84,"postTime":1313432821,"postText":">> >>  Last Seen \nYou cankill based on last seen if you use a visualizer and it shows that they were killed from the front.\nOther than these you can not use Last Seen.e \n\nGotta stop you quick quick right here.\nBlood marks only appear on the body where they are hit. So logically, if their are only blood marks on the front of the body, and of course with a bit of common sense (No one's using a shotgun to snipe and no ones using a sniper rifle at close range) then I think it's fair to say that last person seen CAN be used as evidence without a visualizer, based solely on the evidence available. \nUngrateful, you would be surprised how often people with snipers shoot their targets in close range and snipe others(try to at least) with the shotgun. It is a lot more frequent then you think."},{"postId":29426,"topicId":3001,"posterId":79,"postTime":1313433058,"postText":"Honestly you cant go by last seen too often. I do it with a knife in the face/chest and that's about it. Anything else could be from any distance and even a visualizer DOESN'T show everyone around them when being shot. So overall you could find out that the guy was shot across the room and looking at him, but a guy could have passed his line of view and created a different last seen."},{"postId":30753,"topicId":3001,"posterId":812,"postTime":1314230078,"postText":"For live checks, I know they can only officially be said in chat, but can you respond to a live check with your mic? Or must your response also be in text also?"},{"postId":30757,"topicId":3001,"posterId":634,"postTime":1314230782,"postText":">> For live checks, I know they can only officially be said in chat, but can you respond to a live check with your mic? Or must your response also be in text also? \nTechnically you have to type it. It's not that hard though, especially if you have suit zoom bound.\n\nEDIT:  Technically you have to say that people who don't respond to live checks will be killed as well. If someone just says \"live check\" technically they can't kill you if you don't respond.\nIf they say \"Live Check Respond or Die\" or \"Live Check RoD\" then they can kill you however.\n\nEDIT: EDIT: Also make sure you wait 30 seconds, too often I see people killing after 10 or 15 seconds. There's a timer built into the game, use it."},{"postId":30758,"topicId":3001,"posterId":812,"postTime":1314230962,"postText":"Ok thank you."},{"postId":31419,"topicId":3001,"posterId":1058,"postTime":1314699791,"postText":"Something that came up in a game: Preserving your cover as a Traitor.\n\nWhat happened was, on that map with the lighthouse, it was me and another traitor in the basement. He killed a man, down there, as I came down after him. I could hear them getting more suspicious over the radio, and they had both of us correct, so far. A radar contact was closing in. \n\nI told my fellow traitor that one of us had to die, and then I shot him.  Subsequently identifying his body exonerated me, in the eyes of the innocents, allowing me to continue to kill them, winning the round for the traitors.\n\nMy question is, when the heat is on, and the choices you have are to blow your cover or kill a friend, is that something you would do?\n\nIn character, I would. Nothing seals loyalty like the death of a common enemy. \n\nI didn't have time then to get a full ruling on it. What's the verdict on this?\n\nIt's not \"Random\" killing, per se, but it's not killing an innocent, either."},{"postId":31425,"topicId":3001,"posterId":605,"postTime":1314705745,"postText":"Tanshin, if he said its ok to kill him, then its perfectly fine, since he allowed you to hide your identity. \nIf you told him one of you two had to die, and shot him without hearing his opinion, you wrongfully made his choice for him. In that case, he would have felt you randomly killed him, even if you did explain your reasoning. But of course, after the round ended, if your T buddy said then that they did not mind you killed them, it's usualy ignored.\nIn other words, unless you know for 100% sure they wont mind, get their permission first."},{"postId":31475,"topicId":3001,"posterId":1058,"postTime":1314751510,"postText":"@Udane: I understand that bit. Thanks for clarifying.\n\nBut I'd like to note that realistically (In character for a traitor), if you've already betrayed your cause, betraying your friend is but a little push away."},{"postId":31480,"topicId":3001,"posterId":249,"postTime":1314756261,"postText":"Here's a different thing for you guys to discuss... So everyone in the game is proven, but two people that are left over are not... can we tell them that one of them is innocent and that they have to kill each other for the round not to be prolonged? just a thought."},{"postId":31483,"topicId":3001,"posterId":605,"postTime":1314756638,"postText":">> But I'd like to note that realistically (In character for a traitor), if you've already betrayed your cause, betraying your friend is but a little push away. \nYou are betraying terrorists, basically, you are against \"evil\"... I doubt any organization who works against terrorists would (normally) be advising you to kill your buddy.\n\n>> Here's a different thing for you guys to discuss... So everyone in the game is proven, but two people that are left over are not... can we tell them that one of them is innocent and that they have to kill each other for the round not to be prolonged? just a thought. \nif everyone but two people are proven by T tester, and that T tester cant be fooled, those two people should already be fighting, as one of them is a T XD"},{"postId":31489,"topicId":3001,"posterId":249,"postTime":1314758383,"postText":"But what if they aren't proven by a tester, and only proven by being seen doing something that makes them innocent... (killing traitor, saving innocents from certain death, being shot by a traitor or nearly blown up)"},{"postId":31563,"topicId":3001,"posterId":956,"postTime":1314825803,"postText":"We definately need to get Traitor baiting in the motd i see it happen all the time when im in game."},{"postId":31564,"topicId":3001,"posterId":634,"postTime":1314826170,"postText":">> We definately need to get Traitor baiting in the motd i see it happen all the time when im in game. \nTraitor baiting is in the current set of rules, the MOTD needs to be updated though so we need to find someone who can use photoshop and make a good one."},{"postId":31583,"topicId":3001,"posterId":79,"postTime":1314830217,"postText":"I vote Kryzoid, he's got nothing better to do ;)"},{"postId":31613,"topicId":3001,"posterId":4,"postTime":1314835472,"postText":">> I  don't  vote Kryzoid, he's got  tons of other things to do and sucks at photoshop.  \n*Ahem*"},{"postId":31616,"topicId":3001,"posterId":634,"postTime":1314836781,"postText":"I say we get Hardstar to do it. Wherever he is..."},{"postId":31618,"topicId":3001,"posterId":605,"postTime":1314838823,"postText":">> But what if they aren't proven by a tester, and only proven by being seen doing something that makes them innocent... (killing traitor, saving innocents from certain death, being shot by a traitor or nearly blown up) \n99/100 times, the first 2 are a good reason to be proven.... the later one occurs from idiots all the time... just the other day, a dude almost accidently killed me with a jihad, i survived with 8 hp till a dude thought it would be funny to shoot me. (it was an accident i hold no grudge against this dude)\nrarely you'd run into a situation where a T requests another T to finish them off, but its so rare, its usualy ignored."},{"postId":32091,"topicId":3001,"posterId":812,"postTime":1315164336,"postText":"Okay me and Treecko are debating about this situation.\n\nOkay Treecko knifed Human Aimbot, who was a Traitor. He told us that he knifed a traitor, and then I asked him how he got the knife. He didn't respond so I kept asking him, and after a while of him ignoring the question I assumed he bought the knife and knifed his traitor buddy. So then we all agreed that we should kill Treecko.\n\nTreecko said that us killing him was killing on suspicion and against the rules. While that is true, the only option that he gave us was that he DID buy the knife because he didn't explain the situation.\n\nWho's right/wrong?"},{"postId":32095,"topicId":3001,"posterId":634,"postTime":1315166194,"postText":">> Okay me and Treecko are debating about this situation.\n\nOkay Treecko knifed Human Aimbot, who was a Traitor. He told us that he knifed a traitor, and then I asked him how he got the knife. He didn't respond so I kept asking him, and after a while of him ignoring the question I assumed he bought the knife and knifed his traitor buddy. So then we all agreed that we should kill Treecko.\n\nTreecko said that us killing him was killing on suspicion and against the rules. While that is true, the only option that he gave us was that he DID buy the knife because he didn't explain the situation.\n\nWho's right/wrong? \nTechnically if they are 100% proven to have killed a traitor then it does not matter where they got it.\nThe only times you should really be attacking people that are proven innocent is if you are a traitor or they are shooting at you.\nAlthough I don't see why he wouldn't just say where he got the knife."},{"postId":32311,"topicId":3001,"posterId":812,"postTime":1315272298,"postText":"Thank you for the response Destar, but could an admin please give their opinion on the situtation?"}]}