{"topicId":4778,"forumId":14,"topicTitle":"Dr. Corey W. Rogerson","topicTime":1320391014,"topicViews":128,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"CoreyW.Rogerson","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1320455028,"posts":[{"postId":37079,"topicId":4778,"posterId":612,"postTime":1320391014,"postText":"1) Which server: TTT\n2) Your in-game name: Dr. Corey W. Rogerson\n3) Your SteamID:STEAM_0:0:24225449\n4) When were you banned and for how long:Friday 11/4/2011 2:30 am\n5) Reason for ban: recent case of trolling, exploiting map\n6) Who banned you:[ITLOI]Udane\n7) Why should we unban you or shorten your ban period:\n\nMany reasons\n\n1. Ill go over the \"Trolling\" he is talking about. there are two cases in which he is referring to.\n     (A)I didn't ID a traitors corpse as a detective so that i could calculate who the last traitor would be before the last traitor realised that it could be done, there fore having an advantage, Udane PMed me on steam saying \"Id it, or else trolling~\" i said \"no, i dont have to, its strategy\" he then persisted that he could ban me for it because it was blatant rule breaking or whatever he said it was. i then ID''ed the body for his confort and asked gash after the round. Gash said that its withholding info from the innocent team and that i have to id it. which is fine, point being that i DID ID it afterward.\n\n    (B)The map was on Rp_epic_city and i had 3 innos trapped in the elevator room where if it goes down they cannot get out. shame less had gone up the ladder which left me in an empty room with 3 easy C4 kills. i planted a c4 and about 5 seconds after i walk up the ladder, blocking shameless from going down the ladder finding my c4. one inno that was trapped said over voice chat \"I think i hear c4\" and shameless shot me, waked down the ladder, looked around for a C4 the typed \"..\" \"theres no C4\" (i had hidden it on the back side of the button so he wouldnt see it if he went down and check for bodies later or something, you know, just hiding it a bit better) then he press the up button and then sent it back down THEN realized where my C4 was planted. i told udane what happened ( he was actually in the room trapped, he didnt hear the C4either ) he then said well there WAS a c4 and yo were the only one who'd planted it. But here the thing, shameless had no proof that there was even a C4 to begin with. Just what the other guy said to him, he shot me immediately after hear the words \"i think i hear a C4\" Udane didnt punish him because in his mind it was not RDM.\n\nthe next round i was a bit perturbed about being RDMed still. Udane explained it one more time then i said \" OH I THINK I HEAR C4\" and udane got angry about this.\nshortly after, a guy barely RDMed a guy and udane slayed him. i made the remark \"He will slay for an accident but not blatant RDM\" he heard that too. after ward another guy RDMed me again and udane didnt punish him, so i said something like \"We have a weird punishment system tonight\" and udane steam messaged me for a good 30 minutes raging ( and i mean RAGE, cuss words, the whole nine.)about how he was busy with some other things, so i said tell gash you cantt handle the work load and to promote more mods. and we went back and fourth. he made a remark some where in this wwhole thing about \" ill just add it to the reason that i ban you later\" which has, clearly, happened. Which i dont see as a correct stand on this whole thing, i mean conspiracy to ban is a conflict of interest, at least in my opinion. but he was angry with me for making a point. and has been since yester day.\n\n\nnow, let me move forward to the map exploit. we were on the map that has the side objective with the gas cans and zombie. and theres a bost sitting in the corner of the map that ive gone to a few times WITH UDANE online, he said it was fine, aslong as i stayed on the front side. so i went there again tonight and sat there the whole round (AS INNO) while fudge was playing on a roof i was easily attackable, even more so with me 21 hp from falling in the water for a breif second. Shameless i guess died first and took  screens of me on the boat when i was behind it while hiding from Mallow, who was a traitor. which all combine was about a minute out of the ten minutes that the round took up. it is easy to shoot some one from that distance even with a mac 10, i know this because i shot at Mallow twice and hit him. i wasnt in an area that was out of the map, unaccessable due to hands or gravity, or glitched where i was invulnerable. i was on a boat that was far away from the land. easily attackable aswell as seen. shameless and i have had our history and he doesnt care for me, which is probably a big factor as to why he showed them to udane in the first place. that combined with udane anger with me about \"trolling\" got me banned for little to no rule breaking. Udane has defined exploiting as \"Going to a place where you arent shootable and can be accessed wih out the need for hands or gravity upgrades\" and i used none of those. Udane and shameless are friends who fdont like me. I wont call abus on this, but i will call bullshit. plus the \"trolling\" he references happened a day ago, and it was mostly between me and him and had little to do with the server. in addition to that he premeditated his ban, he said \"Itll just add to why ill have to ban you later\"\n\n i talked it over with him in steam chat. heres the logs.\n\n\n2:25 AM - [ITLOI]Udane: due to evidence of map exploitation and recent actions, you have been banned for 3 days effective on map rotation\n2:25 AM - Dr. Corey W. Rogerson: nope\n2:25 AM - Dr. Corey W. Rogerson: what map exploitation\n2:26 AM - [ITLOI]Udane: on a far off ship, behind view\n2:26 AM - Dr. Corey W. Rogerson: still shootable\n2:26 AM - [ITLOI]Udane: not from the screenshots standpoint\n2:26 AM - Dr. Corey W. Rogerson: shameless? you new friend\n2:26 AM - Dr. Corey W. Rogerson: i was ducking behind the hull\n2:26 AM - Dr. Corey W. Rogerson: im still easily attackable\n2:27 AM - [ITLOI]Udane: easily? from that range? it would be a strugle with a sniper\n2:27 AM - [ITLOI]Udane: not to mention the hiding behind the rook\n2:27 AM - [ITLOI]Udane: while on said boat\n2:27 AM - Dr. Corey W. Rogerson: rock?\n2:27 AM - Dr. Corey W. Rogerson: tor is there a think called a rook\n2:27 AM - Dr. Corey W. Rogerson: lemme see the proof btw\n2:27 AM - [ITLOI]Udane: meh, why not\n2:28 AM - [ITLOI]Udane: http://steamcommunity.com/profiles/76561198047745453/screenshot/594701250417231810\n2:28 AM - [ITLOI]Udane: http://steamcommunity.com/profiles/76561198047745453/screenshot/594701250417218659/?\n2:28 AM - Dr. Corey W. Rogerson: [shameless] has no screenshots available for your viewing.\n2:28 AM - [ITLOI]Udane: lawl\n2:28 AM - Dr. Corey W. Rogerson: re upload them\n2:28 AM - Dr. Corey W. Rogerson: or dont ban me\n2:28 AM - Dr. Corey W. Rogerson: but im not gonna get off on some technicality\n2:28 AM - [ITLOI]Udane: now you are attempting to decide your own ban?\n2:28 AM - Dr. Corey W. Rogerson: no\n2:28 AM - Dr. Corey W. Rogerson: but in my standpoint there is no proof\n2:28 AM - Dr. Corey W. Rogerson: so\n2:28 AM - [ITLOI]Udane: you dont need the proof\n2:28 AM - Dr. Corey W. Rogerson: reupload them so i can see\n2:29 AM - Dr. Corey W. Rogerson: i can request proof of my own ban\n2:29 AM - [ITLOI]Udane: i can request all you want, if i have hard evidence that you in fact broke a rule, its obvious you broke a rule\n2:29 AM - [ITLOI]Udane: heh, i can, you can\n2:29 AM - Dr. Corey W. Rogerson: A rule\n2:29 AM - Dr. Corey W. Rogerson: t1\n2:30 AM - [ITLOI]Udane: t1?\n2:30 AM - Dr. Corey W. Rogerson: 1\n2:30 AM - Dr. Corey W. Rogerson: rule\n2:30 AM - Dr. Corey W. Rogerson: yeah\n2:30 AM - Dr. Corey W. Rogerson: i have proof id like to submit to you for shameless after i talk to you about this\n2:31 AM - Dr. Corey W. Rogerson: if anything go and slayhim now\n2:31 AM - Dr. Corey W. Rogerson: not now\n2:31 AM - Dr. Corey W. Rogerson: but after i submit evidence\n2:31 AM - [ITLOI]Udane: lawl\n2:31 AM - Dr. Corey W. Rogerson: lawl?\n2:31 AM - Dr. Corey W. Rogerson: i was gonna make a request when i got off\n2:31 AM - [ITLOI]Udane: you two, i swear, are always at each other\n2:31 AM - Dr. Corey W. Rogerson: not really\n2:31 AM - Dr. Corey W. Rogerson: he prop kills with the magneeto alot and i told him not to\n2:31 AM - Dr. Corey W. Rogerson: and he says its not against the rules\n2:31 AM - Dr. Corey W. Rogerson: but other than that\n2:31 AM - Dr. Corey W. Rogerson: nothing\n2:32 AM - Dr. Corey W. Rogerson: and i will be posting an unban request\n2:32 AM - Dr. Corey W. Rogerson: dont lock it after your first post\n2:32 AM - Dr. Corey W. Rogerson: but that location is easily attackable\n2:33 AM - Dr. Corey W. Rogerson: i can hide behind rocks all i want\n2:33 AM - [ITLOI]Udane: fyi, i only locked that one post right after it, because i knew for a fact they only wanted to cause trouble\n2:33 AM - Dr. Corey W. Rogerson: no\n2:33 AM - Dr. Corey W. Rogerson: im talking about mine\n2:33 AM - [ITLOI]Udane: yes, and you assume i would lock it instantly\n2:34 AM - [ITLOI]Udane: which im refering to the fact its rare for me to do so\n2:34 AM - Dr. Corey W. Rogerson: yeah, because you banned me on a bullshit reason\n2:34 AM - Dr. Corey W. Rogerson: and unjustly\n2:34 AM - Dr. Corey W. Rogerson: i could be shot\n2:34 AM - Dr. Corey W. Rogerson: theres a T sniper for a reason\n2:34 AM - Dr. Corey W. Rogerson: and a rocket jump\n2:34 AM - Dr. Corey W. Rogerson: i was far away,  not outside\n2:34 AM - [ITLOI]Udane: by that logic, i could door block, theres a c4 for a reason\n2:35 AM - Dr. Corey W. Rogerson: if i give you three warnings you have to move\n2:35 AM - Dr. Corey W. Rogerson: theres a rule for that reason\n2:35 AM - [ITLOI]Udane: by door block, i meant glitch, my bad\n2:35 AM - [ITLOI]Udane: like force the door stuck perma\n2:35 AM - Dr. Corey W. Rogerson: and how do you preform a dor glitch\n2:35 AM - Dr. Corey W. Rogerson: ok\n2:35 AM - Dr. Corey W. Rogerson: thats a slayable offence\n2:35 AM - Dr. Corey W. Rogerson: youve slayed me once for it\n2:36 AM - [ITLOI]Udane: my point is, no matter how much you try to justify your actions about what can counter it, if you break a rule, its broken\n2:36 AM - Dr. Corey W. Rogerson: i didnt break a rule\n2:37 AM - Dr. Corey W. Rogerson: theres no rule against going to a far away place that is still within the regions of the map\n2:37 AM - Dr. Corey W. Rogerson: none\n2:37 AM - Dr. Corey W. Rogerson: i was attack able\n2:37 AM - Dr. Corey W. Rogerson: and that the end\n2:37 AM - [ITLOI]Udane: humorously, remember when you first asked if you could take a prop and swim over there, and i said an i qoute \"fine... um... like, just stay on the side closer to us, so you can be seen\"\n2:38 AM - Dr. Corey W. Rogerson: and\n2:38 AM - Dr. Corey W. Rogerson: i was\n2:38 AM - Dr. Corey W. Rogerson: until they started using a RADAR to see me\n2:38 AM - Dr. Corey W. Rogerson: so i moved so i dont get shot\n2:38 AM - Dr. Corey W. Rogerson: i can hide behind anything i want to\n2:38 AM - Dr. Corey W. Rogerson: columns doors walls corners\n2:38 AM - [ITLOI]Udane: you were on the other side of the boat, the side not closer to us... i dont care what reason you use, you went to the area outside... that would be like being on a roof that you could back up into an area where no one can shoot you\n2:39 AM - Dr. Corey W. Rogerson: rocket jumps are in the game for a reason\n2:39 AM - Dr. Corey W. Rogerson: i can hide ALL round if i so please\n2:40 AM - Dr. Corey W. Rogerson: fact is\n2:40 AM - Dr. Corey W. Rogerson: you are mad at me\n2:40 AM - Dr. Corey W. Rogerson: and you found VERY little reason to ban me and you took it to and extreme\n2:41 AM - [ITLOI]Udane: and you wonder why i decided i wouldnt vote for you in terms of mod selection XD\n2:41 AM - [ITLOI]Udane: you try to go for any loop hole, to do what you want to do\n2:42 AM - Dr. Corey W. Rogerson: no you told me why\n2:42 AM - [ITLOI]Udane: the reasons just pile up\n2:42 AM - Dr. Corey W. Rogerson: because i thought that not iding a body was fine\n2:42 AM - Dr. Corey W. Rogerson: you arent going to bullshit me udane\n2:42 AM - Dr. Corey W. Rogerson: soory, but  this has gone too far\n2:42 AM - [ITLOI]Udane: feel free to take whatever actions you believe are correct\n2:42 AM - [ITLOI]Udane: the fact is, im the one who is right\n2:43 AM - Dr. Corey W. Rogerson: i wish we all did that\n2:43 AM - Dr. Corey W. Rogerson: hows that\n2:43 AM - Dr. Corey W. Rogerson: \"as long as you can be shot, its fiine\"\n2:43 AM - Dr. Corey W. Rogerson: youve said it yourself\n2:43 AM - Dr. Corey W. Rogerson: i couldve been shot easily\n2:43 AM - Dr. Corey W. Rogerson: not to mention i had 21 hp\n2:43 AM - [ITLOI]Udane: post an unban, and you'll see how right i am\n2:43 AM - Dr. Corey W. Rogerson: one bullet from anything excluding a mac ten\n2:44 AM - [ITLOI]Udane: i will only post the evidence given to me by shameless, as its the only outside source\n2:44 AM - Dr. Corey W. Rogerson: youll post it there but not give it to me\n2:44 AM - Dr. Corey W. Rogerson: cool.\n2:45 AM - [ITLOI]Udane: i never said i wouldnt, i said i didnt have to\n2:46 AM - Dr. Corey W. Rogerson: then do it\n2:46 AM - Dr. Corey W. Rogerson: prove to me that you \"would\"\n2:46 AM - [ITLOI]Udane: i never said i would either~\n2:56 AM - Dr. Corey W. Rogerson: i never said i wouldn\n2:57 AM - [ITLOI]Udane: that is correct, i never said i wouldnt, but i never said i would\n2:57 AM - [ITLOI]Udane: i only said that i didnt have to\n2:57 AM - Dr. Corey W. Rogerson: why be like that\n2:58 AM - Dr. Corey W. Rogerson: you are a corrupt machine\n2:58 AM - [ITLOI]Udane: i turn offensive when i feel like i was attacked\n2:58 AM - [ITLOI]Udane: but if i was curropt, youd be permad\n2:59 AM - [ITLOI]Udane: but no, i liked you, i enjoyed your company, and then when shit starts flying, you attack me\n3:13 AM - Dr. Corey W. Rogerson: no i never attacked you\n3:13 AM - Dr. Corey W. Rogerson: never\n3:13 AM - Dr. Corey W. Rogerson: i pointed out certain flaws\n3:14 AM - Dr. Corey W. Rogerson: and you didnt like that\n3:14 AM - Dr. Corey W. Rogerson: you are angry with me and friends with shameless\n3:14 AM - Dr. Corey W. Rogerson: you cant make moderation a popularity contest.\n\nREQUESTED: asked to include what transpired after i made the post\n\n3:15 AM - Dr. Corey W. Rogerson: http://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=14&t=4778\n3:15 AM - Dr. Corey W. Rogerson: heres the link\n3:15 AM - [ITLOI]Udane: comments like \"you are curropt\" \"you are a horrible admin\" and such as thus... by directing them to me as in stating them as fact is attempting to push your own beliefs into me, as in, making your will mine, as thus attacking... it would have been cleaner and easier to say you believed i was... but no... every decision i made was based on evidence i was given... i couldnt care less who likes me, otherwise, id be doing my best to make you believe im a good person, instead of argueing with you\n3:16 AM - Dr. Corey W. Rogerson: truth is not an insult, unless you conceive it that way\n3:16 AM - [ITLOI]Udane: because you believe it is the truth, does not make it the truth\n3:16 AM - Dr. Corey W. Rogerson: my opinion was not an attack\n3:17 AM - Dr. Corey W. Rogerson: a bad admin doesnt let blatant rdm pass because you like you friend \"sham less\"\n3:17 AM - [ITLOI]Udane: on a side note, personal conversations in steam doesnt directly affect a ban, bringing it up in the unban means i might as well add harrasment to the ban length...\n3:18 AM - Dr. Corey W. Rogerson: it did thought\n3:18 AM - Dr. Corey W. Rogerson: though*\n3:18 AM - Dr. Corey W. Rogerson: when did i harrass you?\n3:19 AM - [ITLOI]Udane: you really believe you are doing the right thing?\n3:19 AM - Dr. Corey W. Rogerson: i am\n3:19 AM - Dr. Corey W. Rogerson: i shouldnt even be faced with a decision right now\n3:19 AM - Dr. Corey W. Rogerson: i wasnt exploiting and should not be banned.\n3:20 AM - Dr. Corey W. Rogerson: never once used hands or low grav to my advantage\n3:20 AM - Dr. Corey W. Rogerson: but everything you need to know is in that request\n3:20 AM - Dr. Corey W. Rogerson: im finished talking about it\n3:20 AM - [ITLOI]Udane: no, you jump on a prop and floated to an area outside normal play area, then after being shot, hid behind said area so you were in a position where you couldnt be shot anymore\n3:20 AM - Dr. Corey W. Rogerson: you said that was ok\n3:21 AM - [ITLOI]Udane: to be on the front side, where you could be seen\n3:21 AM - Dr. Corey W. Rogerson: i never got shot at\n3:21 AM - [ITLOI]Udane: you told me earlier that you did\n3:21 AM - Dr. Corey W. Rogerson: no i did not\n3:22 AM - [ITLOI]Udane: welp, im going to have to reread a lot to find where it was either insinuated as the case, or otherwise noted\n3:22 AM - Dr. Corey W. Rogerson: only thing ive noted was \"i could be shot \"\n3:22 AM - Dr. Corey W. Rogerson: \" i was clearly attackable\"\n3:23 AM - [ITLOI]Udane: 1:40 AM - Dr. Corey W. Rogerson: until they started using a RADAR to see me\n1:40 AM - Dr. Corey W. Rogerson: so i moved so i dont get shot\n1:40 AM - Dr. Corey W. Rogerson: i can hide behind anything i want to  ------------------------- This part, the time is an hour off because udane lives in a \n3:23 AM - [ITLOI]Udane: thats the part  --------------------------------------------------------- Different timezone. \n3:23 AM - Dr. Corey W. Rogerson: i never got shot at\n3:23 AM - Dr. Corey W. Rogerson: i preemptively moved behind before they shot at me\n3:23 AM - [ITLOI]Udane: because you knew they had a radar?\n3:23 AM - Dr. Corey W. Rogerson: one bullet wouldv''e kiled me\n3:23 AM - Dr. Corey W. Rogerson: he said he had radar\n3:23 AM - Dr. Corey W. Rogerson: \" how did you get over there to that boat\"\n3:24 AM - Dr. Corey W. Rogerson: \"what boat, im not on a boat\"\n3:24 AM - [ITLOI]Udane: point still derives from the fact you were in a location where you could not be shot\n3:24 AM - Dr. Corey W. Rogerson: \"i see you, i have radar\"\n3:24 AM - Dr. Corey W. Rogerson: if i close a door while running  away from you\n3:24 AM - Dr. Corey W. Rogerson: i cant be shot\n3:24 AM - Dr. Corey W. Rogerson: until you open the door\n3:24 AM - Dr. Corey W. Rogerson: you are trying to twist what im saying\n3:24 AM - [ITLOI]Udane sighs\n3:25 AM - Dr. Corey W. Rogerson: sighs?\n3:25 AM - [ITLOI]Udane: you are pointless to talk to, i'll just post the screens\n3:25 AM - Dr. Corey W. Rogerson: do it\n3:25 AM - Dr. Corey W. Rogerson: i have been wanting them this whole time\n3:25 AM - [ITLOI]Udane: after i edit your request to either include your choice of no steam chat, or the rest of it\n3:25 AM - Dr. Corey W. Rogerson: dont touch my request.\n3:25 AM - [ITLOI]Udane: so you wish to hide the other half of the steam chat?\n3:26 AM - Dr. Corey W. Rogerson: copy pasted the whole thing.\n3:26 AM - [ITLOI]Udane: you ended in a location in attempts to cause my image to falter\n3:26 AM - Dr. Corey W. Rogerson: when you said i was gonna be banned.\n3:26 AM - Dr. Corey W. Rogerson: thats where it ended when i posted.\n3:26 AM - Dr. Corey W. Rogerson: ill add more\n3:26 AM - Dr. Corey W. Rogerson: you dont touch it"},{"postId":37082,"topicId":4778,"posterId":605,"postTime":1320395134,"postText":"I dont care if i seem like an ass, so i'll skip the technical word play used in this post.\nI only feel the need to make these notes on subject B;\nI didn't punish shameless because I was torn on how to rule for this, and asked gash, who then after talking with, helped me decide it was clean.\nCorey after hearing this tried to exploit it as his own means by yelling he could hear a c4, while fudge then yells out that he could now rdm anymore nearby. Of course this would agitate me.\nI did get pissed that corey kept whining about everything not working his way, and did blow up on him in steam... of course, your constant trolling remarks in the steam chat didnt help that much (not that it had any bearing on this ban, as steam chat is a private affair... which you also decided to make public.)\n\nAlso, according to your logic, i'm allowed to rdm you everyday once a day, and get away with only a slay, as previous days has nothing to do with future punishments.\nThe \"ill just add it to the reason that i ban you later\" was because I knew you would end up doing something that got you banned, based on how you were acting.\n\nAnd lastly, due to what I hear is players unable to see his screenshots, (and after failing to get it converted or anything, so I screenshotted his screenshots) here they are. http://steamcommunity.com/id/Udane/screenshot/631855947346207430/? ; http://steamcommunity.com/id/Udane/screenshot/631855947346211038/?"},{"postId":37089,"topicId":4778,"posterId":612,"postTime":1320430645,"postText":"you need to seriously rethink your definition of trolling, we had an arguement in steam chat.\n ill give you a few examples of trolling:\n  http://www.helpfeedthetroll.com/wp-content/uploads/2011/10/Sexism_On_Facebook.jpg  \n  http://i.imgur.com/kUFYw.jpg  \n\nMe stating that i think you are a bad moderator is not. Even when you raged at me in steam chat wasn't trolling. The only trolling i did here was say \"OH GOD I THINK I HEAR C4\". thats all. I could easily be seen and shot from the boat, i didnt use hands or low grav, i didnt glitch my way there, therefore not map exploiting. you were angry with me and you found what you could to ban me then added on some other small things that some how add up to threee days. this has gone far enough, its unfair."},{"postId":37102,"topicId":4778,"posterId":605,"postTime":1320443688,"postText":"Trolling, usualy defined as: Stating anything with the intent to cause a negative reaction, usualy for your own satisfaction/motivations.\nOther then this, I've already argued my side of the point, and the only reason I am not locking this is because I'm standing under accusations of a false ban, and as thus, letting another admin/gash reply.\nAfter argueing with you for 2 hours straight, I don't feel like it anymore."},{"postId":37120,"topicId":4778,"posterId":2,"postTime":1320455028,"postText":"I don't disagree with Udane's reason for banning, and it also seems as if you got off a bit lucky with it only being for 3 days. Map exploiting bans can range from one day to one week, and with you knowing beforehand that you weren't supposed to go on that side of the boat, the ban could have been for longer with trolling being a factor in the reasoning. I'd appreciate it if you could settle this little grudge with [shameless], as you both are contributing to it. At this point it appears you're both just waiting for the other to slip up and get evidence of it.\n\nDenied."}]}