{"topicId":1427,"forumId":36,"topicTitle":"Kobooold for Moderator","topicTime":1293500627,"topicViews":250,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"Kobooold","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1293632034,"posts":[{"postId":12802,"topicId":1427,"posterId":272,"postTime":1293500627,"postText":"1) What position are you applying for?  Moderator (TTT)\n2) How old are you? (if you prefer to say this in private, just ask): REDACTED\n\n3) Where do you live? (Country, time zone): Houston, Texas, USA. Central time zone.\n4) Current In-Game Name: [NNJG] Kobooold\n5) Steam ID & Link to your Steam Community page:  STEAM_0:0:18938817    http://steamcommunity.com/id/Idedu\n6) Email Address: REDACTED@REDACTED\n7) How long have you been involved (frequent player, moderator, donator, admin) with [NNJG] or Shadow's TTT/Flood/Jail/ server: I have been playing TTT since September, I donated a few weeks after beginning to play. I played Perp while it was up the first time, but I do not play other NNJG servers frequently.\n8) What you can bring to the [NNJG] Team (Web/Graphic Design, Lua/other Coder, Moderation, Map Maker, ect.) Moderation.\n9) Why do you want to be part of the [NNJG]Team? I enjoy the community of this clan, and I want to be a bigger part of it.\n10 ) Any GMOD/TF2/CSS experience: No admin experience, but I have been playing Gmod for years.\n11) Have you ever owned a GMOD/TF2/CSS server? No\n12) Do you have a microphone? Do you frequently use it? Yes/yes\n13) Any other Comments or information you can provide: :3\n\n14) In this field, please provide 1 or several screenshots of 10 recommendations from active or frequent players from our servers or forums recommending you for this position, via Steam chat or Server chat.\n? Recommendations can be a sentence to a paragraph from the active or frequent player showing an in-context & clear recommendation.\n\n http://www.picdrop.net/uploads//reccomendations.PNG "},{"postId":12804,"topicId":1427,"posterId":54,"postTime":1293501986,"postText":"I for one, recommend you. I think you would make a great mod.\n\n +support. \n\n\nEdit: I think I still have 2 recommendations left that I can use if I'm not mistaken."},{"postId":12822,"topicId":1427,"posterId":4,"postTime":1293512925,"postText":"1. Thank you for correctly using the template and for having the required post count.\n2. Even though you don't live in a timezone that would be beneficial to us since we currently require moderation at our \"nighttime,\" i recommended you because i have played with you before, you're a nice person who abides by the rules, while still being friendly to the players and the staff.\n\n   +Support   \n\n3. Good luck :)\n\n>> I think I still have 2 recommendations left that I can use if I'm not mistaken. \nI think that system died, we have all passed it."},{"postId":12844,"topicId":1427,"posterId":55,"postTime":1293545366,"postText":"I also recommend you\n\n +support "},{"postId":12863,"topicId":1427,"posterId":101,"postTime":1293572818,"postText":"I support you, but I don't recommend you (I only have 1 recommendation left, and you are loaded on recommendations.)"},{"postId":12875,"topicId":1427,"posterId":4,"postTime":1293576941,"postText":">> I support you, but I don't recommend you (I only have 1 recommendation left, and you are loaded on recommendations.) \nthat system didn't make sense and died.."},{"postId":12906,"topicId":1427,"posterId":377,"postTime":1293604662,"postText":" I support, Good Luck Buddy "},{"postId":12922,"topicId":1427,"posterId":153,"postTime":1293632034,"postText":"Approved as  GLOBAL  moderator.\nLocked.\ninb4 someone complains about me not replying."}]}