{"topicId":1945,"forumId":19,"topicTitle":"Official Ban Request Template [READ BEFORE REPORTING]","topicTime":1298080586,"topicViews":621,"topicReplies":0,"topicStatus":1,"topicFirstPosterName":"Pharaoh","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1298080586,"posts":[{"postId":16135,"topicId":1945,"posterId":112,"postTime":1298080586,"postText":"Offender name?:  The steam name of the offender at the time he broke the rule. For Goldcraft, it's the Minecraft ID. \nWhich Server?:  Choose from here . \nOffender's Steam ID?:  This can be found by typing \"status\" in console. Should look something like STEAM_0:1:25397734. Not needed for Goldcraft requests. \nWhat the Offender did?:  What rule did he/she break? \nProof?: Proof of them breaking the rule. Self explanatory. Don't know what is considered proof? Keep reading. \nKEEP READING.\n\n Offender name?: \nWhich Server?: \nOffender's Steam ID?: \nWhat the Offender did?: \nAdmins on?: \nProof?:\n \n\n  What is considered proof?  \n\n Things that  ARE  considered proof: \n-Screenshot:  A picture of the rulebreaker in action. (Damage logs/Score sheet in ttt, Picture of the person breaking a rule in Goldcraft) \n-Video:  A video of the rulebreaker in action. Don't know how to take a video? Keep reading. \n1 Download a screenrecorder software and have it in the backround while you play so you are ready to record at any time. (Easy way, but slower to have it running all the time)\n2 Go into console and type \"record <demoname>\" to start recording a demo. Type \"stop\" to end it. (Easy too, but the video files are alot of space)\n\n Things that  ARE NOT  considered proof. \n- Witnesses:You may trust them, but we don't. \n- Copied logs from console: You can change it too easily. \n- Copied chat from ingame: Same as above \n- Chat from steamchat: Too easy to fake. \n\n\n  But wait, where can I post my proof?  \nScreenshots: Photobucket , Tinypic , Flickr , ImageShack , Minus .\nVideos:Youtube , Xfire .  It is prefered that you don't upload videos to a file sharing website, so we don't have to download them, but if its all you have access to then go ahead. \n\n  RULES FOR BAN REQUESTS:  \n-Don't bump the thread. We will get to it when we get a chance.\n-If you have more proof that you want to add onto your first post then just make a reply to the thread with it included.\n-Do not post saying \"He is a good player\" If the proof is sufficient, the person will get banned, if not then he won't. Your input does not effect it.\n-Do not lie in a ban request.\n- DO NOT POST FAKED PROOF. If you are caught attempting to get somebody banned with fake proof you will be permanently banned from all of our servers with no chance of redemption. Ex:Photoshop/Framing. "}]}