{"topicId":1794,"forumId":122,"topicTitle":"[Ban Request] Swaim","topicTime":1296454156,"topicViews":283,"topicReplies":15,"topicStatus":1,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1296475404,"posts":[{"postId":15174,"topicId":1794,"posterId":54,"postTime":1296454156,"postText":"I saw he was unbanned, which he should NOT be unbanned. I'm pretty sure for one he did the killer bee shit, but he DID start a fire and admitted it to me!\n\nI can get screenshots if you want, but here is just the code of the message. He admitted to the fire, therefore he should NOT be unbanned.\n\n I'm assuming you have seen evidence? Also I'm not sure of your motives, all your doing is getting mad and cursing, I'm not quite sure why you're a moderator if all you can do is become emotionally compromised. you have not seen evidence because there was none submitted, further more I have read the rules on the server, it doesn't say you cannot burn down trees. The fact that anyone could be remotely angry is beyond me. Have you even played minecraft, you can walk 10 yards out and what do you know, more trees.\n\nI wanted to PM you because you locked the thread and I didn't want open it up just to argue my point.\nLastly. why do you act so childish when it comes to expressing your point, just talk to me like a normal human being and stop trying to antagonize.  First message.\n\n You keep on saying I burned down trees, yet you still refuse to show any evidence. Some guy told me you're a flaming homo sexual, does that mean you are just because he says so, no. Please show evidence of my crimes before accusing me. Also, the server I've been an admin on [Not just the server I play on, others too] have nothing against forest fire. Also apparently no body actually knows the definition of griefing, it's not griefing if it's not owned. I have been playing the game for 1 year and six months, not one server had a problem with forest fire, again I still don't know why anyone could be remotely pissed.  2nd message\n\n I just now face palmed so hard at what you said, now I know you're an underage child who gets mad at people who disagree.\n\nhttp://en.wikipedia.org/wiki/Minecraft\n\nI admit to it, and how so, by saying it's not that bad of a crime. Yep with that infallible logic, I guess you found your culprit.  Here is where he says HE did it."},{"postId":15176,"topicId":1794,"posterId":262,"postTime":1296454758,"postText":"I think he IS killer bee"},{"postId":15180,"topicId":1794,"posterId":366,"postTime":1296456149,"postText":"neato, I'm killer bee, lol then why are my diamonds missing and my house griefed with a sign outside saying ~killer bee looted, huh?\n\nAlso here's something, how stupid are you trying to be, you posted our conversation. OH JAW DATS SOM REEL PROOF RIET DARE.\n\nI also love how you don't post your own messages leading up to my reply."},{"postId":15181,"topicId":1794,"posterId":54,"postTime":1296456541,"postText":">> neato, I'm killer bee, lol then why are my diamonds missing and my house griefed with a sign outside saying ~killer bee looted, huh?\n\nAlso here's something, how stupid are you trying to be, you posted our conversation. OH JAW DATS SOM REEL PROOF RIET DARE.\n\nI also love how you don't post your own messages leading up to my reply. \nI don't really need to post what I said. In all your messages you say \"no proof, nothing wrong with fire, no proof\" then you admit to it."},{"postId":15182,"topicId":1794,"posterId":262,"postTime":1296456792,"postText":"He comes back, and \"Killer bee\" is born? Coincidence?\n\nNot taking any sides yet."},{"postId":15183,"topicId":1794,"posterId":54,"postTime":1296457220,"postText":">> He comes back, and \"Killer bee\" is born? Coincidence?\n\nNot taking any sides yet. \nI agree with this, all he wants to do is grief, pretty sure."},{"postId":15185,"topicId":1794,"posterId":366,"postTime":1296457355,"postText":">> >> neato, I'm killer bee, lol then why are my diamonds missing and my house griefed with a sign outside saying ~killer bee looted, huh?\n\nAlso here's something, how stupid are you trying to be, you posted our conversation. OH JAW DATS SOM REEL PROOF RIET DARE.\n\nI also love how you don't post your own messages leading up to my reply. \nI don't really need to post what I said. In all your messages you say \"no proof, nothing wrong with fire, no proof\" then you admit to it. What are you five? Unless I physically say I did it, then that is me admitting it. This is mere assumption, you have no structural foundation upon your accusations. \n\n[Thread Locked]\nWrong section."},{"postId":15188,"topicId":1794,"posterId":2,"postTime":1296458173,"postText":"It's in the correct section. Don't rage-lock something if you don't like it. It's about your Administrator status and is in the Administration section, it's about the Minecraft server, and in the Minecraft section. Problem?"},{"postId":15189,"topicId":1794,"posterId":366,"postTime":1296458335,"postText":">> It's in the correct section. Don't rage-lock something if you don't like it. It's about your Administrator status and is in the Administration section, it's about the Minecraft server, and in the Minecraft section. Problem? I didn't rage lock, I honestly didn't know. Don't think I'm out trying to piss people off. Thought it would go in either, Staff abuse or actual ban requests, My bad.\n\nAlso I'm not an admin on the server.\n\nI honestly didn't notice."},{"postId":15190,"topicId":1794,"posterId":54,"postTime":1296458622,"postText":"This is for all administration on minecraft, ban request, unban requests, etc. All about minecra-- Goldcraft admining.\n\nSo, stop trying to avoid the whole conversation by locking the thread."},{"postId":15191,"topicId":1794,"posterId":366,"postTime":1296458739,"postText":">> This is for all administration on minecraft, ban request, unban requests, etc. All about minecra-- Goldcraft admining.\n\nSo, stop trying to avoid the whole conversation by locking the thread. But there's nothing to talk about if there is no real proof."},{"postId":15192,"topicId":1794,"posterId":54,"postTime":1296459666,"postText":">> >> This is for all administration on minecraft, ban request, unban requests, etc. All about minecra-- Goldcraft admining.\n\nSo, stop trying to avoid the whole conversation by locking the thread. But there's nothing to talk about if there is no real proof. \nYou admitted to it..\n\n http://i54.tinypic.com/1rvsjk.png  I can upload the whole convorsation, but it's in code. If Kry, Tin, or Pirate needs it, I'll post it."},{"postId":15193,"topicId":1794,"posterId":366,"postTime":1296459928,"postText":">> >> >> This is for all administration on minecraft, ban request, unban requests, etc. All about minecra-- Goldcraft admining.\n\nSo, stop trying to avoid the whole conversation by locking the thread. But there's nothing to talk about if there is no real proof. \nYou admitted to it..\n\n http://i54.tinypic.com/1rvsjk.png  I can upload the whole convorsation, but it's in code. If Kry, Tin, or Pirate needs it, I'll post it. Apparently you don't know what a comma or sarcasm is."},{"postId":15198,"topicId":1794,"posterId":54,"postTime":1296465988,"postText":">> Apparently you don't know what a comma or sarcasm is.  Or you're trying to make up excuses and try to stay unbanned, Killer Bee?"},{"postId":15205,"topicId":1794,"posterId":464,"postTime":1296474113,"postText":"WHAT IS THIS, I DON'T EVEN...\n\nFor a ban, we'd need screencaps of the chat log where he apparently admitted to it.\nThat's the only proof we'd take.\n\nNobody knows who Killer Bee is, TBH. \nWe're finding whoever it is, and banning them.\n\nI think it's unfair to blame Swaim for this, on the basis of the forest fire.\nIf he did start the fire, he'd be banned for that, regardless of whether or not he's Killer Bee.\nHowever, assuming he did it from that isn't enough, currently, to justify a ban.\n\n\nThe server may go down tomorrow, as we search for him.\nWhen Killer Bee is found, we'll do our best to restore any missing items.\n\n\nHang tight, guys. \n--Tin, with a guest appearance from Rageface."},{"postId":15207,"topicId":1794,"posterId":153,"postTime":1296475404,"postText":"This ban request is missing evidence(screenshots, ENTIRE chat logs,) and therefore is invalid.\nI'm locking this because you seem to want Swaim banned for reasons other than doing something wrong.\nLeave it off my forums.\nWe can all tell, when you make it look like Swaim is guilty.\nScreenshots.\nScreenshots.\nScreenshots.\nOn a Side Note,\nI'm making a subforum for goldcraft in the ban request section to keep it organized."}]}