{"topicId":4552,"forumId":30,"topicTitle":"Ability to Vote for Round End (and some other options)","topicTime":1318995264,"topicViews":55,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"nicholsml","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1319150701,"posts":[{"postId":35728,"topicId":4552,"posterId":1140,"postTime":1318995264,"postText":"Hello, some of you may know me in game as Rainbow Dash, and through my experiences playing on the server, (Which I love as if it were my own) I have come to note that sometimes, ridiculously long and uneventful rounds can drag the respawn time of those waiting up to long periods of time, such as 30 minutes before they get to start the next round. I believe that there needs to be a voting option to end the round. This will eliminate dreadful waiting, and hopefully player's with tight schedules and small amounts of free time can get a decent amount of game-time in.\n\nMy Idea of the system: I love the Rock the Vote system, but am a bit unsure about the ability to ONLY vote on a map change, (Or a ban if a donor or up is on) and feel that it needs some tweaking. I imagine the system of round end voting to be in a voting menu, along with votemap and voteban (voteban is an option still strictly for Donators.) The mechanics will be basically the same as the ULX menu, with helpful interface buttons to choose your voting option. The voting panel might also just be added to the f4 menu, in a separate tab. The vote would require the majority/ 3/4 of the server to vote to end the round for it to take effect.\n\nI have had certain experiences where perhaps a guard goes on a mass-freekilling spree, and only a few people remain, after they kill the Minge. Trying to carry on a decent round at that point can sometimes prove difficult, and it would be in the best interest of many to just restart that round, after a nice ban of the guard, so they can resume business, instead of everyone complaining because they were freekilled or the guards killing off the rest of the prisoners just to end the round (which causes more complaints).\n\nTo sum that up, I just think an ability to vote to end the round early would be a nice addition.\n\nAlso, Maybe an option to demote someone from guard status to prisoner status, if they aren't doing their job correctly, and to give them another chance at redeeming themselves before a ban is permitted. This feature could maybe just be a command for moderators or admins, and a voting option for donators. This could prevent some of the terrible atrocities that happen in JailBreak to slim down, or to stop them before they get out of hand.\n\n\n\nOverall, i think these two options will greatly increase effectiveness of the server, and reduce frustration and anger because you don't have the option to do specific things, or have to wait for a ridiculously long time before you can start the next round. (Also, sometimes if there is long wait times, people tend to leave the server. This can temporarily drain the user-base, at least for that given time. I saw a thread about getting the User-base back, and this could help prevent it from getting any lower.) Thanks."},{"postId":35812,"topicId":4552,"posterId":916,"postTime":1319079440,"postText":"1. Ulx is Broken Quack and Ben Needs to Fix it 2. I support this all the way we do need a end round vote nowadays they just take too long and 3. we have backlisting But there are no admins todo so."},{"postId":35932,"topicId":4552,"posterId":735,"postTime":1319148795,"postText":"There should just be a time round limit in TTT.\nThere are atleast 3 things that need to be brought from TTT.\n\nTimed Rounds\nDead and alive chat\nSteamid left/joined"},{"postId":35933,"topicId":4552,"posterId":101,"postTime":1319150701,"postText":">> There should just be a time round limit in TTT.\nThere are atleast 3 things that need to be brought from TTT.\n\nTimed Rounds\nDead and alive chat\nSteamid left/joined \n\nSome rounds need more time than others.\nThere is(?). Not sure what you're trying to say\nThere is in console"}]}