{"topicId":3318,"forumId":14,"topicTitle":"__Crisis","topicTime":1311655199,"topicViews":400,"topicReplies":28,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1311797292,"posts":[{"postId":26275,"topicId":3318,"posterId":79,"postTime":1311655199,"postText":"__Crisis\nTTT\nMark\nSTEAM_0:0:19239021\n\nhttp://www.youtube.com/embed/cv97fYYzPEw\n\nLOOK AT TIME 1:55, you can CLEARLY see someone shoot the sniper towards him and he not saying/doing anything about it. The exact same thing i heard/saw, yet when i do it he complains and yells out kos Crisis. You CAN NOT specifically target 1 person doing something when its clear that at least 2 others in the video have done it. I am requesting a apology and unban for this unrightful ban.\n\nThrough the video you specifically see someone at 1:55 shoot at him on the left hand side next to the box, and him admitting that the detective shot at him and hit him. The ban is unrightful and unjustified since he targeted me particularly to ban."},{"postId":26278,"topicId":3318,"posterId":82,"postTime":1311656465,"postText":"He can persue the others for a ban if he wishes. Although each one was done under certain circumstances, suit the punishment to the offender."},{"postId":26279,"topicId":3318,"posterId":612,"postTime":1311656663,"postText":"Traitor baiting and calling me out for it is different than shooting at the radio."},{"postId":26280,"topicId":3318,"posterId":79,"postTime":1311656805,"postText":"2 things\n\n1) dont post unless involved, you weren't on during this event.\n\n2) You can't ignore one case and not ignore another. (rule in TTT, if you see a traitor kill someone you can NOT ignore it on a case to case basis) With that being said, it was clearly his intent to ignore all the cases until i did it which is what makes this a unrightful ban.\n\nEDIT: found it. http://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=3&t=1988\nRule #9\n\nOverall everything here includes him trucing with a few because of personal resaons or whatever. Specifically targeting me after many others were baiting. Specifically refusing to ban request on others for personal reasons till someone got on his back about it.\n\nI may have done something wrong, i admit to it. But to ban me and not ban others is also wrong. (might of been banned from requests by admins) Not to mention him breaking a few of these rules as well which are quite obvious in his on video. So to ban me without everyone else 'including himself'' is plain out wrong and unrightful."},{"postId":26284,"topicId":3318,"posterId":79,"postTime":1311657465,"postText":">> Traitor baiting and calling me out for it is different than shooting at the radio. \n\nI shot the radio and didn't call you out till u specifically shot me after it was obvious many others were doing the same thing that i just did. The dmg logs that i will post again prove that i was shooting at you.\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/576677340145944285/?\n\nShows that the detective in particular shot him, and that i myself didn't hit him."},{"postId":26285,"topicId":3318,"posterId":612,"postTime":1311657559,"postText":"Who would shoot back a t the DET? you called me out for returning fire when you shot at me. thats why you were banned. get over the fact that i called you out on your bullshit, and that you were wrong."},{"postId":26286,"topicId":3318,"posterId":54,"postTime":1311657652,"postText":"Okay, few things.\n\n1. you're not above the rules, you CAN be banned.\n2. you broke the rules.\n3. you're pretty hypocritical for doing what you did.\n\nCrisis, you're not above the rules, no one is. You are a user, you will be treated as such. You broke the rules, he got proof. Along with the detective. You have both been banned.\nYou traitor baited, you kill for that, but you expect it to be FINE when you do it?"},{"postId":26287,"topicId":3318,"posterId":79,"postTime":1311657731,"postText":">> Who would shoot back a t the DET? you called me out for returning fire when you shot at me. thats why you were banned. get over the fact that i called you out on your bullshit, and that you were wrong. \n\nYet again. You standing still and dmg logs showing no dmg from me to you. You called me out on something your pissed about, this all is a personal attack by definition from refusing to report the others till SPECIFICALLY asked. You broke several rules yourself yet you receive nein in forms of punishment. I am just waiting to see a admin post on this before anything else.\n\nI gave up hating you awhile ago Corey, why don't you yourself stop trolling me in particular (you've gotten several warnings about it) and just let it all go. You have no reason to hate me anymore and this all is just plain bs since its obvious you ignored several others shooting at you."},{"postId":26289,"topicId":3318,"posterId":612,"postTime":1311657808,"postText":"traitor baiting usually doesnt intail damage to the target now does it?"},{"postId":26291,"topicId":3318,"posterId":79,"postTime":1311658149,"postText":">> Okay, few things.\n\n1. you're not above the rules, you CAN be banned.\n2. you broke the rules.\n3. you're pretty hypocritical for doing what you did.\n\nCrisis, you're not above the rules, no one is. You are a user, you will be treated as such. You broke the rules, he got proof. Along with the detective. You have both been banned.\nYou traitor baited, you kill for that, but you expect it to be FINE when you do it? \n\nI never once denied my actions and have explained that CLEARLY but you all dislike me and won't read carefully before responding.\n\nI admitted to what i did, he reported me and im banned. So be it if no unban. Regardless of these things though, you overlook the clear rulebreaking he did throughout the video. He refused to shoot back at 2 people, i understand the detective thing. But overall, you couldn't miss the sniper since i saw it clear as day from quickly going through the video. So that in itself broke rule #9 from no trucing. He says you can't be killed for killing someone baiting you, there for that guy should have been shot ON SIGHT instead of not at all. From the video you can see he's not a traitor so being a ally is not a excuse.\n\nTo ban one for a broken rule means to ban all for breaking the rules. He truced in the obvious sense of it by not killing that guy, but when i shoot he clearly calls me out for it and kills me. Even if i did not call him out, i guarantee someone on the server would have killed him for the initial call out of my name. Over all he broke the rules too yet will receive no punishment? I requested nothing from these obvious rules he broke but am trying to prove my own case by showing you that this was a personal attack of obvious natures. The previous trolling from him to me and this is enough to prove that he's been personal about this. Not only that, but before and after the fact of this incident he trolled. I am fine if the ban stays, but in return i am requesting something be done about his rule breaking.\n\nI not ONCE act like i am above the rules, i follow them to a relatively strict thing. Yes i may brag about barely doing something and not being able to get slayed. But thats more so that you enforce the rules and change them to a stricter behavior.\n\nAnd to Corey's recent post while i was making this long paragraph that i assume you will prolly ignore and not read. If thats the case, you should have shot the others that clearly shot towards the radio then shouldn't you of?"},{"postId":26307,"topicId":3318,"posterId":612,"postTime":1311666277,"postText":">> So that in itself broke rule #9 from no trucing. \nwhat are you? desparate? seriously crisis, if you want to accuse me of trucing for not killing that guy, then you need to be banned longer to think about the whole situation. i didnt target you because i despise you. i posted a ban request because a player who happened to be you called me out when i returned fire for you traitor baiting me. im sorry i didnt kill everyone, i decide to get you because it was more clear to everybody and easy to play off. if you are trying to get me banned, gtfo."},{"postId":26310,"topicId":3318,"posterId":79,"postTime":1311668797,"postText":"Im just saying, they need to look at the whole picture of who all broke the rules instead of saying that i ever said i am above the law. Didn't once say that at all. The way i act is how i act because people wanna bitch that i do shit wrong but never say others do it wrong.\n\nThe whole shooting as a whole, regardless of who you return fire at they are gonna call you out, so you can not expect no one to call ya out regardless of situation.\n\nPeople would have killed you after calling me out/killing me regardless because you missed a certain phrase that you don't want anyone to hear. You specifically called out \"KoS Crisis\". You didn't say it was for baiting or anything else, so to bitch now when it was your own word mishap that ended up getting you killed as well is just plain out wrong.\n\nYou broke the rules and now your calling me desperate. I love how when i point out something others do wrong its 'desperate'' but when i do something and someone calls me out on it, 'that's just normal asshole crisis''. Soon as i join the servers i always get ''everyone stop doing shit crisis is here'' and your one of the morons doing this. Overall i proved my point that your attacking me and its obvious even more with how you responded to coolguys unban request post. He coulda had the same beginning sentence as me but you'd respond differently.\n\nOverall i dunno why im even continuing to post shit, you won't back down or admit to you doing anything wrong. None of the admins will see that this was a personal attack on me since from the post Pharaoh sent Mark its obvious that personal attacks have to be Insults or Straight Up RDM.\n\nSo as a last effort to even sway someones mind on this not just being a ban but a personal issue. Personal Attacks involve ANYTHING from insults being the major side and the lesser unlooked side of having things end up case to case scenario. By case to case i mean as shown in video, not doing a damn thing to the sniper who shot RIGHT by your head and me shooting the ground a clear 3-4 feet infront of you which would obviously show a shot towards the radio more so then you. My shot obviously aimed at radio while his could have hit you or radio. You have had an issue with me for months for no damn reason, i completely forgot about it but you obviously have many more personal issues with it then me.\n\nSo in conclusion, a admin should look at this and say something. Over all its just ended into Corey repeating himself with stupid shit that ends up proving he attacked me in particular and no one seeing it as such. The only things that a admin has said ended up just being a 1 sided complaint towards me for things that i havn't once even said. Saying im a hipocrit even when i admitted to what i did and the wrong-doings of it even though he ONLY called me out on the whole situation rather then everyone who was involved. Everyone says im a hippocrit when the situations that they say this word isn't even remotely close to the other situations. I kill traitor baiters, yes. Do i kill them cause im carrying a item people think is funny to shoot, no. There is a fine line between killing someone for shooting directly at you with no one around and them shooting in a general direction with 5 people."},{"postId":26311,"topicId":3318,"posterId":79,"postTime":1311669333,"postText":"Didn't feel like editing cause this is a IMPORTANT NOTICE. Towards the end of the video, he takes out a knife and DOESN'T LOOK behind him. So for all we know it wasn't even me calling him out that got him killed, from the video stand point when he turned around after walking a little. It is almost clear that someone was following him and PROBABLY if not 100% saw the knife he clearly took out towards the end of this video. So not only does the video now no longer have sound. But he could have EASILY been killed for just bringing out his knife towards the end of the video.\n\nThe only thing anyone said that i remember after i got killed was 'Crisis was innocent''. So im gonna take a wild guess and say that the person actually SAW him take out his knife. Also towards the end, i love how he puts \"Rule Breaking Ass Kisser\". So if thats not CLEARLY attacking someone then nothing is.\n\nEDIT: Its at 2:30 in the video he SPECIFICALLY calls me a \"Rule Breaking Ass Kisser\".\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/576677340150729023\n\nLinked is a screenshot of people agreeing that this remark/comment is a Personal Attack/Troll comment directed specifically at me. Hope this helps show that he specifically tried targeting me hence the grudge he obviously still has towards me."},{"postId":26332,"topicId":3318,"posterId":612,"postTime":1311703855,"postText":"Fact is, you called me out for your own actions. Now you are saying that because I pulled out a knife I got killed. What's your story. \n\nAlso. \nI can call KOS on anyone. I was traitor"},{"postId":26334,"topicId":3318,"posterId":79,"postTime":1311704307,"postText":"Point is, regardless if you say KoS on someone or not, if you don't specify kos Crisis he's traitor baiting, you have no reasoning to bitch about getting killed when its almost 100% clear that you got killed for pulling a knife. Every time i kill someone for T baiting i specifically yell out \"*so and so* is Traitor baiting, kill him.\" If no one else does, i do. I still get killed for it as well, so your saying i should make a ban request on EVERYONE who kills me when i yell this out, since apparently getting killed after killing a T baiter isn't allowed. Far as calling you out, EVERYONE calls someone out after T baiting and getting shot back, its natural reaction when you don't hit the person. But i guess ill be posting 5x more ban requests and if a single one gets denied i guess i know whats going on.\n\nThis whole situation has just been a way for you to get me off the server when you know damn well you had no reasoning to specifically target me. You keep saying it wasn't a personal attack, look at the way you did things.\n\nStep by Step:\n1) Report Crisis for T baiting.\n2) Get video up showing that your trolling/attacking someone.\n3) Ignore the others shooting at you obviously in video but say nothing.\n4) Get talked to, to SPECIFICALLY give names of others.\n5) Get forced to give other names that you clearly had no intention of giving out previously.\n6) Troll more with all your bs replies to everything.\n7) Laugh at me getting banned and you not from obvious trolling.\n8) Make non-useful remarks on posts that are trolling remarks."},{"postId":26335,"topicId":3318,"posterId":612,"postTime":1311704462,"postText":"It was all part of my plan crisis. I mind controlled you. Sorry. Seriously. Get over it. You broke the rules. On your own. I'm not trolling you. Bye."},{"postId":26336,"topicId":3318,"posterId":79,"postTime":1311705220,"postText":"Always funny how in the end you the person doesn't realize that they themselves broke the rules and the fact that ive said multiple times, \"i admit to it\". Learn English and how to read then get back to me, i specifically said many times i admit to it but to not punish all means you punish none. These are the laws of almost everywhere. You broke the rules in your video so there for you also must accept punishment, to not have you punished from your obvious rule breaking would go against everything and there for punishment must fit the crime. I broke a server rule, you broke a rule on ALL servers + forum rules. To make a personal attack comment regardless of situation is not allowed. Which is why i am requesting if nothing done to you as well then all the bans made from this be removed. I am not saying this didn't happen, i am saying that to punish one means to punish all or none.\n\nSo again: http://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=103&t=2018\n\nFORUM rule #12. No personal attacks, the video at 2:30 is a blatant personal attack towards me."},{"postId":26337,"topicId":3318,"posterId":612,"postTime":1311705916,"postText":"because not killing everyone instantly, im trucing got it.\nmaking a ban request on crisis, personal attack. got it.\nreplying to his post that is clearly misleading, im trolling. got it.\n\nany other rules crisis? because it seems so unfair, to me atleast."},{"postId":26398,"topicId":3318,"posterId":112,"postTime":1311734858,"postText":">> Every time i kill someone for T baiting i specifically yell out \"*so and so* is Traitor baiting, kill him.\" \n\n\nWoah woah woah. This is news to me?\n http://cloud.steampowered.com/ugc/576677340061642265/6A1383FACD64E4B98AAE3D490A0861C2E34D0FF8/ \nI thought you specifically told me numerous times that you never told them before hand.\nYou certainly didn't do it that time.\n\nYou just made a giant to-do about this complaining you don't warn people, and shouldn't have to.\nIn fact, you posted this ban request complaining about getting rdmed for doing the EXACT opposite of that.\n\nEdit: Also,\n\n>>   Rules for Unban requests  \n-Do not lie in an unban request. If you are caught lying you will be permanently banned.\n \n\nI figured you would have read that, but I guess you chose to ignore it."},{"postId":26403,"topicId":3318,"posterId":79,"postTime":1311736387,"postText":"Pharaoh, why not read before posting. That image you sent me specifically says i don't ''WARN''. That has nothing to do with when i call people out. So if your gonna post something as a warning/threat you can at least do it correctly. I don't WARN people but i do call them out as a baiter. I have been told to warn them before hand by you so I need to get in a habit of doing that, but overall i don't just kill them or get them killed by saying ''KOS *username here*''. I yell out ''*username here* is T baiting, kill him'' or i kill him myself and explain during/right after why i killed him. But thanks for the whole lying on a unban thing even though from what i can see i havn't lied yet. \n\nIf i have i apologize but from what i can tell i havn't yet."},{"postId":26416,"topicId":3318,"posterId":112,"postTime":1311739254,"postText":"You shot the guy without saying anything the died and complained rdm.\nYou yourself said you never tell them"},{"postId":26422,"topicId":3318,"posterId":79,"postTime":1311740335,"postText":"Like i said, i don't normally warn. Which you told me i should start doing. Far as getting killed, i complained that he baited then i got killed for it instantly, dont remember if i said he was T baiting or not. But either way, i got banned for doing what Corey got me banned for. Yet you refused to do nothing even though you were on server and he ADMITTED to doing it with you there. So overall me getting banned and not him at this point is just plain stupid. Since not everyone can take video, i thought him admitting to shooting/baiting and me getting killed for it would be enough proof. But apparantly the guy that ADMITS to it isn't enough proof.\n\nEither way, that was a separate scenario that doesn't involve this one anymore, since you blatantly said that i didn't have proof even though you were there when he admitted to it."},{"postId":26437,"topicId":3318,"posterId":957,"postTime":1311751764,"postText":"Ok people are saying im caught in this drama war is it true?"},{"postId":26438,"topicId":3318,"posterId":801,"postTime":1311753231,"postText":"Crisis, i want to basically sum up what i think is going down. Please somebody correct me if I'm wrong.\n\n1. Crisis got banned for traitor baiting.\n2. Crisis doesn't understand it wasn't for him or everybody shooting at the radio.\n3. Crisis doesn't understand he got banned for the baiting, Not the shootings.\n\n(crisis, I'm not trying to say anything bad about you, I'm just trying to sum up what i think went down.)"},{"postId":26444,"topicId":3318,"posterId":612,"postTime":1311761393,"postText":"Tweekie. \n3. \n\nAnd there's only a day left now. Drop it?"},{"postId":26450,"topicId":3318,"posterId":801,"postTime":1311768198,"postText":"alright, thanks :D"},{"postId":26473,"topicId":3318,"posterId":79,"postTime":1311790687,"postText":">> Crisis, i want to basically sum up what i think is going down. Please somebody correct me if I'm wrong.\n\n1. Crisis got banned for traitor baiting.\n2. Crisis doesn't understand it wasn't for him or everybody shooting at the radio.\n3. Crisis doesn't understand he got banned for the baiting, Not the shootings.\n\n(crisis, I'm not trying to say anything bad about you, I'm just trying to sum up what i think went down.) \n\n1. Got banned for Traitor Baiting which 3-4 others were doing. (Him refusing to post ANYONE elses name for it till yelled at)\n2. I understand i got banned. (But why only me when that many others were doing it, you CAN NOT pick and choose who you ban when so many did it)\n3. This is same as #2. (everyone was shooting at him and in the video it shows 2 others doing it, i called him out since he didn't care everyone else did it.(Yes, i can call you out if you ONLY choose to attack me and not the others))\n\nFinal note, SOME DAMN ADMIN POST ON MY BAN REQUEST. Its a legitimate post with proof of personal attack, if nothing other then the 2:30 mark on the video. You wanna complain about breaking rules and that was a rule broken and i will not give up on that ban request. He did something wrong and he will pay the price like i had to. Like i said, this has gone on far too long and i don't feel like i should accept an apology that people are just fucking faking anyway. Pardon the curse but this IS NOT a E rated game, both games you need to play effectively are rated M, so if you can't handle a little cursing you shouldn't be playing imo."},{"postId":26483,"topicId":3318,"posterId":976,"postTime":1311792708,"postText":"-Snip-"},{"postId":26492,"topicId":3318,"posterId":101,"postTime":1311797292,"postText":"The ban is either over or has about 2 hours left. This is pretty much unneeded now. Locked unless a different admin needs to unlock it."}]}