{"topicId":4506,"forumId":3,"topicTitle":"Fanboys.","topicTime":1318722073,"topicViews":237,"topicReplies":22,"topicStatus":1,"topicFirstPosterName":"CoreyW.Rogerson","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1318906665,"posts":[{"postId":35456,"topicId":4506,"posterId":612,"postTime":1318722073,"postText":"I think is should be illegal to intentionally add the \"Dr.\" prefix to you name just to piss me off. its more annoying than anything, also leads to RDM\n\nits borderline trolling. Please, grow up (80% of)NNJG.\nHeres my reason:\n\nToday we were at peaches castle, and external flame added Dr. to his name [ The Dr. External Flame ] and i asked him to change it, he did. then Nova, seeing that it bothered me immediately changed his name to [ Dr. Nova ]. i then asked player about the ruling on that, which his view was that its not impersonating, but adding a common prefix (which wasnt so common before i added it.). i then stated that its not very funny, and that it was extremely annoying. i got called mad by 4 people and left. thus posting this.\n\nanyway, i'd just change my name except im having a contest with fudge about gametracker score. and its not me who should change names, im the original. minus garbonzo who doesnt/didnt play much.\n\ncan a man just have his name with out all the kiddies copying it? Damn."},{"postId":35463,"topicId":4506,"posterId":517,"postTime":1318727473,"postText":"What if someone who already has the dr name, and has never seen you joins the server, he can keep it right?"},{"postId":35464,"topicId":4506,"posterId":612,"postTime":1318727955,"postText":"doesnt classify as fanboy. so sure, i would still ask him if he would remove it for confusion sake."},{"postId":35465,"topicId":4506,"posterId":612,"postTime":1318728785,"postText":" http://cloud.steampowered.com/ugc/595825477959614405/F406C8474E5C924D62DE13349A7476265756D8FE/ \n http://cloud.steampowered.com/ugc/595825477959613787/8A94BF535071D17BCD68D1FBABA3C72F0EF3B4CC/ \n\ngoing too far, asked nicely for them to stop. its beyond fun. \ntake action."},{"postId":35467,"topicId":4506,"posterId":115,"postTime":1318732139,"postText":"The \"Dr.\" prefix isn't a reserved prefix. Maybe if it was something not used so commonly, then it would possibly count as trolling. But since it's so common, I highly doubt anyone could get in trouble for changing their name to include \"Dr.\" or anything of the sorts."},{"postId":35469,"topicId":4506,"posterId":612,"postTime":1318733145,"postText":"didnt start until i asked if external would change his name back, they are doing it be cause it bothers me\n\ntrolling."},{"postId":35470,"topicId":4506,"posterId":2,"postTime":1318733410,"postText":"This is similar to when you had your name set to \"Mr. Rogerson [NNJG]\" to imitate my steam name. How is your situation any different, and why should we act differently? Is it okay when you're not the victim?"},{"postId":35473,"topicId":4506,"posterId":292,"postTime":1318741088,"postText":"Just putting this here, if those screenshots are showing me(Dr. Doctor, M.D.) as part of the supposed trolling, immediately after changing my name I asked you twice if it was okay to use it and you never responded. So I assumed it was fine.\n\nI used that name not to make you angry but because I'd heard it before and thought it was funny(Doctor Doctor Medical Doctor?), so, no hard feelings."},{"postId":35479,"topicId":4506,"posterId":612,"postTime":1318744946,"postText":">> This is similar to when you had your name set to \"Mr. Rogerson [NNJG]\" to imitate my steam name. How is your situation any different, and why should we act differently? Is it okay when you're not the victim? \nAsk Kryzoid why. he told me to do it so i did. you never once ask anyone to stop. its not the same.\n\n\n>> Just putting this here, if those screenshots are showing me(Dr. Doctor, M.D.) as part of the supposed trolling, immediately after changing my name I asked you twice if it was okay to use it and you never responded. So I assumed it was fine.\n\nI used that name not to make you angry but because I'd heard it before and thought it was funny(Doctor Doctor Medical Doctor?), so, no hard feelings. \n\nand no, no hard feelings. the main thing is nova. even after asking external to change back, nova immmediately chnge his name at the end of the round.\nthen there is mario who did the same thing and added \"Better degree than corey. its like everything i do on the server gets copied. its annoying and needs to stop.\nlike later this night, i was playing in a shop on amsterville with the cargo cart things and making a tunnel. everyone followed me everywhere and kept grabbing my props while im minding my own business.\nthen yesterday me and fudge were having a crowbar fight throgh a window, then 02 joins in, then nutter, then EVERYONE IN THE SERVER.i cant be original with out being repeated, maybe i should start petitions.. oh wait, they get trolled too. its wierd. everyone likes to piss me off.\n\n its trolling if he does it to piss me off intentionally. if you cant see that then resign."},{"postId":35493,"topicId":4506,"posterId":634,"postTime":1318769207,"postText":"Hey guys! Remember that dude that plays on our server with the __ in front of his name? And we used to put those in front of our name? Because I do. Remember how he told us to stop and we didn't and he couldn't do anything about it? Because I do."},{"postId":35502,"topicId":4506,"posterId":612,"postTime":1318785416,"postText":"Well I dont. And never did that"},{"postId":35510,"topicId":4506,"posterId":115,"postTime":1318786905,"postText":"Everyone has the right to change their name to anything they want to, as long as its not offensive/racist/vulgar, impersonating an admin, or impersonating another player (who is playing at the same time)."},{"postId":35512,"topicId":4506,"posterId":612,"postTime":1318787658,"postText":"That's bullshit."},{"postId":35524,"topicId":4506,"posterId":115,"postTime":1318797299,"postText":"Not really.\n\nIm telling you, maybe if it was less common of a prefix, then maybe, just MAYBE it would be acted on. But the \"Dr.\" prefix isnt reserved for you corey. It never will be reserved. Whether it's upsetting you or not isn't anyones problem but yourselves."},{"postId":35538,"topicId":4506,"posterId":612,"postTime":1318803072,"postText":"its not that its reserved. its that they are doing it BECAUSE i asked them not to. its trolling and against the rules if you cant see that. never thought id point out a rule to the admins."},{"postId":35540,"topicId":4506,"posterId":634,"postTime":1318804004,"postText":">> its not that its reserved. its that they are doing it BECAUSE i asked them not to. reign your admin if you cant see that. \nresign?\n\nand Corey, if it upsets you that much maybe you shouldn't be using the internet, it doesn't come with padded walls. I honestly thought you wouldn't be the kind of person to whine about something so small.\n\nEDIT: Are you going to start asking people to be punished for knifing you because they know that you don't like it?"},{"postId":35551,"topicId":4506,"posterId":1087,"postTime":1318809430,"postText":"This reminds me of when everyone changed there name to add the suffix \"Hata\" at the end of their name, thus annoying playerhata. It happens all the time to everyone, its jsut all in good fun, not to tease or make fun of anyone."},{"postId":35552,"topicId":4506,"posterId":812,"postTime":1318809757,"postText":">> This reminds me of when everyone changed there name to add the suffix \"Hata\" at the end of their name, thus annoying playerhata. It happens all the time to everyone, its jsut all in good fun, not to tease or make fun of anyone. \nIt didn't annoy me, I was fine with it.\n\nAs for this Corey, I really don't know what you're even trying to institute. If you're suggesting that we reserve names now, that's just plain ridiculous. And if you're asking that only YOU can EVER wear the Dr. tag......that's also ridiculous."},{"postId":35553,"topicId":4506,"posterId":634,"postTime":1318809969,"postText":">> If you're suggesting that we reserve names now, that's just plain ridiculous. \nNames are reserved. I can't show up on the server with the name Eclipse. However, PARTS of names are not reserved, I can be Destaclipse as much as I want."},{"postId":35554,"topicId":4506,"posterId":812,"postTime":1318810316,"postText":">> >> >> If you're suggesting that we reserve names now, that's just plain ridiculous.  \nNames are reserved. I can't show up on the server with the name Eclipse. However, PARTS of names are not reserved, I can be Destaclipse as much as I want. \nI understand that going under a regular user's name is obviously not allowed. I thought he was insinuating that we should be able to reserve whatever names we'd like, even if it's not used as our most common alias at all times."},{"postId":35572,"topicId":4506,"posterId":1087,"postTime":1318819787,"postText":"If I wad corey I would be happy.to know that I started a huge fad. It just means people liled your idea, so.they copied it. I wouldnt mind if everyone had president in there name or Is C-cgull. People just need to learn not to call people out  by a common tag. I.E: President Wheatley and President Eclipse. Instead of calling out the.name President, they should say.Wheatley or.Eclipse. also.sorry about.the.sloppyness, im typing this from my.phone.xD"},{"postId":35597,"topicId":4506,"posterId":612,"postTime":1318864964,"postText":"No. Please lock this. O was on a bad mood this weekend guys. I pissed alot of people off. Apologies. It doesn't really bother me at all, I was just being a dick. Forgive me."},{"postId":35635,"topicId":4506,"posterId":101,"postTime":1318906665,"postText":"Done.\n\nFinal verdict (for anyone who cared): No common section of a name can be reserved."}]}