{"topicId":4420,"forumId":1,"topicTitle":"Where are we.","topicTime":1317886919,"topicViews":183,"topicReplies":11,"topicStatus":0,"topicFirstPosterName":"CoreyW.Rogerson","topicFirstPosterColor":"","topicLastPosterName":"CoreyW.Rogerson","topicLastPosterColor":"","topicLastPostTime":1318930414,"posts":[{"postId":34948,"topicId":4420,"posterId":612,"postTime":1317886919,"postText":"Gash, it's been a while( forever) since we have made a huge improvement for NNJG. I don't know what we could strive for but what is holding us back. \n\nDoes nnjg have an official money account, with money saved up for things like this?\n\nIs there anything we as a community can do to help with this progression?\n\nIf anyone would like to help financially post here saying so. ( nnjg could probably always use a bit of extra cash) \n\nAny suggestions as to moving forward as a whole?\nHere's mine. (kinda goes with bens idea of the DoDS server and game coverage. )\nExpand to widely popular games. It seems as though nnjg is strictly TTT ( now growing to puzzle,slowly.) \nA game that'd be good to expand on is Cod 4. People say it's a dead game due to MW2 and Black ops. But it has a HUGE player base. There we could get into competition and money tourneys. Cod4 competition mod is Promod, which basically limits the gun choice to guns that aren't op and takes away\"perks\" to give a more equal playing field. Its hugely popular( about 80% of cod4 players play it. Me and fudge were among the better players. competitions and tourneys get you lots of monetary gains and sponsorships. If you want more info( anyone) steam message me. Hell, i can do server set up for you.  why not try it? \n\nIt's a good move if you ask me. \n\nBut does any one else have ideas? And not just different games. But different anything.\n\nSo Far:\n Corey \n Quack  \n Aimbot \n Dum "},{"postId":34949,"topicId":4420,"posterId":612,"postTime":1317887037,"postText":"Also cod jumper. Fudge an I were pro. But probably rusty nowadays.\n\nEDIT: played cod4 today, still at the top"},{"postId":35029,"topicId":4420,"posterId":115,"postTime":1318016984,"postText":"No.\n\nFirst off, NNJG has the money. The problem is lack of interest to DO anything.\n\nThe garrysmod playerbase is small for NNJG. Why would we even try to build playerbases elsewhere when we haven't gone as far as we can in garrysmod? The garrysmod players who have these games would be the ones populating the servers. Right now, we can barely keep 2 servers full, let alone servers for other games."},{"postId":35034,"topicId":4420,"posterId":735,"postTime":1318025171,"postText":"Supply>demand (as of now)"},{"postId":35482,"topicId":4420,"posterId":101,"postTime":1318748120,"postText":"We don't have the playerbase because we only are on GMod/minecraft. Seriously, this goes in a loop. Not enough playerbase = Not filled servers in other games. Not enough servers in other games = No gain in playerbase.\n\nSeriously, go into TTT and see how many of the people are regulars. For me it's usually about 85%\n\nEDIT: It seems as I have done a mini-bump. Please ignore that fact."},{"postId":35483,"topicId":4420,"posterId":612,"postTime":1318753306,"postText":"its an important topic, should be excused. but if we could fund a server, i could do all the work within that server and on that server to extend player base.im cod4 pro man. ive owned countless servers with many mods and custom stuff. i can do it man."},{"postId":35489,"topicId":4420,"posterId":605,"postTime":1318763492,"postText":"Not only is it an important topic, but also the fact dum was unable to add feedback to it early on adds a reason in of itself to allow a minibumb.\n\nAlso, the biggest issue would be settling on what type of server, then having part of our playerbase stick to that server, so it becomes known and attracs other players, untill the point it gets enough regulars to keep it full."},{"postId":35503,"topicId":4420,"posterId":612,"postTime":1318785850,"postText":"I'd have have to advise that we should go with Promod. As the game cod4 is quite old, many players play Promod for the competitive leagues. Not to mention stock(regular game modes, not mods) has alot of OP shit."},{"postId":35515,"topicId":4420,"posterId":101,"postTime":1318789438,"postText":"I forgot to say this in my other post: We need to find a game other than GMod and try and get about the server half full constantly for about a month or two or until we start to get new regulars in there.\n\nAlso, I'm still looking over pretty much every damn post that's been posted in the past month. I never realized how much we posted until now D''="},{"postId":35531,"topicId":4420,"posterId":735,"postTime":1318800514,"postText":"Though, I do like the idea of getting a CoD server up, I don't think [NNJG] needs to expand its'' Gmod servers."},{"postId":35627,"topicId":4420,"posterId":1097,"postTime":1318904020,"postText":"well, I love to attend in every event that you guys made, but the problem is that my laptop to weak to handle COD 4, and lack of $ to buy 1"},{"postId":35673,"topicId":4420,"posterId":612,"postTime":1318930414,"postText":"This would be a great chance to bring the community together, can we atleast TRY it on a nnjg game night? I'll rent a server or something. It's also good timing because shut tons of people are pre ordering MW3 which comes with a free copy on Cod 4"}]}