{"topicId":4035,"forumId":18,"topicTitle":"The NNJG Fun Group","topicTime":1315426802,"topicViews":52,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"[NNJG]Ben","topicFirstPosterColor":"000000","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1315435565,"posts":[{"postId":32545,"topicId":4035,"posterId":153,"postTime":1315426802,"postText":"Just a warning to any NNJG fun group members:\nIn the group description it clearly states:\n>> \nThis is a group where members of NNJG go on servers and games to have fun. Whether it be by trolling, messing around, or just playing, we do it all.\n \n\nJust letting you know, if I see or get reports about this group trolling on NNJG servers or other servers, I will group ban the group.\nWe can't have a group with the NNJG title representing us by \"trolling\" or \"messing around.\"\n\nI think it's a great idea to start clan groups, but if we are poorly represented, a group ban will be put in place.\n\nThanks.\n\n-Ben"},{"postId":32549,"topicId":4035,"posterId":101,"postTime":1315427486,"postText":"I denied it because it's about the 5th group that someone's attempted to make to have fun and schedule things but nobody goes through with it. And they all seem to have the same avatar."},{"postId":32551,"topicId":4035,"posterId":6,"postTime":1315428366,"postText":">> I denied it because it's about the 5th group that someone's attempted to make to have fun and schedule things but nobody goes through with it. And they all seem to have the same avatar. \nLet it be known, that mine was the first, and they all stole my avatar. I really don't have the patience to organize the Game Nights, that is why I added you to officer on it, Dum, and that was a couple of weeks ago. Every person I add to officer on it, ends up doing nothing. That's why it seems like nothing's happening on it.\n\nBack on topic;\n\nYeeeaaaah, I agree here. Seriously, don't troll on other peoples server. It's just as bad as trolling on OUR servers, yet they wouldn't want that, would they? Seriously, it's not funny or good."},{"postId":32561,"topicId":4035,"posterId":101,"postTime":1315430204,"postText":"Whenever I proposed an idea on Game Nights you/kob just said \"No.\""},{"postId":32568,"topicId":4035,"posterId":115,"postTime":1315432621,"postText":"It was a joke clan, I was going to do a sam.jpg group but I decided to just leave the group and apparently when there's nobody else heading the group, it assigns a random person. So nows it's headed by some guy who only plays tf2.\n\nBasically it now has nothing to do with NNJG, so you dont have to worry, and half the members aren't even in NNJG.\n\nI will contact the head of the group as soon as he gets on to change the name as well."},{"postId":32574,"topicId":4035,"posterId":6,"postTime":1315435013,"postText":">> Whenever I proposed an idea on Game Nights you/kob just said \"No.\" \nThat is a complete lie. You never proposed anything. Anyways this really isn't the topic to talk about it on."},{"postId":32576,"topicId":4035,"posterId":101,"postTime":1315435565,"postText":">> >> Whenever I proposed an idea on Game Nights you/kob just said \"No.\" \nThat is a complete lie. You never proposed anything. Anyways this really isn't the topic to talk about it on. \n\nWell I asked Kob and he said no."}]}