{"topicId":3192,"forumId":14,"topicTitle":"Chessnut.","topicTime":1309913551,"topicViews":487,"topicReplies":25,"topicStatus":1,"topicFirstPosterName":"Chessy","topicFirstPosterColor":"","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1310297317,"posts":[{"postId":25330,"topicId":3192,"posterId":349,"postTime":1309913551,"postText":" Your In-Game name:  Chessnut\n Your Steam ID:  STEAM_0:1:1486564\n Reason:  You  know  why.\n Length of Ban/Date and Time of Unban:  Permanent.\n What server were you playing?:  PERP.\n Who banned you?:  Ben.\n Why should we unban you?:  ENOUGH, is enough. It has been about one year since the incident happened.\nYou can either still hold a grudge and remain stubborn, or let it go.  Honestly. "},{"postId":25331,"topicId":3192,"posterId":54,"postTime":1309914174,"postText":"lol, the little kid who decided to ruin our perp game mode. If it were up to me, I'd say no. A perm is good for you. \nIt's up to Ben to decided weather he wants to let you return or not."},{"postId":25332,"topicId":3192,"posterId":101,"postTime":1309914345,"postText":"I say no."},{"postId":25335,"topicId":3192,"posterId":272,"postTime":1309920644,"postText":"I say chessnut can go fuck himself."},{"postId":25336,"topicId":3192,"posterId":2,"postTime":1309921214,"postText":"You're all acting childish about the unban request. Calm down."},{"postId":25337,"topicId":3192,"posterId":4,"postTime":1309924583,"postText":">>  Your In-Game name:  Chessnut\n Your Steam ID:  STEAM_0:1:1486564\n Reason:  You  know  why.\n Length of Ban/Date and Time of Unban:  Permanent.\n What server were you playing?:  PERP.\n Who banned you?:  Ben.\n Why should we unban you?:  ENOUGH, is enough. It has been about one year since the incident happened.\nYou can either still hold a grudge and remain stubborn, or let it go.  Honestly.  \nYou don't even show a bit of remorse."},{"postId":25340,"topicId":3192,"posterId":911,"postTime":1309938559,"postText":"you cant just push into  Uban request say your srry and let him decide"},{"postId":25344,"topicId":3192,"posterId":112,"postTime":1309960367,"postText":">> you cant just push into  Uban request say your srry and let him decide \n\nPlease don't post in unban requests unless you're directly involved.\nBelieve it or not everybody that posted so far is admin or mod xD\n\n\nChessnut, what servers exactly are you looking for an unban in?"},{"postId":25347,"topicId":3192,"posterId":115,"postTime":1309961445,"postText":"He ruined a server (PERP). He ruined a perfectly good server and treated us as if we were his little toy.\n\nI say no. You caused us enough bad luck. You don't even sound sorry."},{"postId":25350,"topicId":3192,"posterId":349,"postTime":1309969538,"postText":"Well, the reason being: The top of the community was basicly rationing loads of money to the playerbase. I wanted thing to be fair. You all do not know the story, I told Ben I needed the DB for my personal reasons and told him TO BACK IT UP. He claims that he already did, and I gave him 24 hours. Once the period had expired, I began my usage. The database they used was my property and I have my rights to it. You people act  childish  with your feeling of insecurity. Really, most of you barely heard the story, and it was even the wrong one. Pharaoh seems to be the only one who would listen, along with Mr. Gash.\n\nI would like to be unbanned from TTT."},{"postId":25353,"topicId":3192,"posterId":101,"postTime":1309971175,"postText":">> Well, the reason being:   The top of the community was basicly rationing loads of money to the playerbase. I wanted thing to be fair.   You all do not know the story, I told Ben I needed the DB for my personal reasons and told him TO BACK IT UP. He claims that he already did, and I gave him 24 hours. Once the period had expired, I began my usage. The database they used was my property and I have my rights to it. You people act  childish  with your feeling of insecurity. Really, most of you barely heard the story, and it was even the wrong one. Pharaoh seems to be the only one who would listen, along with Mr. Gash.\n\nI would like to be unbanned from TTT. \n\nYou were the one giving 200,000 dollars or so to people who joined your org so you could buy 10000 car bombs and let them buy one of the most expensive cars."},{"postId":25354,"topicId":3192,"posterId":349,"postTime":1309971746,"postText":"Do not recall, think it was another administrator."},{"postId":25356,"topicId":3192,"posterId":272,"postTime":1309977740,"postText":"The reason I refuse to listen is because you sabotaged an NNJG server, destroying everyone's work on it. I see absolutely NO reason why you should be forgiven, and you don't seem the slightest bit sorry. Chessnut, you don't deserve an unban, and you know it."},{"postId":25358,"topicId":3192,"posterId":153,"postTime":1309979294,"postText":"Request Approved.\nBTW, As I recall, I banned him because we discovered back doors he coded in.\nAnyway, my reasoning is this:\nWhat he did broke no existing rules at NNJG. We gave him access to the gamemode and set no guidelines. He was banned for a back-end action, not a front-end action. Therefore, he only deserves to be punished in the back-end(losing perp ftp and cp access) not the front end."},{"postId":25360,"topicId":3192,"posterId":349,"postTime":1309979871,"postText":"I didn't have any backdoors. :L"},{"postId":25362,"topicId":3192,"posterId":101,"postTime":1309981633,"postText":"Now that right there is bullshit."},{"postId":25371,"topicId":3192,"posterId":2,"postTime":1309999814,"postText":">> Ben\":2fhioj65]Request Approved. \nYou haven't even considered anyone's opinion other than your own. I don't think he should be unbanned until discussed with the administrators that were involved. \n\n>> ... you sabotaged an NNJG server, destroying everyone's work on it. \nI agree with this, and the loss of the database made most if not all active players quit.\n\n>> Ben\":2fhioj65]I banned him because we discovered back doors he coded in. \nThat's obviously not contributing or helping the server in any way, why should he be allowed on any of our servers if he did what you said he did?"},{"postId":25373,"topicId":3192,"posterId":115,"postTime":1310002527,"postText":">> Now that right there is bullshit. \nThis.\n\nYou do realize he ruined PERP for us? Do you realize that he ruined a NNJG server, basically stopping anyone from playing? \n\nI'd treat him as an exploiter, a hacker, and nothing less. He disgraced NNJG. I was there when it happened, Ben, I may not know the whole database shit, but I do know how he ruined the economy and I witnessed it all happen. He treated the whole server like his little playtoy. Oh yeah, did you know after he left NNJG, he went right to S3G?\n\n\n\nGet him the hell away from NNJG."},{"postId":25375,"topicId":3192,"posterId":54,"postTime":1310003974,"postText":"Why should he be unbanned? He's not remorseful or anything. He just wants to be unbanned. There's no \"i'm sorry\" here, or no explanation. Just \"HEY! it's been a year. unban pl0x?!?!\" He's not sorry for what he did, he doesn't even act like it. I think the ban should stay, and you should reconsider, Ben."},{"postId":25395,"topicId":3192,"posterId":940,"postTime":1310057018,"postText":"You guys  do  know I was the one who set up PERP right? The map? The database was my own. It is my right to the database, not NNJG. I needed it for my own purposes. Stop with your  constant  bullshit. The only reason I went to S3G was because they actually ACCEPTED me. You all talk shit in regards to S3G, but they haven't done anything to you. They're just another TTT server. There are  multiple  TTT servers I do not see you hating on. What happens if they wanted to split? So what, you are NOT in charge of them. They are not your property, stop being so  greedy . I want to play on a decent TTT server and all you guys do is rant."},{"postId":25396,"topicId":3192,"posterId":272,"postTime":1310058694,"postText":"You still show no remorse. Nobody here is going to change their opinion. Saying \"For fucks sakes, come on already\" ISN'T going to help your case. I suggest you give a reason other than \"Let me play on the fucking server, god.\" if you want anyone to consider your request. I don't want you here, and I'm sure many others share my opinion. Oh, and telling us to stop our constant bullshit isn't going to change our minds."},{"postId":25403,"topicId":3192,"posterId":115,"postTime":1310066539,"postText":"Chessnut, you're obviously missing the point. You RUINED the economy on the server by saying \"ITS MY DATABASE I CAN DO WHAT I WANT\". That's why you're banned. You ruined a server that belonged to NNJG, and that's that.\n\nAnd who cares if you set up the server? We also had a PERP coder, and he didn't fuck things up as bad as you.\n\n\nYou were a shitty coder, too."},{"postId":25418,"topicId":3192,"posterId":940,"postTime":1310079886,"postText":"You are  still  that butthurt?\n\nSorry for being an 12 year old coder. Heh, that did the job.\n\n>> \nI don't want you here, and I'm sure many others share my opinion. Oh, and telling us to stop our constant bullshit isn't going to change our minds. \n\nReally? Bullshit? Yeah right.\n\n>> \nAnd who cares if you set up the server? We also had a PERP coder, and he didn't fuck things up as bad as you.\n \n\nYou  really  need a PERP coder? Why can't the people who started the community code."},{"postId":25420,"topicId":3192,"posterId":272,"postTime":1310081117,"postText":">> Stop with your  constant  bullshit. \n\nYep. Bullshit. Now you haven't done a single thing to help your cause since you made the thread. It's time to leave."},{"postId":25423,"topicId":3192,"posterId":115,"postTime":1310084369,"postText":"Chessnut, we don't  need  to put up with you. You're most likely not getting unbanned, and if you are, then it should be more of a sin.\n\nWhy would we ever forgive someone who burned our community, practically ruining a server? \n\nI think I speak for 95% of the administration (discluding Ben since he wants to unban you) when I say you burned us, with your bullshit 12 year old excuses. We don't want you back, nor would we have a reason to bring you back.\n\nYou've been acting ungrateful, selfish, and not in the least remorseful or humble. We don't want you back, and you won't be coming back."},{"postId":25539,"topicId":3192,"posterId":54,"postTime":1310297317,"postText":">> You are  still  that butthurt?\n\nSorry for being an 12 year old coder. Heh, that did the job.\n\n>> \nI don't want you here, and I'm sure many others share my opinion. Oh, and telling us to stop our constant bullshit isn't going to change our minds. \n\nReally? Bullshit? Yeah right.\n\n>> \nAnd who cares if you set up the server? We also had a PERP coder, and he didn't fuck things up as bad as you.\n \n\nYou  really  need a PERP coder? Why can't the people who started the community code. \n\nSo, you're not remorseful at all and you make fun of NNJG. Yeah, he sure does deserve to be unbanned!\nAlso, all we do is rant? Then why do you want to come back?\n\nSorry for the unlock, just wanted to post this\nlocked again."}]}