{"topicId":4049,"forumId":3,"topicTitle":"Traitor health vial","topicTime":1315512465,"topicViews":168,"topicReplies":17,"topicStatus":0,"topicFirstPosterName":"Jesusthewizard","topicFirstPosterColor":"","topicLastPosterName":"Sohisohi","topicLastPosterColor":"","topicLastPostTime":1315574296,"posts":[{"postId":32694,"topicId":4049,"posterId":694,"postTime":1315512465,"postText":"I know not many people use it but who actually thinks the health vial should give 20 health instead of 10.\nIt just seems too low to seem like any sort of benefit so maybe remove it (and replace with a cooler item) or give it the 10 point upgrade it needs.\n\ninb4: you should be so good you wouldn't need it :P"},{"postId":32695,"topicId":4049,"posterId":665,"postTime":1315513630,"postText":"+Support. 10 health is just wimpy. Waste of a credit."},{"postId":32700,"topicId":4049,"posterId":634,"postTime":1315515281,"postText":"Make it an NNJG shop upgrade for 1000 points."},{"postId":32702,"topicId":4049,"posterId":694,"postTime":1315515439,"postText":">> Make it an NNJG shop upgrade for 1000 points. \n\nNo..."},{"postId":32703,"topicId":4049,"posterId":798,"postTime":1315517058,"postText":"Make it 500 or 750 in shop.\nIf done then +support."},{"postId":32704,"topicId":4049,"posterId":101,"postTime":1315517467,"postText":"You guys try and put every freaking suggestion as \"Put it in the shop\"\n\nIt's useless at 10HP, to have to make it useful by having to buy upgrades for it, is stupid. Maybe upgrades AFTER a buff, but not the buff itself."},{"postId":32706,"topicId":4049,"posterId":517,"postTime":1315518148,"postText":"Suppppppppppport"},{"postId":32708,"topicId":4049,"posterId":634,"postTime":1315518695,"postText":"I don't think it's useless at the moment, but... whatever, just one more step to making the traitors invincible."},{"postId":32709,"topicId":4049,"posterId":694,"postTime":1315519023,"postText":"Have you actually won using it? because arn't most T items meant to give you an edge and not a zimmer frame..."},{"postId":32711,"topicId":4049,"posterId":364,"postTime":1315519544,"postText":">> I know not many people use it but who actually thinks the health vial should give 20 health instead of 10.\nIt just seems too low to seem like any sort of benefit so maybe remove it (and replace with a cooler item) or give it the 10 point upgrade it needs.\n\ninb4: you should be so good you wouldn't need it :P \n\nNo, it is a good item. Your not using it right.\n\nIf you bought the extra credit shop item like I did, then you get two credits... The way Helth vial works is that it increases only a bit of health. But, your not sopposed to just buy one... Hell, You can buy more then one heath vail (only one at a time) Same goes for rocketjump... not sure why???\n\nAfter an amount of time passes, tratiors will gain one credit... added, onec a lagre number of innos have been killed... They get another credit. So if you got the extra credit item from shop, you have 4 credits right there. Which is a good reason why you souldn't make 20. Because a person like me could heal up to 80 health after give or take 4min.\n\nAnd, that dosen't count your tratior buddies... because most people don't have extra credit. As a result, they tend to buy an item right away and not pay attention when extra credits are dished out to them.\n\nOnce I ended a round as tratior with 7 credits. If I found the bodies of all my downed tratior buddies, as well cheaked the bodies of dead detective., I could have had well over 7. So, the item can be VERY usefull. it just depend how you are going to play. I like to take things slow, talk for a bit before i start killing my friends. And when i get low health, I can just heal myself up to fighting ability again.\n\n-Edit-\n\nAlthought... 10 health is very low in tight spots... that why I think that there should be NO SOUND when useing health vail. Maybe a sound could be played to your charater or nere-by tratior. But I don;t think that innos should be able to hear you trying to hold onto the little bit of health you have... but thats just me."},{"postId":32712,"topicId":4049,"posterId":634,"postTime":1315519619,"postText":">> Have you actually won using it? because arn't most T items meant to give you an edge and not a zimmer frame... \nI use it quite often. Down at 7 health? Someone is going to instant kill you. 27 health with my 2 credits from bodies? I have a much better chance.\nI'm not saying that adding this is going to break the game, but the game is fairly balanced as it is and if we were going to add it I think it should be difficult to obtain. Honestly I'd rather not have it added at all.\n\nAlso, Sohi makes a good point, credit surpluses are not uncommon."},{"postId":32714,"topicId":4049,"posterId":694,"postTime":1315520198,"postText":"but not common enough other wise I wouldn't be posting this and people wouldn't be agreeing with it. I still detain the fact it shouldn't cost you 1 credit to gain a tenth of your health and also if you think it would be over powered why not limit the use to 3 per round... not that it'd happen alot."},{"postId":32729,"topicId":4049,"posterId":101,"postTime":1315529051,"postText":"Tell me, how many times do you often get 7 credits?"},{"postId":32733,"topicId":4049,"posterId":634,"postTime":1315530387,"postText":"I mean go ahead and add it I'm sure it will get used more often then. But I'm just saying that the traitors already have more than enough at their disposal to defeat the innocents."},{"postId":32739,"topicId":4049,"posterId":292,"postTime":1315535154,"postText":"IMHO buff it to 15 heal for free, OR, make it upgradable(200 per upgrade like mac10 and such) to 20 heal, 5 damage each\n\nPersonally I'd prefer just a buff to 15 health healed, would make it much, much more useful even though it seems like a small amount (You're at 10 health, 3 left over creds, wham, 55 health, as compared to 40 health from 10 health vials or 70 from 20 health vials - not too weak, not too OP)"},{"postId":32744,"topicId":4049,"posterId":735,"postTime":1315536691,"postText":"Make it 20 and useable once."},{"postId":32749,"topicId":4049,"posterId":292,"postTime":1315539863,"postText":"Thats even more underpowered than 10 and usable infinite. If you wanna make it one-use perhaps 40 health. Besides, dets have their health station, why cant traitors get their own little refill that doesnt cost 8 creds?"},{"postId":32756,"topicId":4049,"posterId":364,"postTime":1315574296,"postText":">> Tell me, how many times do you often get 7 credits? \n\nquite offten, I tend to cheak the bodies of my downed tratior bodies as well as detectives if I have a bad tratior team. I mean really, Dead tratior don;t need creadits...\n\nI'll also attempt to kill detective... they havest a lot of credits to."}]}