{"topicId":3130,"forumId":106,"topicTitle":"Aether mod","topicTime":1309246499,"topicViews":162,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"James","topicFirstPosterColor":"","topicLastPosterName":"Pirate43","topicLastPosterColor":"FF6600","topicLastPostTime":1309319842,"posts":[{"postId":24962,"topicId":3130,"posterId":636,"postTime":1309246499,"postText":"The aether mod will be coming out in july and id love to see it on the nnjg server, ive already talked about tinfoil about this but would also like feedback from kryzoid and Pirate.\n\nThe aether is the opposite of the nether, instead of hell its heaven/paradise. The aether has awesome new items and extremely hard foes to where diamond  armor and swords does barely a scratch against silverand  gold dungeon bosses, bronze im pretty sure are pretty easier XD.\n\nThis is a vid of a tester of it. His videos on terraria and minecraft i watch and found this video by him.\n\nhttp://www.youtube.com/watch?v=QOdh_fINAjU&feature=channel_video_title\n\nIts an epic world with many new minerals!"},{"postId":24963,"topicId":3130,"posterId":48,"postTime":1309247907,"postText":"So this is just something user made right? The fact that it's a mod makes it sound like it,\nalthough it would be awesome to actually have as a part of the regular game... one can only hope right?"},{"postId":24968,"topicId":3130,"posterId":243,"postTime":1309273683,"postText":">> So this is just something user made right? \nYes.\n\nSo I was following this mod for a very long time, and I'm surprised that some of you know about it as well. \nIt is a mod, but it will have a lot of stuff in it.\n (THEMINECRAFTTHREADISHERE)  \nThe Thread doesn't list all of the components to the mod (it is more of a preview of it), but describes it's progress well."},{"postId":24969,"topicId":3130,"posterId":586,"postTime":1309286577,"postText":"James, you watch P-Bat too?\n\nDamn... small internet..."},{"postId":24973,"topicId":3130,"posterId":636,"postTime":1309293485,"postText":"Also watch slyfox XD watched all theres vids and i subscribed to pbat and sly IM A HOMIE AND CHAMP XD, my minecraft skin is actually  the one slyfox uses and it says sly on the back :D"},{"postId":25002,"topicId":3130,"posterId":101,"postTime":1309318929,"postText":"I watch a few of both. Some of their videos can be boring though."},{"postId":25004,"topicId":3130,"posterId":456,"postTime":1309319842,"postText":"As soon as humanly possible, it will be on my server. I have also been tracking this mod for a while."}]}