{"topicId":4361,"forumId":126,"topicTitle":"puz_revelations (about the map and changelog)","topicTime":1317295426,"topicViews":63,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"CoreyW.Rogerson","topicLastPosterColor":"","topicLastPostTime":1317410299,"posts":[{"postId":34535,"topicId":4361,"posterId":605,"postTime":1317295426,"postText":"First and foremost, my apologies to those who played v1m1, and suffered the room with no textures. Pakrat decided to not agree with me, and didnt pack the textures in there. Also, im switching from my b1-9 map file names for the v1-9m1-9 file name. V standing for changes that alter gameplay, m standing for changes that alter appearances or other minor things.\n\nNow onto topic. \nThis puzzle starts out easy, progressing in difficulty throughout till an expert class puzzles awaits at the end. The driving force behind the map? There wasnt really one, I just built with my feelings into each area... though I did enjoy the part of the puzzle where the same puzzle was turned on its side, or upside down, and become a different puzzle from just being rotated. \nTo be blatantly honest, I made this map because I hate making houses in hammer, and i'm at a point where I have to make about 14 homes in ttt_catastrophe, so I needed a break :D.\n\nAnd some specifics;\nAmount of puzzles: around 14 that are serious puzzles. 2 that are just walk/run/fall to the end.\nDifficulty: probably around the same as puz_nekotrial in total. I guess about a 4/5, starting at a 2/5ish.\nAtmosphere: it changes quite often, 4 times in total throughout the map. Starting fairly dark, gets brighter, then resembles confused peice, then dark again.\nShortcuts: only a few very minor time savers here n there, only capable of cutting a few seconds off of some specific puzzles.\nSecrets: a total of 7, 1 of which would be nigh impossible to get to unless you knew what you were doing. 2 of which are difficult. All are images, 6 being hidden in secret rooms. And no, the \"Udane\" or \"Constructed by: Udane\" or \"NNJG\" images do not count.\n\nIf theres anything y''all approve of, or dissaprove of, feel free to praise or complain here. It'll be noted for future puzzles.\n\nChangelog from v1m1-v2m2;\nMade 3 puzzles a tad easier, by increasing the tile size of the platform you need to jump from and decreasing the size of a moving platform you had to jump up onto.\nFixed an error with a secret.\nPakratted the textures in properly this time."},{"postId":34545,"topicId":4361,"posterId":634,"postTime":1317309132,"postText":"I thinyou should keep stingray nag strawberry without textures. I like the improved difficulty and reaction of people when seeing it the first time. XD"},{"postId":34559,"topicId":4361,"posterId":605,"postTime":1317331106,"postText":">> I thinyou should keep stingray nag strawberry without textures. I like the improved difficulty and reaction of people when seeing it the first time. XD \nI liked the reaction myself, I've thought about it, but I'm certainly not going to do this on a puzzle like stingray. Filed under a, we'll see about it, section. ;p"},{"postId":34595,"topicId":4361,"posterId":612,"postTime":1317410299,"postText":"Yea. Keep those textures like they are, but make strawberry red, because ya know... It's strawberry"}]}