{"topicId":4458,"forumId":1,"topicTitle":"[15/10/2011] NNJG Game Night [DONE]","topicTime":1318188682,"topicViews":192,"topicReplies":14,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1318744643,"posts":[{"postId":35143,"topicId":4458,"posterId":82,"postTime":1318188682,"postText":"It's that time again, the second game night is upon us! I had trouble finding enough games this week, so suggestions are appreciated!\n\nThis weeks games for vote are:\n\n\n http://i.imgur.com/VjPA1.png \n  King Arthur's Gold  is a great cross of Terraria and TF2, classes, siege weaponry, building, physics-based destruction and much more. There is also some strategic elements that encourage teamwork! It was my favorite game from last weeks voting and deserves a second chance.\nOfficial Website  \nGameplay  \n\n http://i.imgur.com/joZeA.png \n  Celestial Impact  is an amazing, classic fast-paced shooter, with a twist. You are on a asteroid hurdling through space, and you have a gun that can completely manipulate your environment. Pretty great game!\nOfficial Website  \nGameplay   (outdated, game is a lot better than this video makes it look)\n\n http://i.imgur.com/A8Kfe.png \n  Action Half-Life 2  is an over-the-top shooter based on the over-the-top 70's and 80's movies. Listen to Tank by The Seatbelts when you play this and you will complete the experience, also it has diving, dual pistols and sweet 'staches.\nOfficial Website  \nGameplay  \n\nSuggest games if you don't see anything you won't like playing, it's hard finding free multiplayer games that aren't shooters, maybe next week I might add games that cost money such as Magicka, also if you are reading this, this game night may have a surprise!"},{"postId":35144,"topicId":4458,"posterId":634,"postTime":1318190174,"postText":"Let's do Dom a favor and vote for King Arthur's gold. Shall we?\nnot to mention that it looks quite fun."},{"postId":35145,"topicId":4458,"posterId":115,"postTime":1318190245,"postText":"Ace of spades"},{"postId":35146,"topicId":4458,"posterId":82,"postTime":1318190581,"postText":">> Ace of spades \nWe need to let other games get a chance, might be on next game night."},{"postId":35148,"topicId":4458,"posterId":517,"postTime":1318191390,"postText":"Celestial impact sound kewl"},{"postId":35153,"topicId":4458,"posterId":1094,"postTime":1318193518,"postText":"The King Arthur's Gold one sounds pretty good, although I wanted the Action Half-Life 2 trailer and the kung-fu and diving seems ridiculous yet awesome, so I wouldn't mind that at all either."},{"postId":35163,"topicId":4458,"posterId":735,"postTime":1318206314,"postText":">> Ace of spades \nYes.\nBut, I suggest Moonbase alpha"},{"postId":35275,"topicId":4458,"posterId":82,"postTime":1318393116,"postText":"Thanks for suggestions, I have 1 (maybe 2 if I decide to add TF2 to voting of the games next game night) however I am considering not doing it, being so close to Halloween and all, would most of you still be available on the 29th?\n\nAnd if to whoever made the group, please change the picture to \n http://i.imgur.com/3sR7x.png \n\nAnd for Halloween\n http://i.imgur.com/j18Cn.png "},{"postId":35350,"topicId":4458,"posterId":754,"postTime":1318515881,"postText":">> Thanks for suggestions, I have 1 (maybe 2 if I decide to add TF2 to voting of the games next game night) however I am considering not doing it, being so close to Halloween and all, would most of you still be available on the 29th?\n \nI would still be able to do it on the 29th. I won't be doing anything on the 30th anyway."},{"postId":35430,"topicId":4458,"posterId":82,"postTime":1318651313,"postText":" http://i.imgur.com/A8Kfe.png \n Will be played October 15th 2011 at 7:00pm PST \nIt can be downloaded here \n\nSURPRISE! Max Payne Bundle will be given to the player with the highest total score, I will take a screenshot at the end of each round, the highest scorer will receive Max Payne 1&2 "},{"postId":35471,"topicId":4458,"posterId":82,"postTime":1318737094,"postText":"This game night had about 50% of the players, evidently it was because it was a larger download and on shorter notice. Next week I will try to strike a balance. Smaller download games, and I won't forget to update everything a day before it starts. NinjaBreadman has received his prize.  Also instead of manually tracking player scores, I will distribute a private steamgifts giveaway during the game night so everyone has a equal chance of winning :D\n\nThank you for playing/ hope to see you there next time!"},{"postId":35474,"topicId":4458,"posterId":812,"postTime":1318741658,"postText":"I wish I could have stayed longer, but my damn computer gave me like 15-20 FPS throughout, which wasn't that enjoyable. But thanks again Domineeto, I'm sure all the people who attended enjoyed :D!"},{"postId":35475,"topicId":4458,"posterId":735,"postTime":1318742585,"postText":"Well shit, looks like I missed it. Six flags and the FUCKING KICK-ASS TEXAS RANGERS took video games'' place for the day."},{"postId":35477,"topicId":4458,"posterId":292,"postTime":1318743070,"postText":"Goddamn it, I've missed both game nights because my family bowling nights are at this same exact time, every Saturday.\n\nIt's funny because we started these bowling nights on the day of the first game night, :x"},{"postId":35478,"topicId":4458,"posterId":373,"postTime":1318744643,"postText":"I missed it because my computer had a BSoD :<"}]}