{"topicId":3713,"forumId":104,"topicTitle":"Spotify","topicTime":1313886860,"topicViews":73,"topicReplies":4,"topicStatus":0,"topicFirstPosterName":"cappiman","topicFirstPosterColor":"","topicLastPosterName":"cappiman","topicLastPosterColor":"","topicLastPostTime":1314047541,"posts":[{"postId":30122,"topicId":3713,"posterId":754,"postTime":1313886860,"postText":"Yes we all have heard it a 100% legal version of Limewire/Frostwire. Spotify in general is where you can listen to over 15 million+ songs over the internet, anything from System of a Down to Deer Hunter, Metal to Classical music. With Spotify you can have up to three different plans a $10/month program to listen to music with out a(n) ad underneath the track list/ playlist and you can listen to on a android or iPhone/iPod Touch. for 5$ you will stream with no ads but minus the feature in the $10/month. With the free program (which is currently in beta testing as of the post date) you have to deal with ads and no streaming feature on your android or iOS enabled phone (windows users sorry but your S.O.L.). Spotify maybe the next generation of streaming music? maybe. My rating is a four out of five. Due to some songs that I wanted to listen to were not in the library and some of the songs could not stream right.\n\nside notes:\nAs of post date spotify is invite only and cannot be joined unless you pay for a premium service (or I invite some one from NNJG hint hint). So unless you want to pay either the $5 or $10 price you must join by obtaining an invite."},{"postId":30123,"topicId":3713,"posterId":812,"postTime":1313887337,"postText":"Can you download the actual music?"},{"postId":30163,"topicId":3713,"posterId":754,"postTime":1313899258,"postText":">> Can you download the actual music? \nNo it is something like Rhapsody."},{"postId":30168,"topicId":3713,"posterId":735,"postTime":1313901791,"postText":"Just use grooveshark."},{"postId":30451,"topicId":3713,"posterId":754,"postTime":1314047541,"postText":">> Just use grooveshark. \nI actually have used grooveshark, and I personally think that their library is too small."}]}