{"topicId":1650,"forumId":122,"topicTitle":"VIP abuse","topicTime":1295180190,"topicViews":85,"topicReplies":13,"topicStatus":1,"topicFirstPosterName":"ra2z","topicFirstPosterColor":"","topicLastPosterName":"Bird Flu","topicLastPosterColor":"000099","topicLastPostTime":1295193626,"posts":[{"postId":14306,"topicId":1650,"posterId":474,"postTime":1295180190,"postText":"just joined and i was in a the armory as a guard a VIP tells me to come out or i will be slayed then he slayed everyone on the server, he slaped me with 200000+ dmg then he kicks me name is [nnjg] turtle hitman"},{"postId":14307,"topicId":1650,"posterId":438,"postTime":1295180759,"postText":"Ra2z, please do not lie about me abusing. I slayed you and the other guards for a reason.\n\nFirst, you and the other guards were camping in the armory doing literally nothing, (Just standing there not giving commands)\nSecondly, you were talking junk and spamming the chatbox.\nAnd thirdly, I only slapped you and an other guard. But I had a reason for that slap.\n\nI understand you guarding the armory, but just giving no commands is just wrong."},{"postId":14308,"topicId":1650,"posterId":474,"postTime":1295180835,"postText":"1 no i wasent camping the armory i was guarding it 2 i wasent spamming the chat and plz dont get the whole god damn server to lie about 3 no you slayed the whole server and me"},{"postId":14309,"topicId":1650,"posterId":438,"postTime":1295181352,"postText":">> i was guarding it 2  \n\nI know you guarded it, but not giving commands, that's gone too far.\n\n>>  i wasent spamming the chat  \n\nUrm, you were, and you were pretty much raging ALOT.\n\n>>  plz dont get the whole god damn server to lie   \n\nHow can I make the whole server lie? They were witnesses that knew that I wasn't abusing.\n\n\n>>  no you slayed the whole server and me \n\nIncorrect, I only slayed you and the other guard that were camping. I did slay the whole server at one point because people wanted to restart the round."},{"postId":14310,"topicId":1650,"posterId":438,"postTime":1295181745,"postText":"Dont worry we are friends now :)"},{"postId":14311,"topicId":1650,"posterId":474,"postTime":1295181822,"postText":"im not friends with this ass whole yes i was guarding the armory when another guard was giving orders and no i wasent spamming chat as i said last time and you mass slayed the whole server for 1 guard being in a armory and stop asking me to remove post and stop posting more"},{"postId":14312,"topicId":1650,"posterId":438,"postTime":1295182205,"postText":"God, your an idiot. I only slayed you. I never mass slayed the server. I never told you to stop posting, and right now, your just standing there."},{"postId":14313,"topicId":1650,"posterId":474,"postTime":1295182335,"postText":"yes you did slay me and another guard yes you did do a mass slay for only me being in armory yes you said to remove my post and we will be friends and yes i was standing still because im posting on fourms and he tryed to kick me for being annoying and for being afk"},{"postId":14314,"topicId":1650,"posterId":438,"postTime":1295182517,"postText":"You need proof, y''know. I didn't do a mass slay. Never did. And I only thought you were afk because you were standing there doing shit. Now, stfu.\n\nPS: There is a thread saying for 100% proof you need to record it."},{"postId":14315,"topicId":1650,"posterId":474,"postTime":1295182568,"postText":"i still agree with last post and can you stop spamming on my post saying the same stuff both of us will be banned"},{"postId":14317,"topicId":1650,"posterId":438,"postTime":1295183633,"postText":"Lolwut. How am I spamming on your post. I'm just stating the truth."},{"postId":14319,"topicId":1650,"posterId":474,"postTime":1295183981,"postText":"6 post + 6 for me yes that is spamming"},{"postId":14321,"topicId":1650,"posterId":142,"postTime":1295190885,"postText":"Okay enough, that isn't a correct format and unless you have proof in form of video or screen-shots then there's nothing we can do. Next time, go here http://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=15&t=6"},{"postId":14322,"topicId":1650,"posterId":3,"postTime":1295193626,"postText":"And type like a human being."}]}