{"topicId":135,"forumId":22,"topicTitle":"Tracking Device","topicTime":1274142309,"topicViews":109,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Mochilla X","topicFirstPosterColor":"","topicLastPosterName":"No Refunds","topicLastPosterColor":"","topicLastPostTime":1274234605,"posts":[{"postId":1222,"topicId":135,"posterId":11,"postTime":1274142309,"postText":"How about some sort of tracking thing that when you shoot at someone, you can see where they are live for a limited time and/or a limited distance. It should have limited ammo too like 3 shots or something. Also the detective can have like a bug destroying or something that lets them destroy all tracking equipment on people within the vicinity. Oh yeah, there should be some very subtle way that people can know if there being tracked. Maybe a small flashing light where the person was shot that others can see?"},{"postId":1224,"topicId":135,"posterId":12,"postTime":1274146743,"postText":"Hmm I don't know. I have mixed feelings about this one. Don't traitors and detectives have radars? It is that just detective"},{"postId":1227,"topicId":135,"posterId":11,"postTime":1274147137,"postText":"Maybe this should prevent having a radar. I was thinking like 30-45 second live tracking too, not like 3 minutes or something ridiculously cheap. Plus its not reusable."},{"postId":1238,"topicId":135,"posterId":12,"postTime":1274148905,"postText":"So you're saying it's more like the scramblers perk from mw2 but not permanent?"},{"postId":1247,"topicId":135,"posterId":4,"postTime":1274151076,"postText":"i think the radar should stay, but a new weapon should appear in which when you shoot somewhere, anyone within like a 2 meter radius of the shot gets frozen for 3 seconds"},{"postId":1250,"topicId":135,"posterId":11,"postTime":1274153921,"postText":"Not really like scrambler. More like this. http://bit.ly/b0YotX\nThats where I got the original idea from. It should allow close-range, temporary,\nlive tracking. The tracker should lose effect after a certain distance from the traitor\nwho shot them. Also, the dart should be really obvious to someone else who sees said dart.\nThats my whole idea in a nutshell.\n\nAlso Kryzoid, epic idea. Would be tight if the gun freezes and kills someone, their corpse stays suspended in that position like frozen solid or something. Lol"},{"postId":1284,"topicId":135,"posterId":12,"postTime":1274234605,"postText":"Ooo I have used that gun way back when I played bc1. Now I understand what your getting at :D"}]}