{"topicId":1897,"forumId":1,"topicTitle":"Dear NNJG ,","topicTime":1297627600,"topicViews":352,"topicReplies":18,"topicStatus":1,"topicFirstPosterName":"Ghostofyou","topicFirstPosterColor":"","topicLastPosterName":"Kobooold","topicLastPosterColor":"","topicLastPostTime":1297660527,"posts":[{"postId":15818,"topicId":1897,"posterId":525,"postTime":1297627600,"postText":"As you maybe well informed, NNJG's forums were attacked around 9:00pm (GMT -7). The nature of this attack was unknown, and purely fictionalized by such clan's members. Before you take what I say, please read on.\n\n http://img690.imageshack.us/img690/8568/60018184.png \n\nUser(s) that will stay un-named (One or the only user is said to be MaK_-), engaged in a deletion attack - deleting what they could from two different IP addresses (obviously via a proxy). Sadly him/they deleted about roughly half of the forums and put most of it back to September 2010. Here were the two security flaws used to my knowledge:\n\n- Mak had been given moderator status on the forums. This was a flaw in thinking on someone's part.\n\n- Backups do not exist - as far as I know. So they are sadly stuck at that period of time.\n\n\nTwo people \"Farrow\" and \"Dum\", are the main leaders in though who dealed with the problem. Let me remind you what they said and where they stand.\n\n http://img833.imageshack.us/img833/7727/84613705.png \n\nA fellow member back in the day, and most remembered - he banned 3 people in one sitting based off a rule that was created on the spot. He now stands as an administrator. After his mistake he unbanned them. Lol mistake? You don't just go do that. ><\n\n http://img829.imageshack.us/img829/2448/41303959.png \n\nWhere to start? \"Dum\" hired me (somewhat) to work on his server that really didn't go any where. Blamed me for delaying work progress even though he knew I liked to just play sometimes (I did the assigned work and tinkered with the game-mode). Sad to say most times it seemed that he had some angry tone to him, very much like gash.\n\nNow in his comment, he said someone \"overreacted\". I don't know who this was pointed to but really hope it's to gash since I didn't (at least I hope I didn't). Here's how this whole thing started (sorry for the long story, but to get to the bottom of it)....\n\nI recently got a Garry's Mod server for my birthday (and I thought that was a nice gift). Instead of making it fly unrelated to \"NNJG\" I said hey I'll make it \"NNJG\". I might of used the word donate, but it wasn't clear on what it really meant (they had no donation policy or anything of the likes). I went along with the standard things, put the clan tag on it and such. Gash said make ben and him owner, ok it wasn't to bad since they seemed nice at the time. Then after trying to make a \"Modern Warfare 2\" game mode that didn't seem to work I though I'd make it TTT since it's popular and mostly everyone knows how to use it. Gash said no you can't do that (ben wasn't present) and so I had to go with his word since he was \"co-owner\". We got into a long argument about this and spanned several days (2 or 3). In the mean time I removed his FTP access (which again he told me to give to him) and administration access. All I wanted was for him to tell me what he was doing and give me a rough list of what files changed. Gash said that was un-reasonable and then the argument continued till he said give my access back or \"I will perma ban you from all **** servers\". This got my attention and I started to think. I didn't want this to happen so I used gash's other option, leave. Now this came with another argument and gash said leave. I wanted ben to counter sign (a.k.a approve) this decision of me and my server moving but very ben like, wasn't back till 3 days later and gash wanted to do things now (ben later said \"he is not authorized to make such decisions\"). A fellow friend that will remain name less advised me to leave and just get out. I did, and haven't felt happier since. Things make sense and people seem happy.\n\nReally, think about it. I was paying for the server, It was mine and I owned it. There was no plan to give my any vip money and I was still forced to add them even though I got nothing. As you see on the server donation policy post - you don't have to give up your rights to the server nor give anyone ftp or administrative access (and never be forced to be with us, nor be forced to do anything except add the clan tag to it). This is where it came from, this story and true event. If your thinking \"dark is stupid and still over reacted\" think. When you play on a server you go by their rules, not ones you make. Your a guest. I laid down the somewhat agreement later on and it was gash that was not flexible and acted like he owned the place.\n \n\nMy intention Isn't to Offend anyone or people to answer by flaming or raging posting. Please reply seriously , thank you. \n\n I will not be responding to NNJG members trying to sort this out or discuss the deletion attack. (well most of the time, Mark just talked to me yesterday). \n \nThank you for your attention. \n \nA deal have been made yesterday with Mr Gash yesterday with Mark ~ Crazy Monkey \n \nI like colours ~ DarK "},{"postId":15819,"topicId":1897,"posterId":101,"postTime":1297628026,"postText":"You got down 3 lines of code. 2 of which didn't even work. How is that not lazy?\n\nReally, how come almost all of our former members came right at the same time to check back and post on the same topic? Like your clan didn't plan this at all? What's your post even try to say? You didn't do shit with the server, it was 90% gash. Seriously, if you don't like our demands, dont do it. We tell you right there, so gtfo, seriously.\n\nEDIT: And how are me and pharaoh responsible for this? I deleted like 3 posts of your clan members for advertising, and gave some people the story on why you guys, unprovoked, attacked us."},{"postId":15821,"topicId":1897,"posterId":525,"postTime":1297629737,"postText":">> You got down 3 lines of code. 2 of which didn't even work. How is that not lazy?\n\nReally, how come almost all of our former members came right at the same time to check back and post on the same topic? Like your clan didn't plan this at all? What's your post even try to say? You didn't do shit with the server, it was 90% gash. Seriously, if you don't like our demands, dont do it. We tell you right there, so gtfo, seriously.\n\nEDIT: And how are me and pharaoh responsible for this? I deleted like 3 posts of your clan members for advertising, and gave some people the story on why you guys, unprovoked, attacked us. \n\n\nHey dum it's dark here! :D\n\nThat post was over at the \"other place\". Mak kindly lent this account to me for a bit just to post this...\n\n\n\n Really, how come almost all of our former members came right at the same time to check back and post on the same topic? Like your clan didn't plan this at all? \n\nWth are you trying to say? lol there's 23 words without a single hint of punctuation.... You Americans lol jk :P\n\nPlanning? Lol this deletion attack... Legit answer is no I didn't nor did my clan. It's like criminal charge of \"man slaughter\".\n\nNext time: context, context and context. It took me a while to figure out what it meant, I still don't get what same topic....\n\n\n What's your post even try to say? \n\n\"Let's get this straight….\" over on the other one. Mak didn't put the title in >< but who cares.\n\nIt was meant to get the facts right, not some BS someone said and wasn't there when gash and I talked (mainly argued).\n\n\n Seriously, if you don't like our demands, dont do it. \n\nYour talking in present tense, this was way back when... And you forgot a apostrophe in \"dont\".\n\n\n And how are me and pharaoh responsible for this? \nFarrow isn't, you aren't so much...\n\nSeems the message limit was there or some trollface.png came...\n\"If you have problems with S3G or with any of it's operations, members, dealings or servers go talk to gash. \" was in the other version... :)\n\n\n ~ Dark you true br0 slice of cake (and yes that portal cake was a lie). "},{"postId":15822,"topicId":1897,"posterId":82,"postTime":1297630560,"postText":"I cannot help but to feel responsible for this in many ways ;-;"},{"postId":15823,"topicId":1897,"posterId":464,"postTime":1297631338,"postText":"I think it's hilarious that you're making fun of other people's spelling and grammar.\n\n>> \"man slaughter\" \nThis is one word, and the quotation marks should be single.\n\n>> What's your post even try to say? \nLearn your tenses before making fun of others''.\n\n>> Your talking in present tense, this was way back when... And you forgot a apostrophe in \"dont\". \nYour is possessive. You meant you're.\n\n>> And you forgot a apostrophe in \"dont\". \nUse ''an,'' not ''a.''\n\n>> lol there's 23 words without a single hint of punctuation.... You Americans lol jk  \nHis sentence was entirely grammatically correct. Run-on sentences are measured by added subjects or actions, not word count.\nThis sentence isn't even grammatically correct. 'Lol'' should have been capitalized, as it is here, and ellipses should only be used for stylization.\n\n>> Next time: context, context and context. \nSentences usually have verbs.\n\n>> It took me a while to figure out what it meant, I still don't get what same topic.... \nThough I think I understand the meaning of this sentence, your grammar is horrid.\nA proper restatement would have been \"It took me a while to figure out what your meaning was, and I still don't get what the \"same topic\" could have been.\nFurthermore, ellipses do not mean that a new sentence has started. As such, don't capitalize after them."},{"postId":15824,"topicId":1897,"posterId":525,"postTime":1297631699,"postText":"Mak : \n\nOk , stop correcting each other lol"},{"postId":15826,"topicId":1897,"posterId":534,"postTime":1297632121,"postText":"And people on here wonder why others leave NNJG"},{"postId":15827,"topicId":1897,"posterId":112,"postTime":1297632972,"postText":">> And people on here wonder why others leave NNJG \n\nThanks for your insight. You said you were leaving. When are you actually leaving?"},{"postId":15828,"topicId":1897,"posterId":534,"postTime":1297633351,"postText":">> >> And people on here wonder why others leave NNJG \n\nThanks for your insight. You said you were leaving. When are you actually leaving? \n\nWhere do you have a record of me saying that?"},{"postId":15829,"topicId":1897,"posterId":112,"postTime":1297633539,"postText":">> >> >> And people on here wonder why others leave NNJG \n\nThanks for your insight. You said you were leaving. When are you actually leaving? \n\nWhere do you have a record of me saying that? \n\nI don't anymore, somehow is disapeared. Derp."},{"postId":15830,"topicId":1897,"posterId":525,"postTime":1297634808,"postText":"This was only to give some information out and the old conflict etc Not to start a Grammar war and flaming ...\n\nAnd a deal have been made , didn't i already said it ? .."},{"postId":15831,"topicId":1897,"posterId":101,"postTime":1297638589,"postText":"No you did not, you type in the most difficult way to understand.\n\nAnd all in the same topic, you, link, and somebody else (forgot) posted."},{"postId":15832,"topicId":1897,"posterId":3,"postTime":1297638723,"postText":"Mind you tell us what the deal is?"},{"postId":15833,"topicId":1897,"posterId":525,"postTime":1297638832,"postText":">> \n \nA deal have been made yesterday with Mr Gash and Mark ~ Crazy Monkey was present , you can even ask [NNJG]Ben about it or Mr. Gash. \n \n\n~ Mr. M"},{"postId":15834,"topicId":1897,"posterId":464,"postTime":1297643487,"postText":"Infinite lulz are to be had at ''proxy'' in the search bar in the screencap."},{"postId":15835,"topicId":1897,"posterId":525,"postTime":1297643857,"postText":"Mr. M : LOLOL Mr.D Failed at screenshot."},{"postId":15836,"topicId":1897,"posterId":101,"postTime":1297644813,"postText":">> Infinite lulz are to be had at ''proxy'' in the search bar in the screencap. \n\nWhich proves you went on the forums to specifically attack us."},{"postId":15838,"topicId":1897,"posterId":525,"postTime":1297644961,"postText":"No , it prove that he was IPBanned at this time. ~ Mr. M"},{"postId":15856,"topicId":1897,"posterId":272,"postTime":1297660527,"postText":"Once again, we don't need to fight about this. What's done is done, etc, etc.\nLocked."}]}