{"topicId":2187,"forumId":3,"topicTitle":"Bounties?","topicTime":1300845426,"topicViews":153,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"BoomShaka","topicFirstPosterColor":"","topicLastPosterName":"BoomShaka","topicLastPosterColor":"","topicLastPostTime":1301430249,"posts":[{"postId":17684,"topicId":2187,"posterId":142,"postTime":1300845426,"postText":"I think we should have a bounty kind of thing, it updates to a new person each week. The person would need 5 kills of the bounty, proof of it by video or screenshots. Whoever gets the bounty done first wins a certain amount of points (I'll provide some of the points each week) If no one gets the bounty done by the end of the week then no one gets the points and it moves on. Maybe change it up from time to time, like deagle only on this bounty, headshots only and so forth. Hoping this works and people get a kick out of it aside from points. Of course It would have to be by the rules."},{"postId":17694,"topicId":2187,"posterId":377,"postTime":1300850607,"postText":"$10.00 to whoever can kill Gash with a Jihad Midair :D"},{"postId":17695,"topicId":2187,"posterId":2,"postTime":1300850852,"postText":">> $10.00 to whoever can kill Gash with a Jihad Midair :D \nBut I've done that before\n\nDo I get the money now?"},{"postId":17697,"topicId":2187,"posterId":389,"postTime":1300852809,"postText":"Well If you guys really gonna do this. We'll need a subsection, and ill help provide some points."},{"postId":17724,"topicId":2187,"posterId":112,"postTime":1300904239,"postText":"We kind of did something like this for the contest where dum got a colored name xD\n\n\nIt would probally be pretty good, but people will kill the person with minimal proof in hopes of getting the prize, so just watch for that.\n\nBut I think it would be fun to have contests with specific weapons/headshots or whatever.\n\nI'll donate some points once I'm done pretending to pay boomshaka back. <3\n\nMaybe more than 5 kills though? That much can be achieved in one session of play time and it becomes more of a \"Whos on when it starts\" than anything else."},{"postId":17743,"topicId":2187,"posterId":4,"postTime":1300920744,"postText":">> We kind of did something like this for the contest where dum got a colored name xD \nI think that was the contest i made in which someone had to kill me (no-rdms) and provide 5 screenshots of legit kills from the end-of-round logs."},{"postId":17755,"topicId":2187,"posterId":101,"postTime":1300931845,"postText":"Thanks for reminding me that Failrow, Gash has promised me a color name on 2 different occasions."},{"postId":17762,"topicId":2187,"posterId":389,"postTime":1300934646,"postText":">> Thanks for reminding me that Failrow, Gash has promised me a color name on 2 different occasions. \n\n^\n\nApart from this, can we change the color name of Mods to the blue from Puzzle Mod. The current light blue/teal colour is ugly."},{"postId":18057,"topicId":2187,"posterId":112,"postTime":1301397998,"postText":">> >> Thanks for reminding me that Failrow, Gash has promised me a color name on 2 different occasions. \n\n^\n\nApart from this, can we change the color name of Mods to the blue from Puzzle Mod. The current light blue/teal colour is ugly. \n\nnou flame. That's my favorite color out of all of them.\nSo are we doing this?"},{"postId":18065,"topicId":2187,"posterId":389,"postTime":1301406744,"postText":"Well I'm bored. Soooo...\n\nI think the first event thing should be\nProvide 1 screenshot of each following events. (Must have all 5 screenshots) - 200 points (I'll pay 200 points. If anyone wanna add on then go ahead)\nAs Innocent kill 1 traitor without killing any innocents\nAs Innocent kill 2 traitor without killing any innocents\nAs Innocent kill 3 traitor without killing any innocents\nAs Innocent kill 4 traitor without killing any innocents\nAs Innocent kill 5 traitor without killing any innocents"},{"postId":18068,"topicId":2187,"posterId":142,"postTime":1301430249,"postText":"It's not really an event type thing, it's more of a daily thing, I'll set it up with a sticky soon, the thing goes on every 2 weeks (So I can get the points and then more, over and over.) I'm thinking about setting it up as first one to get a certain set of kills (saaay 8 kills if not more) on a person, abiding by rules, and screenshot/recording it. If it comes down to it or you wanna help with points then message me over steam. Other than that, I'll start the bounty up next week and keep it moving unless people aren't interested then I will drop it. Anyway, if you have an idea/rule for this then message me over steam or post it here and maybe I'll add it. Oh and I'll set up the sticky either this Friday or Saturday and it starts on sunday."}]}