{"topicId":3037,"forumId":1,"topicTitle":"update y0","topicTime":1308241830,"topicViews":86,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1308268946,"posts":[{"postId":24171,"topicId":3037,"posterId":54,"postTime":1308241830,"postText":"so, most of you know that, i'm inactive as fuck. i'm just gonna fill the ones of you who DON'T know why i'm inactive. kso, here I go\n\nIf you couldn't tell before, I had like 100 hours+ at all times from Garry's mod. I had no life, no friends much either tbh, I only really hung out with Cake, and all we did there, was play Garry's mod. I also had Bobby and Micheal, but I went over there to smoke. Because smoking for me, was an escape from reality, it took away all my pain, all the stress, everything that went wrong with me. \n\nSo, now I have a lot of friends, I have tons of people who care about me and what not. I've been really busy so far this summer. I've been being HAPPY for the first time ever. I haven't ever really been happy till I met this girl Leslie, she's my best frand. I can talk to her about anything, I can talk to her for hours and love every single moment i'm there. I've been with her 95% of my summer so far. (summer started on May 27th) \n\nI also have summer school. No, I didn't fail or any shit like that. I'm getting an extra credit for high school. I'm in 8th grade (going to 9th next year). so I'm gonna have 2 credits going into high school. I have that for 2 hours everyday, 10am-12 noon. We usually get out at like 11 though because it's quite easy. And after that, I hang out near the school till 2:30 until Leslie gets out, then we go chill at the mall, downtown, movies, something like that. It's different everyday. \n\nI also have been hanging with other friends, I've been trying to earn some extra cash, I've been writing, I've been tagging, i'm a busy person. I don't want to lose my job here at NNJG, because I lav NNJG. I've been here since the beginning, I wouldn't want to get kicked out because I'm trying to have a life. So, I just wanted to fill you all in on why i'm so damn inactive. \n\nIf you tl;dr this, you're lazy."},{"postId":24173,"topicId":3037,"posterId":115,"postTime":1308248058,"postText":"Who needs to smoke when you have pills dude.\n\nAnyways, although I'm not one to say anything, but thanks for the update. :)"},{"postId":24196,"topicId":3037,"posterId":605,"postTime":1308258389,"postText":">> If you tl;dr this, you're lazy. \nOr don't care about another man's happyness.\n\nOn topic, I'm glad your enjoying yourself, and I wish your friendships grow even stronger, both with the ones you did not mention and Leslie.\nLife>Game, so do what you what have to enjoy life."},{"postId":24200,"topicId":3037,"posterId":705,"postTime":1308258714,"postText":">> Who needs to smoke when you have pills dude.. :) \n\nLol i used to say that until i ran out of hydrocodone and had massive withdraws...not fun"},{"postId":24206,"topicId":3037,"posterId":4,"postTime":1308260987,"postText":"Cmon, Mark. You've told us this so many times. We appreciate you and nobody's going to take your position :D"},{"postId":24214,"topicId":3037,"posterId":54,"postTime":1308268946,"postText":">> Who needs to smoke when you have pills dude.\n\nAnyways, although I'm not one to say anything, but thanks for the update. :)  I don't smoke anymore, I don't need an escape.\n\n@udane - thanks:D\n\n@kry - I like to just make sure that I don't lose my position, and update so everyone knows i'm not like \"hur f nnjg\" and just don't get on at all."}]}