{"topicId":1901,"forumId":97,"topicTitle":"Dubstep","topicTime":1297655433,"topicViews":109,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"TinfoilHatter","topicFirstPosterColor":"FF6600","topicLastPosterName":"TinfoilHatter","topicLastPosterColor":"FF6600","topicLastPostTime":1297742746,"posts":[{"postId":15852,"topicId":1901,"posterId":464,"postTime":1297655433,"postText":"Anyone like it, here?\nSeems like I'm the only one, sometimes.\nNot a huge niche of music, really. \n\nFor those of you not in the know, it's very bassy music, borrowing from reggae, industrial, and hardstyle.\nTechno at its finest.\n\nDiscovered Feed Me recently. Filthiest stuff I've heard in a while. He and Skrillex just signed on to Deadmau5's label, to boot.\nFeed Me- Blood Red:  http://www.youtube.com/watch?v=G6GIdGhxyHw "},{"postId":15854,"topicId":1901,"posterId":2,"postTime":1297658063,"postText":"Dubstep is epic.\n\nEdit:\n>> borrowing from reggae \n\nI have to put this here. "},{"postId":15890,"topicId":1901,"posterId":4,"postTime":1297730547,"postText":"I really like dubstep too, but enjoy some    drum & bass     as well (though that song i just linked to is the only decent drum&bass i've heard in a while, unfortunately it becomes utter shit at about :42 seconds.)\n\nThe song link you provided is amazing btw :D!!!"},{"postId":15894,"topicId":1901,"posterId":464,"postTime":1297732694,"postText":"Yeah, a lot of the UKF, dubstep or DnB, is getting a bit stale.\n\nI'm considering making my own dubstep soon, 'cause I just TOTALLY LEGALLY OBTAINED a copy of FL Studio 9 and XP.\nIt's not terribly hard, and I've got an assload of sampling material already.\n\n>> Dubstep is epic.\n\nEdit:\n>> borrowing from reggae \n\nI have to put this here.  \n\nBefore clicking it, I KNEW it was going to be that Voltaire song.\nYou, good sir, have excellent taste. :D"},{"postId":15900,"topicId":1901,"posterId":456,"postTime":1297735224,"postText":"I have mixed feelings about dubstep. \nOne question though, it's bothered me for a while. Why do ppl refer to the songs as \"dirty\" or \"filthy\" when they like it?\nto quote the second highest rated comment in Tin's video link: \"that drop is dirtier then a﻿ necrophiliac pedophile with stage 3 syphilis\"\n\nI feel like an old person asking this."},{"postId":15923,"topicId":1901,"posterId":464,"postTime":1297742746,"postText":"Dirtiness or filthiness is the amount of industrial or mechanical sounds that fill the song.\nThe distortion and other things fit the style. It's what makes the song dubstep.\nSongs that are \"clean,\" or without distortion and sound effects, but in the same BPM range and bass-heavy, are simply Dub or DnB.\n\nPersonally, I don't get the \"dirtier than XXXXX fucking YYYYYY with ZZZZZZZ object\" comments, but the music's good, so I can't complain."}]}