{"topicId":2062,"forumId":122,"topicTitle":"LuigiKonaMiku Ban Request","topicTime":1299401606,"topicViews":221,"topicReplies":4,"topicStatus":1,"topicFirstPosterName":"LuigiKonaMiku","topicFirstPosterColor":"","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1299432353,"posts":[{"postId":16814,"topicId":2062,"posterId":313,"postTime":1299401606,"postText":"Offender name?: ŁυιgιҚøиλМιҚυ :3\nWhich Server?: Every Server\nOffender's Steam ID?: STEAM_0:1:26221877\nWhat the Offender did?: nothing - i get mad because mark its a fucking useless stupid admin :D\nAdmins on?: IDC\nProof?: im luigikonamiku and i want to get banned :D\nAlso: Perma Ban <- he want to"},{"postId":16816,"topicId":2062,"posterId":423,"postTime":1299404270,"postText":"your logo is cute"},{"postId":16817,"topicId":2062,"posterId":313,"postTime":1299404328,"postText":">> your logo is cute \n\nty <3"},{"postId":16819,"topicId":2062,"posterId":373,"postTime":1299431672,"postText":"Denied.  Locked."},{"postId":16822,"topicId":2062,"posterId":54,"postTime":1299432353,"postText":"Well, since you were on last night rdming and flaming just to be banned, sure why not.\n\nWhen bans are fixed, you'll have your wish. Accepted.\n\nOh and Luigi, you realize that I do my job, I do what I have to do. You telling another mod to slay someone is bad, even if you didn't do it, it's still your doing. You told him to do it. You think it's just like random accusing, if you didn't slay him, it's not your fault. It is. You told Kob to slay him, he did. The kid did nothing, he killed someone for a legit reason.\n\nI don't see why you're overreacting over something so little. Admins can open to this say what they have to say, but Viral was on last night and Luigi WAS rdming and flaming just to be banned. So he will be banned when the ban glitch is fixed.\n\nEdit: ๖Viral: I will say, one of the rdms, was a kid, not Eric, but a kid who joined, he talked for a second, Luigi killed him and said \"stfu kid\"\n๖Viral: \"stfu kid\" wasnt his exact words, but it was close."}]}