{"topicId":2769,"forumId":105,"topicTitle":"Grand Hotel Business","topicTime":1305784238,"topicViews":225,"topicReplies":0,"topicStatus":1,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1305784238,"posts":[{"postId":22262,"topicId":2769,"posterId":4,"postTime":1305784238,"postText":" Now that the Grand Hotel is officially open, i'm going to be using this thread to list the current hotel residents, when their next payment is due, hotel information, and perhaps other cool stuff in the future. \n\n    Wall of Information:   \nWelcome to Central City's Grand Hotel, your six-star quality home. This hotel complex features a pool on our roof and an ice-skating rink underground. There are a total of 8 regular rooms in this hotel. With the exception of the penthouse, each room occupies half of it's floor, and features a large window on one wall either partial view of CC or the surrounding landscape. Plus, each room comes with it's own grief-protection and multi-function door lock. This means that you will have the power to edit the interior of your room, and choose who can or can't enter. Full security and customization power at your fingertips.\n\nEach regular room costs an initial fee of 9 gold ingots, followed by a monthly charge of 3 gold ingots (after your first month). In the event that guests are unable to fulfill the monthly charge, they will be notified and given a 3-day \"grace period\" to pay the fee or relinquish ownership of their room. If guests still haven't relinquished ownership of their room or payed the monthly fee after this period, they will be evicted from their room, while any belongings found inside will be confiscated and incinerated by hotel staff. The Penthouse's specifications completely differ from regular rooms. Rates must be negotiated with a manager.\n\nThis is your chance to go above the norm and live in an elegant hotel room, inside Goldcraft's official city and main landmark, with direct access to our commerce plaza, spawnpoint, entertainment facilities and more! What are you waiting for? Contact Kryzoid today to become a Grand Hotel resident and a GOD AMONGST MEN! Copyright 2011, Goldcraft's Grand Hotel. All rights reserved. Individual room specifications and pricing rates are subject to change at any time. For more information about anything related to the Grand Hotel, please feel free to contact Kryzoid. \n\n   Guests & Payments:   \n\nRoom #1 ( *Vacant* )\n\nRoom #2 ( fusiondragon145 )\n● Next payment of  3  Gold Ingots is due:  12/1/2011 \n\n--\n\nRoom #4 ( *Vacant* )\n\nRoom #5 ( *Vacant* )\n\nRoom #6 ( *Vacant* )\n\nRoom #7 ( *Vacant* )\n\nRoom #8 ( *Vacant* )\n\nPenthouse ( Quackss )\n● Next payment of  9  Gold Ingots is due:  12/1/2011 "}]}