{"topicId":2570,"forumId":12,"topicTitle":"MZP.inferno's Instructions to Mayhem (Prisoner Guide)","topicTime":1304338869,"topicViews":544,"topicReplies":19,"topicStatus":0,"topicFirstPosterName":"MZP.inferno","topicFirstPosterColor":"","topicLastPosterName":"Human Aimbot","topicLastPosterColor":"009900","topicLastPostTime":1319424220,"posts":[{"postId":20494,"topicId":2570,"posterId":521,"postTime":1304338869,"postText":"Jailbreak is a good gamemode. Heres a bit of intro incase you don't know about it. Jailbreak is a gamemode where there are two teams - Guards and Prisoners. The guards try and keep the prisoners in order without killing them, and the prisoners'' overall goal is to rebel and/or shut up and listen to their demands. The guards have many games to whiddle down the amount of prisoners in order to give a last request, where the prisoner decides what to do (should be reasonable) next round. The prisoners spawn with certain objects that will be listed later to help them in the taking over of the jail.\n\n\n I. Spawnable weapons \nKnife - This is the most popular item that you spawn with, and you have a good chance of getting it. It is an instant kill if you hit a guard in the head, 50 damage if you hit them anywhere else.\n9x19c Glock - This pistol has about a 5-10% chance of you spawning with it. It has burst fire and semi automatic modes, switched by right clicking. I suggest semi-auto because you can shoot pretty fast if you spam click it. With the glock, you need to find a guard standing still and get him.\nDrug sringe - Pretty much worthless. Gives about 3 seconds of screen distortion to whoever you do it to. \nDisguise - Best non-weapon item in the game. Left click to use, right click to take off. This disguises you as a guard, so you can sneak into the armory. The guards have to treat you like a guard or they get slayed.\nSmoke grenade - Emits a cloud of smoke in the area where it is thrown. Use it to cause confusion with guards. Lasts about 15 seconds.\nFlash grenade - Blinds all the guards in the target radius. Very useful if followed up by a knife to the face. \nJihad bomb - The best item that the non-vip prisoners can spawn with. Left click to start the countdown, at the end of the \"alalalalalalala\" it explodes. VERY small chance of you spawning with it. Very effective, use against groups of guards.\nPickpocket - Small chance of you spawning with it. I'm not sure if it works, but when and if it does, press left click behind someone and it supposedly steals their primary. Its never worked for me though.\nFists - You always spawn with these. Right click to falcon punch and left click to normal punch. Hold them both down for awesomeness. About 3 right punches and 2 left ones to kill a guard, get them in the head while theyre standing still.\nHands - No use currently other than to make it look like you dont have any guns.\n\n II. VIP spawnable weapons \nThere are certain weapons that only VIPs spawn with. These are listed as follows.\nMac10 - Gun with good rate of fire and kind of bad damage. \nGalil - Best gun that vips can spawn with imo, has good rate of fire, good damage, large clip.\nAK47 - Huge damage, semi-good rate of fire. \n\n III. General Tips and tricks \n-Get guards when they are standing still and you get a clear shot at their head. \n-Kill guards that are alone so it doesn't get witnessed.\n-If you miss with a knife and he sees you, fall back and blend into the crowd. He usually can't find you again without risking getting knifed or killed.\n-Stay together as much as you can. 5 prisoners are harder to kill than 1.\n-Point out the location of guns in team chat (T i think is the default hotkey). One prisoner rambo'ing isn't going to do much good. 4 prisoners with assault rifles is good.\n-In maps like mars, going to the pool is good. With all those prisoners in one place, its easy to knife a guard and get away with it just by retreating into the crowd.\n-Going to a wall is semi-good, with enough people you can plain overwhelm the guards and win.\n-Gang up on guards. They can't shoot you all before you kill them.\n-Stealth. This means hiding in the cells while other prisoners do the orders, then ninja past them when theyre watching the prisoners. You should be at the armory armed by the time they know someones missing.\n-Use the vents whenever possible. Whenever possible means when they aren't being camped or watched. Its an easy way to win.\n-Charge. If one prisoner gets a gun, follow him to the armory. They cannot handle you all.\n-Help your fellow prisoners. If you see a prisoner trying to knife a guard, help him. You'll usually get him and if you dont just retreat and repeat.\n-Try not to jihad near prisoners. It doesnt get you any advantage and you're just being an ass.\n-Coordinate attacks in team chat. This is extremely effective. Examples of this are, \"Lets gang up on that guard in the corner\" or \"Il flash that guard and you guys knife him\". Most prisoners WILL listen to you.\n-Share the love. If you spawn with a knife and a glock, give the glock to someone.\n-Try and get headshots whenever you can. It kills faster no matter what you are using.\n-This is just a suggestion, but do not buy hats or trails. It lets them identify you as the one who knifed them or the one that has a gun if they cant see your rpname.\n-Escape first. Killing guards can wait if you are low on prisoners and/or health.\n\nThis concludes my prisoner guide. (AIMED AT NEW PLAYERS AND SEMI-NEW PLAYERS.)"},{"postId":20495,"topicId":2570,"posterId":112,"postTime":1304343938,"postText":"Beautiful.\nThanks for writing this.\nI was going to do one, but I'm lazy."},{"postId":20506,"topicId":2570,"posterId":730,"postTime":1304352954,"postText":"Good guide, common sense but most prisoners don't seem to realise if you stick to those basic things you always beat the guards :)\n\nYou could also mention with Smoke Grenade, when guards make you line up on the wall, if you drop it then it creates an ideal opportunity to rebel, you usually kill alot of them that way :)"},{"postId":20532,"topicId":2570,"posterId":521,"postTime":1304370019,"postText":"@Farro \nno problemo\n\n@Tibbles\nI would say that, but its really hard for the prisoners to see in the smoke too and the guards usually just shoot anything that moves in there."},{"postId":20535,"topicId":2570,"posterId":595,"postTime":1304370261,"postText":"You could put that in some maps, there are vantage points, like on a few maps, if the guards say backwall, you can jump somewhere to hide so they cannot see you when they walk in unless they look at weird angle. and jump down for the easy kknive headshot. This will cause the prisoners to attack, Good strategy."},{"postId":20558,"topicId":2570,"posterId":4,"postTime":1304373970,"postText":"props :)"},{"postId":20559,"topicId":2570,"posterId":521,"postTime":1304374027,"postText":"Thanks :D"},{"postId":20708,"topicId":2570,"posterId":272,"postTime":1304480573,"postText":"Interesting guide!"},{"postId":20831,"topicId":2570,"posterId":661,"postTime":1304559895,"postText":"I think the smoke grenade lasts longer, but altogether that was a great guide to make!"},{"postId":20862,"topicId":2570,"posterId":521,"postTime":1304593522,"postText":"Yeah but it starts to dissipate and get less effective at 12-15"},{"postId":22642,"topicId":2570,"posterId":372,"postTime":1306209340,"postText":"Maybe a guard guide is next?  It would be very useful to educate all of the horrible guards that plague the server."},{"postId":22729,"topicId":2570,"posterId":705,"postTime":1306297391,"postText":">> Maybe a guard guide is next?  It would be very useful to educate all of the horrible guards that plague the server. \n\nOr we could just blacklist them all."},{"postId":22730,"topicId":2570,"posterId":237,"postTime":1306297799,"postText":"This makes me really want to try jailbreak. Thanks for the guide."},{"postId":28166,"topicId":2570,"posterId":939,"postTime":1312807371,"postText":"you forgot fragmentation grenade and pickpocket does work but as far as i know you have to stand behind the guard it worked every time i tried it only sometimes you gotta try 2 or 3 times just sneak up a guard"},{"postId":28267,"topicId":2570,"posterId":801,"postTime":1312884112,"postText":"yeah, i wish it doesnt have to be in the back, because guards always run from you if you get close, and its near to impossible to do so =/"},{"postId":28370,"topicId":2570,"posterId":939,"postTime":1312941429,"postText":"its actually pretty easy to do just run past em quickly look at him and then click can take a few tries though"},{"postId":28405,"topicId":2570,"posterId":801,"postTime":1312969751,"postText":"like they will Let you run past them? normally its get to the back wall, and that's it."},{"postId":29524,"topicId":2570,"posterId":1021,"postTime":1313458405,"postText":"Sweet."},{"postId":35952,"topicId":2570,"posterId":1140,"postTime":1319155602,"postText":"This is an excellent guide. Great for those just getting started with JailBreak. (I know when i first started i had no idea what I was doing and had to figure it out through experience.)"},{"postId":36213,"topicId":2570,"posterId":735,"postTime":1319424220,"postText":"Both of the guides should be put in the motd, should be under a tab though like, Prisoner guide or Guard Guide"}]}