{"topicId":3245,"forumId":18,"topicTitle":"Current TTT Moderation (need feedback)","topicTime":1310960535,"topicViews":141,"topicReplies":16,"topicStatus":0,"topicFirstPosterName":"Quack","topicFirstPosterColor":"000099","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1311393941,"posts":[{"postId":25786,"topicId":3245,"posterId":115,"postTime":1310960535,"postText":"Alright, things around here have been moving rather slowly, and I figured we do need a little feedback on eachother.\n\nNow, this isn't a \"Whether you like/dislike\" a certain person. It's more to keep track of our current administration and how we feel about everyone else's activity/their moderating skills. I mostly want to know how they've been doing at moderating, have they been active/inactive (of course some have excuses), and just whether they make the right decisions when it comes down to banning/punishing.\n\nTo keep this from causing any bad feelings torwards each other, I want everyone to  send me a message with their say about the current list of moderators/admins. \n\nQuack(I don't judge, say what you think)\nDum\nPharaoh\nBoomshaka\nKobooold\nDethslayer\nFunnyraff\nBalenti\nChopper\nOverclocking\nIamerror\nPunkedmind\nMark\n\nNow keep it mind this  DOES NOT  involve any sort of demotion. It simply will give you guys to speak your minds about a certain person and how they're doing as admin/mod. I will read through everything you guys have to say and I do encourage any form of story that you have about the person and their performance. \n\nThanks!\nQuack"},{"postId":25821,"topicId":3245,"posterId":101,"postTime":1311029730,"postText":"Quack - Can't tell if his insults were actual ones or jokes.\nDum - XXXX\nPharaoh - Been a bit moody lately\nBoomshaka - Good\nKobooold - Great\nDethslayer - Could be more active\nFunnyraff - Very good\nBalenti - Does NOT do job, in fact he is more of a troll now then actual player. He comes on the server and just does gay voices the whole time.\nChopper - Good I guess\nOverclocking - Good I guess\nIamerror - Wait hes a mod?\nPunkedmind - Could be a little more active\nMark - Was inactive, now very active."},{"postId":25823,"topicId":3245,"posterId":3,"postTime":1311031963,"postText":">> Quack - Can't tell if his insults were actual ones or jokes.\nDum - XXXX\nPharaoh - Been a bit moody lately\nBoomshaka - Good\nKobooold - Great\nDethslayer - Could be more active\nFunnyraff - Very good\nBalenti - Does NOT do job, in fact he is more of a troll now then actual player. He comes on the server and just does gay voices the whole time.\nChopper - Good I guess\nOverclocking - Good I guess\nIamerror - Wait hes a mod?\nPunkedmind - Could be a little more active\nMark - Was inactive, now very active. \n\n>> To keep this from causing any  bad feelings  torwards each other, I want everyone to  send me a message with their say about the current list of moderators/admins.  "},{"postId":25825,"topicId":3245,"posterId":101,"postTime":1311034269,"postText":"We're publicizing this shit."},{"postId":25826,"topicId":3245,"posterId":54,"postTime":1311035832,"postText":">> We're publicizing this shit.  /follows Dum\n\nQuack - good admin.\n\nDum - I love him. (great)\n\nPharaoh - I can't really say much about him, dunno if he's good or bad\n\nBoomshaka - mingebag. on a serious not, he's a good mod c:\n\nKobooold - good.\n\nDethslayer - I don't see him on much, but he's a good mawd.\n\nFunnyraff - great mod.\n\nBalenti - Good.\n\nChopper - Great\n\nOverclocking - great.\n\nIamerror - Inactive as hell..... why is he admin?\n\nPunkedmind - could be more active, but I still love him. great :3\n\nMark - best admin evar! l0l0l0l - kidding, i'm not conceited. :3\n\nGASH ON THE OTHER HAND. BAD. HORRIBLE. demote him.\n\nAnyway, the moderation and administration team we have at this moment, is good imo. I like everyone on it, cause everyone does a good job imo. \nKTHXBAIIIII"},{"postId":25827,"topicId":3245,"posterId":48,"postTime":1311036459,"postText":"Quack - Good\nDum - Dumass. (good)\nPharaoh - Used to play with him a lot, have to say he's a really good admin.\nBoomshaka - Really good, but a mingeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee\nKobooold - Good\nDethsla  yr   - (no e!) uhh.... i admit i'm inactive but I think i do a decent job when I am on.\nFunnyraff - Good\nBalenti - Good\nChopper - Good \nOverclocking - Good \nIamerror - Who? \nPunkedmind - Good\nMark - Good \n\nSorry, my feedback is pretty lame and not personalized, don't have much to say I guess... I can't think of too many mods/admins \nthat I thought did really bad jobs... except maybe Flame... and I think another person, but I can't remember their name :/"},{"postId":25829,"topicId":3245,"posterId":54,"postTime":1311037817,"postText":">> Sorry, my feedback is pretty lame and not personalized, don't have much to say I guess... I can't think of too many mods/admins \nthat I thought did really bad jobs... except maybe Flame... and I think another person, but I can't remember their name :/ \n\nWhat happened to Flame btw?"},{"postId":25830,"topicId":3245,"posterId":272,"postTime":1311038408,"postText":"Quack - Sometimes impulsive\nDum - Great\nPharaoh - Good \nBewmshaka - Good but a minge\nKobooold - xxxx\nDethslayer -Inactive\nFunnyraff - Excellent mod, others could take notes from him\nBalenti - Good (MMMM)\nChopper - Haven't played with him recently\nOverclocking - Could take initiative more often, he often goes to others for advice instead of ruling as he sees fit\nIamerror - He's still here?\nPunkedmind - Inactive, but good\nMark - No opinion"},{"postId":25833,"topicId":3245,"posterId":4,"postTime":1311041187,"postText":">> What happened to Flame btw? \nFlame had an episode in which he broke several rules and then asked to be permanently banned in a last attempt for attention.\n\nOn a happier note, Everyone is doing fine, some people should be more active, and IAMERROR seems to be as inactive as Cake, who should be demoted if he isn't already :/"},{"postId":25834,"topicId":3245,"posterId":101,"postTime":1311041944,"postText":"Basically hes one of those 11 year olds.\n\n\nAnd IAMERROR IS ADMIN?! WTF.\n\n\nYes, Cake and Error should be demoted and Balenti needs to stop being a troll a bit."},{"postId":25838,"topicId":3245,"posterId":6,"postTime":1311045565,"postText":"I'm not at my house right now so I'll make my full post later, just saying, I am becoming more active starting on the 20th."},{"postId":25848,"topicId":3245,"posterId":373,"postTime":1311050224,"postText":"Quack - He's pretty damn good at being a jailmin/TTT admin\nDum - You doin'' good broseph\nPharaoh - He's active, vigilant and catches things that some people overlook\nBoomshaka - Great \nKobooold - Fantastic <3\nDethslayer - Could be more active\nFunnyraff - Very good\nBalenti - [Do I give feedback on myself?..]\nChopper - Good \nOverclocking - Good, don't see him on often but he's great when he is.\nIamerror - If he hasn't been demoted, he should be. \nPunkedmind - Could be a little more active\nMark - Super active on the forum, now active on the TTT server and doing one hell of a job :D"},{"postId":25873,"topicId":3245,"posterId":115,"postTime":1311099556,"postText":">> We're publicizing this shit. \nFuck you. But whatever, since its out there, please do everyone continue."},{"postId":25880,"topicId":3245,"posterId":112,"postTime":1311110290,"postText":">> >> We're publicizing this shit. \nFuck you. But whatever, since its out there, please do everyone continue. \n\nRoftl.\nI'll edit this post In less than an hour with my comments.\nEdit:\n\nQuack- Good admin, no complaints.\nDum-Used a bs excuse for a bs slay -.-\nPharaoh- Fucking faggot\nBoomshaka-Same as chopper. Mainly with chopper.\nKobooold-Good admin, no complaints.\nDethslayer- Great mod when he plays. Inactive though I think\nFunnyraff- Good mod.\nBalenti- I haven't seen him punish anybody for a long time.\nChopper- Uses slap a bit too much.. >.> (Slap with 0 damage)\nOverclocking- Good mod.\nIamerror- Extremely inactive, when I played with him he used csay a little too much. One time he was explaining his death through a csay while I was trying to frame somebody -.-\nPunkedmind- Inactive? Obviously great admin when he (JB) plays. \nMark- Inactive. ( I know why, but it's the only real comment I have)\nand because why not\nBen-  Uber inactive. Whenever I play with you I always feel as though you threaten people with a ban so you can play how you want ;-;\nLike a long time ago on jail, a warden said to get to the backwall and you got off by some lupehole and threatened to ban him if he killed you.\nGash- Slightly inactive in-game."},{"postId":26041,"topicId":3245,"posterId":115,"postTime":1311377485,"postText":"Quack-xxxx\nDum-Overall less inactive than previously. His judgement on rules and decision making has changed since before, sometimes making questionable actions.\nPharaoh-Nothing really bad to say. He does it all.\nBoomshaka-Nothing really bad to say either. Could take more action, he seems to be holding back on some punishment.\nKobooold-Not as active as previously. Which I understand since vacations and such, but even when on, doesn't take much action.\nDethslayr-Not as active as previously. Nothing much to complain other than that. One of the old farts around here. \nFunnyraff-Too hesitent on giving punishment. Often don't see any form of use as moderator from you.\nBalenti-Same as funnyraff. But as you previously stated before, there doesnt seem to be many rulebreakers when you're on.\nChopper-Nothing really bad to say. Could be a tad more active.\nOverclocking-Same as chopper.\nIamerror-Inactive. Not sure why he is still admin. I think we can all agree he needs a demotion\nPunkedmind-Another admin who has seniority in NNJG. Still sticks around for fun.\nMark-Could be more active over the summer, but as always, there are real life things going on, and we understand.\n\n\nI didn't focus on what every does right, but more what they do wrong. Telling you all what you do right doesn't give you room to improve upon."},{"postId":26049,"topicId":3245,"posterId":3,"postTime":1311381962,"postText":">> Iamerror-Inactive. Not sure why he is still admin. I think we can all agree he needs a demotion \n\n>> Now keep it mind this  DOES NOT  involve any sort of demotion. \n\nYou've contradicted yourself."},{"postId":26090,"topicId":3245,"posterId":115,"postTime":1311393941,"postText":"Meaning this doesn't mean anyone will be demoted for these feedbacks. I said we can all agree that he should be demoted, not that he will be demoted, since of course I don't have that type of power."}]}