{"topicId":2914,"forumId":14,"topicTitle":"Unban Request    lllllllll     Unfairly banned?","topicTime":1307150986,"topicViews":124,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"Darknighte9","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1307184156,"posts":[{"postId":23326,"topicId":2914,"posterId":211,"postTime":1307150986,"postText":"Your In-Game name: [S3G] Darknighte9\nYour Steam ID: STEAM_0:1:24815152\nReason: \"\"GTFO S3G PERMA\"\"\nLength of Ban/Date and Time of Unban: Permanently/ 6/2/11 - Around 9:30-10:00\nWhat server were you playing?: [NNJG] TTT\nWho banned you?: Not sure.. it happened too fast couldn't tell =/\nWhy should we unban you?: I understand their is quite a bit of tension between our clans and I do not understand alot of it myself. I love playing on your guys'' TTT server and I have not once been kicked or banned previously. I do not and never have issued any hate towards NNJG because of the clan I am in. I wish NNJG and all of its members the best throughout all of its servers. If I can not be unbanned all I ask is that I can get an explanation why I was banned because of the clan I was in. \n\nThanks..."},{"postId":23343,"topicId":2914,"posterId":377,"postTime":1307156605,"postText":"I was on when that happened, forgot who it was, It was a kick that said it was a Ban try joining."},{"postId":23345,"topicId":2914,"posterId":389,"postTime":1307156854,"postText":"Well this time it wasnt me just saying.... someone else stealing my kick/ban ways.\n\nbut yeah... it wasnt me, i wasnt even home when it happened"},{"postId":23349,"topicId":2914,"posterId":252,"postTime":1307158406,"postText":"It was just a kick, can we get a forum mod/admin to lock this?"},{"postId":23351,"topicId":2914,"posterId":115,"postTime":1307158988,"postText":"Ok."},{"postId":23359,"topicId":2914,"posterId":2,"postTime":1307163173,"postText":"*Unlocking*\n\nA user should never be kicked or banned just because of the group they're in (Unless that group has intentions that collide with our rules), I would like to know who did this."},{"postId":23364,"topicId":2914,"posterId":377,"postTime":1307163926,"postText":"I think Overclocking, but I could be wrong, I just made the comment that since he joined then immediately left and rejoined that he was stealing codes (Joking of course), but I also heard a rumor that anyone from S3G would be banned, I never Banned anyone because of it, but I have heard it going around.  Guess now I know it's false."},{"postId":23383,"topicId":2914,"posterId":211,"postTime":1307170408,"postText":"Well the best I remember as far as mods that were on was, overclocking, that guy, and i believe deth slayer may have been on as well but i'm not sure. I tried going back on again and some voice chatted \"send him a message and a ban\" (which was probably directed at me) ----then well... disconnected and i received the message as mentioned above."},{"postId":23384,"topicId":2914,"posterId":79,"postTime":1307170542,"postText":"Don't remember who banned, but a few people said he was one of the members that joined the server to steal code. Overclocking and That Guy were only mods on if i remember correctly."},{"postId":23396,"topicId":2914,"posterId":112,"postTime":1307184156,"postText":"Stop kicking people with the reason \"Perma\". \nI already said it wastes everybodies time."}]}