{"topicId":3980,"forumId":18,"topicTitle":"Jailbreak Host","topicTime":1315156851,"topicViews":51,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"MarioDJW","topicFirstPosterColor":"990000","topicLastPosterName":"MarioDJW","topicLastPosterColor":"990000","topicLastPostTime":1315196023,"posts":[{"postId":32078,"topicId":3980,"posterId":372,"postTime":1315156851,"postText":"Recently, The Jailbreak server switched hosts after the deal with SleekServers went south.  At first I was just happy to have the server back, and the random lag was accepted because I was simply glad to play Jailbreak.  \n\nBut that was a long time ago.  Every staff member I have asked think that our current host is complete CRAP. Lag is now something our players have to live with, and the spikes last over 5 seconds, which is ridiculous.  Add onto that crashes ever day.  I don't know how much is being paid to host our server, but whatever it is, you are paying way too much.  \n\nThis is why I am going to urge us to switch hosts.  It may be a pain, it may cost more, but our current host is so bad that it would be worth it."},{"postId":32079,"topicId":3980,"posterId":735,"postTime":1315157219,"postText":"+Support, the new host is almost becoming unbearable and unplayable due do its random lag spikes and the server crashing like every 3 hours."},{"postId":32087,"topicId":3980,"posterId":916,"postTime":1315162630,"postText":"+Support on this The New Host i cant Deal with...Were loosing more and more people that come and the lag is being an advantage For some Rdmers"},{"postId":32098,"topicId":3980,"posterId":153,"postTime":1315171048,"postText":"We are actually in the process of moving jail to a VPS but it wasn't announced because we weren't sure if we could do it."},{"postId":32099,"topicId":3980,"posterId":153,"postTime":1315171129,"postText":"We'll work on it. It's a huge-ass pain to move an entire server, though.\nI'll talk to gash and we'll figure something out."},{"postId":32150,"topicId":3980,"posterId":372,"postTime":1315196023,"postText":"Thank you."}]}