{"topicId":783,"forumId":1,"topicTitle":"Question on basic photo cutting/stuff.","topicTime":1283999728,"topicViews":54,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"[NNJG] Cake","topicFirstPosterColor":"","topicLastPosterName":"[NNJG] Cake","topicLastPosterColor":"","topicLastPostTime":1284081989,"posts":[{"postId":7161,"topicId":783,"posterId":13,"postTime":1283999728,"postText":"Normally I would just go straight to Kryzoid on this but I am trying to respect his wish to have a break ^^. So I was looking for a certain emblem and looked all over for it and finally found one place that had it, but on a pic with a few others, and it's a gif on top of that. I am completely suck at this, I had to have someone make spray or me ^^. First I want to ask if there is anyone that can cut them all out and preferably make it into normal format, I will love you long time as is customary for anyone that does anything for me. If not can someone give me basic instructions on what to do.\n\nThanks in advance~"},{"postId":7164,"topicId":783,"posterId":4,"postTime":1284000627,"postText":"my break is over. i'll gladly do it :D"},{"postId":7165,"topicId":783,"posterId":13,"postTime":1284003309,"postText":"Ohhhh thank you Kry ^^, I need to find a way to pay you back somehow for all the projects you for me. Don't know if you need direct or view so here is both.\n\nDirect\nhttp://filebox.me/files/jt97tvvv4_c22f4a66879f8e4d33c7ac3.gif\n\nView\nhttp://filebox.me/view/jt97tvvv4\n\nMostly interested in Sanya's (Bottom Let), but would really really appreciate them all for my group of fellow SW fanatics."},{"postId":7280,"topicId":783,"posterId":4,"postTime":1284078323,"postText":"http://filebox.me/files/zvz7x1phd_emblems.zip\nI made them all PNG's, including the original pic you gave me =D"},{"postId":7281,"topicId":783,"posterId":26,"postTime":1284078513,"postText":">>  Cake\":y86g13sz]Ohhhh thank you Kry ^^, I need to find a way to pay you back somehoe for all the little projects you for me. Don't know i you need direct or view so here is both.\n\nDirect\nhttp://filebox.me/files/jt97tvvv4_c22f4a66879f8e4d33c7ac3.gif\n\nView\nhttp://filebox.me/view/jt97tvvv4\n\nMostly interested in Sanya's (Bottom Let), but would really really appreciate them all for my group of fellow SW fanatics. \n\nbecause i totally don't know anything about making images and converting"},{"postId":7283,"topicId":783,"posterId":4,"postTime":1284078723,"postText":"Well rainrain i beat you to it bahaha"},{"postId":7299,"topicId":783,"posterId":13,"postTime":1284081989,"postText":"Thank you soooo much Kry, that was fast. Lol honestly Rain if Kry didn't respond I was expecting you to. You and Kry are the only 2 that have made me good stuff, Kry is just the guy everyone goes to for this since he has proved to be king in this ^^\n\nAnyway thanks again I will see and save them when I get to a comp.\n\nEdit: Got home late but got to see um, I like um thank you ^^"}]}