{"topicId":364,"forumId":122,"topicTitle":"Re: Addict of Gmod","topicTime":1277223280,"topicViews":239,"topicReplies":21,"topicStatus":2,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"Bird Flu","topicLastPosterColor":"000099","topicLastPostTime":1277351900,"posts":[{"postId":3440,"topicId":364,"posterId":54,"postTime":1277223280,"postText":"He's still being a fail vip/mod. He can still slay and sht. Here is him agreeing with racism.\n\nhttp://i48.tinypic.com/fcr336.jpg\n\nPeople were talking about the N word meaning bro and stuff, and usually people got banned and shit for saying it. Crisis got banned for 30 mins for saying it, but addict agrees. And he didn't slay a troll who was rdming cause the troll talked him into not slaying him.\n\nhttp://i47.tinypic.com/do7vx4.jpg\n\nAnd here is him saying the N word is a term for bro. If other admins ban people for saying it, he could at least mute them. But instead he agrees. He doesn't deserve ANYTHING on this server."},{"postId":3442,"topicId":364,"posterId":54,"postTime":1277226235,"postText":"And here is some more of him abusing, him abusing the /ach command.\n\nhttp://i49.tinypic.com/33z7b6d.jpg\nHeres the console of him abusing, giving people achievements like crazy.\n\nhttp://i48.tinypic.com/10o3bps.jpg\nHeres addict giving me and FB Crayon the achievement \"Gay\"\n\nhttp://i50.tinypic.com/6y0had.jpg\nAnd here is addict saying sorry after giving me and the other guy the achievement \"gay\", but in pm.\n(sorry for the blur, I had to stretch the pm.)"},{"postId":3443,"topicId":364,"posterId":9,"postTime":1277226366,"postText":"that coulda been me or brando and  i did not get memo about racism"},{"postId":3444,"topicId":364,"posterId":54,"postTime":1277226802,"postText":">> \nthat coulda been me or brando and  i did not get memo about racism\n  You always abuse /ach and you know it. And plus after you gave me the achievement \"gay\" you pmed me and said sorry. And no racism is in the MOTD if you didn't read that ever before, and didn't know, then you don't deserve to be mod or vip or anything."},{"postId":3445,"topicId":364,"posterId":83,"postTime":1277227250,"postText":"All of this evidence is used in such mis-context. Crazy, you have been trolling, screaming, and flaming, for the past two days. You didnt even provide the forum with the part of you throwing slurs, and called Addict \" A Fail Faggot \"bitch\" Admin\" why didnt you post that? You have no say in this. My vote is to remove you from the clan. Addict keeps his position. Case closed. :o\n\n@Close"},{"postId":3446,"topicId":364,"posterId":54,"postTime":1277227577,"postText":">> \nAll of this evidence is used in such mis-context. Crazy, you have been trolling, screaming, and flaming, for the past two days. You didnt even provide the forum with the part of you throwing slurs, and called Addict \" A Fail Faggot \"bitch\" Admin\" why didnt you post that? You have no say in this. My vote is to remove you from the clan. Addict keeps his position. Case closed. :o\n\n@Close\n  There is WAY more people to say YOU were the one trolling and addict muted you for saying \"Nigglet\" and your racist slurs that Addict didn't mute you for. Why don't you tell them that? What about your racist comments such as calling people the N word? And you also are always rdming then you left for an hour and came back and were trolling more. There is more witnesses to say YOU are the troll. And do you have PROOF of me calling him that? Yes, I called him a fail  MOD , he isn't an admin. And where are all these admins you know and all the admins you have their numbers. Lets ask them?"},{"postId":3447,"topicId":364,"posterId":83,"postTime":1277227707,"postText":"I am the troll, yet you are bringing flame to the forums. and yes i do have proof. it will be posted when i get back home. and for those \"witnesses\" bring them to the forums. because you are full of shit"},{"postId":3448,"topicId":364,"posterId":79,"postTime":1277227745,"postText":"I agree with Freelancer, Crazy u have been doing a lot of stuff too, BUT even if 1 person does something that does not give Addict the right to do everything he was doing.\n\nhttp://filebox.me/view/aix58q95h\n\nhttp://filebox.me/view/9qgqqi82a\n\nI told Gash but all he did was talk to him about it. Far as im concerned, if i did that much stuff i woulda been banned/perma'd. WAY too lenient with the mods. Also, i understand that most mods/admins are under 18. Im cool with that, but maybe appointing them u should take into account there mental/annoyance level as well. Some of these people dont understand that u cant do whatever u want as admin just because ur admin. Personally ill say whatever i want to a admin if he's doing bs stuff like this. A ban for me is not as bad as a server being stripped from u. If enough people complain to Steam about this matter or enough proof shown something like that could happen. Just sayin u might wanna reconsider who all is admin if stuff like this keeps happening."},{"postId":3449,"topicId":364,"posterId":54,"postTime":1277228144,"postText":">> \nI am the troll, yet you are bringing flame to the forums. and yes i do have proof. it will be posted when i get back home. and for those \"witnesses\" bring them to the forums. because you are full of shit\n  This isn't flame, this is bringing justice to the server and trying to remove a fail of a mod."},{"postId":3451,"topicId":364,"posterId":54,"postTime":1277228398,"postText":">> \nI agree with Freelancer, Crazy u have been doing a lot of stuff too, BUT even if 1 person does something that does not give Addict the right to do everything he was doing.\n\nhttp://filebox.me/view/aix58q95h\n\nhttp://filebox.me/view/9qgqqi82a\n\nI told Gash but all he did was talk to him about it. Far as im concerned, if i did that much stuff i woulda been banned/perma'd. WAY too lenient with the mods. Also, i understand that most mods/admins are under 18. Im cool with that, but maybe appointing them u should take into account there mental/annoyance level as well. Some of these people dont understand that u cant do whatever u want as admin just because ur admin. Personally ill say whatever i want to a admin if he's doing bs stuff like this. A ban for me is not as bad as a server being stripped from u. If enough people complain to Steam about this matter or enough proof shown something like that could happen. Just sayin u might wanna reconsider who all is admin if stuff like this keeps happening.\n  Yeah, Free was going Crazy on addict and saying MUTE CRAZY MUTE CRAZY and was kind of ragining in his mic so I told him to mute me in the player list. And he continued to troll on EVERYONE. And he wouldn't mute me on the player list and was raging."},{"postId":3453,"topicId":364,"posterId":54,"postTime":1277228912,"postText":"And what have I been doing? He was trolling me. And Addict would not mute him till like 20 mins later. I haven't been trolling. I had a fight with Cake recently, but I didn't troll him, I told him what was going on and what I was going to do. And I'm pretty sure me and him are not friends, which I regret. But this all is beside the point. I haven't been trolling."},{"postId":3460,"topicId":364,"posterId":9,"postTime":1277231873,"postText":">> \nAnd what have I been doing? He was trolling me. And Addict would not mute him till like 20 mins later. I haven't been trolling. I had a fight with Cake recently, but I didn't troll him, I told him what was going on and what I was going to do. And I'm pretty sure me and him are not friends, which I regret. But this all is beside the point. I haven't been trolling.\n \ny dont u go to player list and mute him then"},{"postId":3463,"topicId":364,"posterId":54,"postTime":1277232334,"postText":">> \n>> \nAnd what have I been doing? He was trolling me. And Addict would not mute him till like 20 mins later. I haven't been trolling. I had a fight with Cake recently, but I didn't troll him, I told him what was going on and what I was going to do. And I'm pretty sure me and him are not friends, which I regret. But this all is beside the point. I haven't been trolling.\n \ny dont u go to player list and mute him then\n  Why don't you stop abusing your mod powers?"},{"postId":3475,"topicId":364,"posterId":2,"postTime":1277239384,"postText":"Last I heard from Ben, he demoted him to a VIP.\n\nClosed."},{"postId":3494,"topicId":364,"posterId":26,"postTime":1277277063,"postText":">> \nAll of this evidence is used in such mis-context. Crazy, you have been trolling, screaming, and flaming, for the past two days. You didnt even provide the forum with the part of you throwing slurs, and called Addict \" A Fail Faggot \"bitch\" Admin\" why didnt you post that? You have no say in this. My vote is to remove you from the clan. Addict keeps his position. Case closed. :o\n\n@Close\n \n\nI know this has been closed, But freelancer.\n\nWhy does it seem i always hear you nonstop claiming others called another faggot when they havent? And of all people you shouldnt be talking about screaming and flaming, I muted you twice because of that before you ban because of trucing.\n\nAlso, Unlocked since this is BAN request, not demote. :<\n\n\nAlso, he's been demoted for far longer then the last thread was even created for abusing, If he's still abusing, No reason he should keep his powers.\n\nI dont know why he was demoted to vip anyways, major abuse should be insta full demote.\n\nAlso, Trolling isn't accepted, Atleast not by me."},{"postId":3500,"topicId":364,"posterId":2,"postTime":1277300033,"postText":">> \n>> \nAll of this evidence is used in such mis-context. Crazy, you have been trolling, screaming, and flaming, for the past two days. You didnt even provide the forum with the part of you throwing slurs, and called Addict \" A Fail Faggot \"bitch\" Admin\" why didnt you post that? You have no say in this. My vote is to remove you from the clan. Addict keeps his position. Case closed. :o\n\n@Close\n \n\nI know this has been closed, But freelancer.\n\nWhy does it seem i always hear you nonstop claiming others called another faggot when they havent? And of all people you shouldnt be talking about screaming and flaming, I muted you twice because of that before you ban because of trucing.\n\nAlso, Unlocked since this is BAN request, not demote. :<\n\n\nAlso, he's been demoted for far longer then the last thread was even created for abusing, If he's still abusing, No reason he should keep his powers.\n\nI dont know why he was demoted to vip anyways, major abuse should be insta full demote.\n\nAlso, Trolling isn't accepted, Atleast not by me.\n \n\nHe's not abusing as in kicking people for no reason, he's just abusing the /ach command. A demote to vip should be enough."},{"postId":3505,"topicId":364,"posterId":83,"postTime":1277303915,"postText":" -sniped- "},{"postId":3506,"topicId":364,"posterId":54,"postTime":1277308213,"postText":">> \nRain, you are the biggest hypocrit i have yet to meet on NNJG, that being said. YOU abuse.\nI don't see why you would have admin. You are power hungry, abuse, and if you refer to someone as a \"Bitch faggot\" then they retaliate, you decide it's \"admin disrespect\" your head is so far up your ass with power, you shouldnt have Admin, and i have found MANY people from NNJG that agree with me.\n\nNow, as to this thread about Addict, he never abused, Crazy took bits&peices of information, and made them look bad, yet crazy monkey mic spammed, trolled, and RDMed, several times, and Addict did nothing.(Is that abuse?) And this was supposed to be a demotion thread, not a ban. Crazy just put it wherever he felt, because he honestly doesn't care about anyone but himself. It shows in his attitude during the game. ;)\n  I might be a little late here, but you claimed to have demos of me doing this stuff. Lets see em, shall we? You said you'd show them yesterday, and yet I'm still waiting. And all this evidence isn't \"bits&pieces\" it's all proof. And all the proof I need imo. Now I know you've gotten banned and all, but a troll always returns. You were the one trolling. Therefore you got banned for rdming. Plus you say you know all the admins yet you got banned, obviously you don't if the owner of the serer had to ban you for rdming. Plus you're racist and a failtroll. Now go troll on a different server and forum, cause no one wants you here judging by two admins agreeing that you fail. When you come back, I'll make sure to demo you every time you come online to show Gash and Rain how much of a troll you are.\n\nAs for rain, he doesn't abuse at all. He does his job. Maybe cause he had to mute you, you're crying about it. Addict had to mute you a few times aswell. You're a troll who just wont give up. You spend your time TROLLING on a server. You fail at it too. At least be a good troll.. Anyways, Rain doesn't abuse, you're just crying cause you got banned. Get Toxic here, you say you know him good and you got his number. Lets ask him?"},{"postId":3508,"topicId":364,"posterId":54,"postTime":1277308673,"postText":"But I'll close the topic myself since there is nothing more to talk about. I posted it in the wrong place - sorry rain. Gash has agreed to demote him, so be it. \n\nClosed."},{"postId":3542,"topicId":364,"posterId":26,"postTime":1277344513,"postText":">> \nRain, you are the biggest hypocrit i have yet to meet on NNJG, that being said. YOU abuse.\nI don't see why you would have admin. You are power hungry, abuse, and if you refer to someone as a \"Bitch faggot\" then they retaliate, you decide it's \"admin disrespect\" your head is so far up your ass with power, you shouldnt have Admin, and i have found MANY people from NNJG that agree with me.\n\nNow, as to this thread about Addict, he never abused, Crazy took bits&peices of information, and made them look bad, yet crazy monkey mic spammed, trolled, and RDMed, several times, and Addict did nothing.(Is that abuse?) And this was supposed to be a demotion thread, not a ban. Crazy just put it wherever he felt, because he honestly doesn't care about anyone but himself. It shows in his attitude during the game. ;)\n \n\nFreelancer, I have never called anyone a \"bitchfaggot\" As you said, I dont even know where you pulled that out of.\n\nAbuse? Power hungry? I'd like to see WHERe and WHEN these things happened, I dont need a screeny, I just need you to say so and i'll tell you what I know of it.\n\n\"MANY\" Bieng you and crisis. I dont know why crisis though as i barebly even play with him.\n\nClosed due to crazy's want but just an FYI, Addict has been a vip for months, and was a mod once, apparently abusing the ach command too. Which shouldnt be."},{"postId":3565,"topicId":364,"posterId":153,"postTime":1277346224,"postText":"What is ach? Also Crazy do not close topics. Our mods and admins will handle that."},{"postId":3588,"topicId":364,"posterId":3,"postTime":1277351900,"postText":">> Ben\":1bxgcgf3]\nWhat is ach?\n \nAchievement command (FINAL POST)"}]}