{"topicId":4654,"forumId":3,"topicTitle":"Epic Traitor Round of all time","topicTime":1319586421,"topicViews":157,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"Wheatley Is C-Gull","topicFirstPosterColor":"","topicLastPosterName":"Wheatley Is C-Gull","topicLastPosterColor":"","topicLastPostTime":1321672694,"posts":[{"postId":36369,"topicId":4654,"posterId":1087,"postTime":1319586421,"postText":"Okay, so i was T on LostTemple, and i killed 8 people in the first minute of the round with a silenced psitol. AWesome\nOf course it is."},{"postId":36399,"topicId":4654,"posterId":612,"postTime":1319599364,"postText":"If you have nothing constructive to add then don't say anything. \n\nAny way. Wheatley how many did you kill with a knife or betrayl"},{"postId":36405,"topicId":4654,"posterId":1094,"postTime":1319606586,"postText":"Shoulda taken screenshots, Wheat.  Then you could wave e-peen swag all over the place.  But you really did kill 8 people with the silenced pistol?  That alone is a nice achievement, and if the time you stated is true, even better.  Congratulations I guess :V"},{"postId":36410,"topicId":4654,"posterId":605,"postTime":1319623755,"postText":"I imagine all these kills took place with afks... or at least in the afk trap zone."},{"postId":36414,"topicId":4654,"posterId":634,"postTime":1319629482,"postText":"I've killed more than 8 people in the blnk of an eye before.\n I used C4, it's obvious, no need to post it. "},{"postId":36453,"topicId":4654,"posterId":1087,"postTime":1319670982,"postText":"Nope, none AFKJ and no knives or betrayals. I just bought a pistol and just started shooting from the lil scaffolding becuase people kept flooding in the check the bodies every second. Then i jumped down and got two more :3\nAnd i have screenshots of it, i jsut didnt post them, you can check my G-mod screenshot gallery though to see for yourself.\n\nEdit: Although the Traitors still lost, becuase my other teammates were some random joiners who didnt know what to do, hence why i only felt liek using silenced pistol."},{"postId":37807,"topicId":4654,"posterId":1097,"postTime":1321140314,"postText":"edit: nevermind"},{"postId":38007,"topicId":4654,"posterId":706,"postTime":1321446195,"postText":"Lol I have also gotten a bunch of kills with the silenced pistol on that map"},{"postId":38026,"topicId":4654,"posterId":968,"postTime":1321495947,"postText":"I would like to care, but ive had more funnier and more epic rounds."},{"postId":38089,"topicId":4654,"posterId":1087,"postTime":1321672694,"postText":"Good sir, if you would like to wave your Ego on NNJG, go make your own thread :p"}]}