{"topicId":2964,"forumId":18,"topicTitle":"Stop saying TTT is better.","topicTime":1307641682,"topicViews":71,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Pharaoh","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1307710899,"posts":[{"postId":23651,"topicId":2964,"posterId":112,"postTime":1307641682,"postText":"Obviously there are problems with the jail server (freekilling)\nBut there are problems with TTT too\nIf you've ever actually played jail, you might like it. If you've played it and hate it, then that's fair too.\n\nBut for the love of god. You don't have to keep saying \"jail sucks\"\nThere's no need for a discussion. Saying one server is absolutely better than another will cause unneeded flame wars.  And it doesn't take a genius to figure out who will win it. They'll be arguing with one of you and probably get banned for admin disrespect.\n\nYou can bet your ass you'd flame someone who joined and said \"TTT sucks\".\nActually, some of you already have.\nIf you don't like jail, then don't play. Simple enough. No further comments are needed.\nYou guys are supposed to be the role models, and you're basically just baiting people.\n\nEdit: and before you say it:\nYes. I like jail. I'm not posting this trying to change your opinion to make you think it's better. I'm trying to stop the fucking annoying comments I keep seeing.\n\nWe are one community. Start acting like it."},{"postId":23654,"topicId":2964,"posterId":4,"postTime":1307650425,"postText":"Someone promote this man."},{"postId":23668,"topicId":2964,"posterId":262,"postTime":1307666368,"postText":"Why? TTT is has much more replay value..."},{"postId":23670,"topicId":2964,"posterId":153,"postTime":1307666920,"postText":"Staff shouldn't be badmouthing any part of NNJG. Especially the servers."},{"postId":23675,"topicId":2964,"posterId":115,"postTime":1307672366,"postText":"It doesnt matter what is better than what. Act like adults, and respect your community.\n\nAnyways, all of nnjg's servers differ in who plays what for a reason. They all offer different types of entertainment for different types of people."},{"postId":23676,"topicId":2964,"posterId":112,"postTime":1307672559,"postText":">> Why? TTT is has much more replay value... \n\nSo basically... What you took from my rant about Not saying TTT is better... was to say TTT is better? Please tell me your kidding."},{"postId":23700,"topicId":2964,"posterId":115,"postTime":1307710899,"postText":">> Why? TTT is has much more replay value... \nYa dun goofed, good sir"}]}