{"topicId":4455,"forumId":14,"topicTitle":"miketech unban request","topicTime":1318165794,"topicViews":161,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"miketech","topicFirstPosterColor":"","topicLastPosterName":"Vasto","topicLastPosterColor":"009900","topicLastPostTime":1318372817,"posts":[{"postId":35126,"topicId":4455,"posterId":1125,"postTime":1318165794,"postText":"Which server: nnjg jailbreak\nYour in-game name: miketech\nYour SteamID: STEAM_0:1:39146778\nWhen were you banned and for how long: 4 days (thats what my friend said)\nReason for ban: gun plant\nWho banned you: console (i think) or some moderator on 08/10/2011\nWhy should we unban you or shorten your ban period: because when I was a guard, I went to plug in my mic but it didn't work so I went AFK to go on my audio manager to get it to work but it still didn't work. So then I went to get a drink and then check on the game to see what has happend, I was dead, then a moderator said \"miketech was gun plating\" then I said in the chat box \"I was getting my mic to work\" then he said \"it was miketech or another guard who gun planted\" then I was banned for gun planting. My friend said I pressed the button to drop my gun (f2) but I don't no how I could have, the game was minimized."},{"postId":35135,"topicId":4455,"posterId":634,"postTime":1318180677,"postText":"You were jumping at prisoners and suiciding in front of them if I remember correctly. When you do that you drop your gun and prisoners can take it. You did it two rounds in a row and so I assumed you were doing it on purpose.\nThis was probably Balenti's ban if anyone was wondering."},{"postId":35142,"topicId":4455,"posterId":1125,"postTime":1318186616,"postText":"That was probably when I was trying to get my mic to work but it was not working and I was saying \" can u hear me\" but  no answer. So I was trying to get it to work and i forgot about the game. I don't no how I could of jumped if I had the game minimized though."},{"postId":35149,"topicId":4455,"posterId":1125,"postTime":1318191653,"postText":"I am sorry that I have gun planted but I did't do it on purpose and it will not happen again I promise. Can I be unban because I have lernt for this mistake and it will not happen again."},{"postId":35159,"topicId":4455,"posterId":373,"postTime":1318203210,"postText":"This is Vasto's ban, not mine. I couldn't see shit outside of the jail cells"},{"postId":35203,"topicId":4455,"posterId":1125,"postTime":1318257683,"postText":"So how do I get Vasto to unban me?"},{"postId":35254,"topicId":4455,"posterId":916,"postTime":1318372817,"postText":"Since He Didnt Knew,Ill Give you Mercy But Dont let it happen again."}]}