{"topicId":4447,"forumId":105,"topicTitle":"Xalton","topicTime":1318118666,"topicViews":201,"topicReplies":16,"topicStatus":0,"topicFirstPosterName":"popl43","topicFirstPosterColor":"","topicLastPosterName":"popl43","topicLastPosterColor":"","topicLastPostTime":1319750911,"posts":[{"postId":35097,"topicId":4447,"posterId":249,"postTime":1318118666,"postText":"As most of you who play Gold Craft frequently should know, FunnyRaff gathered a group of people who wanted to go to the ungenerated chunks of 1.8, and guided us through the Nether. Once there we decided to create a Town, its name is Xalton, and it is on the island of Raffrica. On this topic, we will post the future buildings that will occur in Xalton, so that all of the towns people will know where and what the town buildings are, and will be.\n-------------------------------------------\nCurrent (town) Constructions: N/A\n-------------------------------------------\nCompleted Constructions list and features:\n- Town Hall, 5 rooms, 2 floors, over 4000 blocks, features a Courtroom, Conference room, Main office, Library, and Secondary offices. It was constructed from donated blocks partly and some of my personal blocks. Eclipse helped mainly with the interior and first and second floors. I completed the roof late that night. The land was provided by FunnyRaff, and cleared by He and I and was an idea of all of ours here in Xalton, and if I forgot to mention your helping in the construction, please say.\n-------------------------------------------\nGuys, if you have any more ideas, no matter how unusual, please reply to this topic. In the next week following, I'll have alot of time on my hands and can build plenty of things.\nI'll update the topic when I get permission to build something within the city of Xalton, this week I'd like to complete my new Manor outside of Xalton and will be busy."},{"postId":35303,"topicId":4447,"posterId":612,"postTime":1318447415,"postText":"can we occupy that place? i will help construction if we can live there, just know that my house will be a mansion"},{"postId":35310,"topicId":4447,"posterId":377,"postTime":1318455976,"postText":"An Art Museum?  I got one in Singleplayer, wont build it unless people think its a good idea"},{"postId":35318,"topicId":4447,"posterId":243,"postTime":1318459677,"postText":"Look at our steam group to see current citizens!\nTown hall is complete, and our town is.. well.. LEGIT."},{"postId":35321,"topicId":4447,"posterId":456,"postTime":1318462251,"postText":"I'd like to link it to CC in some way at some point if that is okay with you guys. Also, I'd like to build some kind of establishment for myself there. Would that be agreeable, Mayor Raff?"},{"postId":35336,"topicId":4447,"posterId":243,"postTime":1318469281,"postText":"We all voted no.\nBut you do have permission to build there, ofcourse. :P\n\nEDIT: By all, I mean, almost all, and by no, I mean.. well no :P"},{"postId":35338,"topicId":4447,"posterId":634,"postTime":1318472060,"postText":"How about we establish a major community project to make a train station near CC and another Near Xalton with a rail connecting them and also a Major Train station somewhere in between with a small town there."},{"postId":35339,"topicId":4447,"posterId":377,"postTime":1318472381,"postText":"The reason we don't want any means to get to Xalton from CC is to prevent Grievers from getting there, so that only people we know and trust can get there VIA Nether guide, or teleport from mod"},{"postId":35342,"topicId":4447,"posterId":243,"postTime":1318474297,"postText":">> The reason we don't want any means to get to Xalton from CC is to prevent Grievers from getting there, so that only people we know and trust can get there VIA Nether guide, or teleport from mod \nThis is true, but there are other reasons as well.\nSuch as.. everyone knows each other; or we all live near each other. Things are much easier when everyone is your neighbor."},{"postId":35354,"topicId":4447,"posterId":612,"postTime":1318518434,"postText":"We could make a rail to cc, but ask pirate to make to player permissions so that only those that you want tocome can come. I could make a coded piston door. With a combination."},{"postId":35357,"topicId":4447,"posterId":377,"postTime":1318522127,"postText":"or just add /home2 if that's possible so we can have /home1 at Xalton and /home2 a near CC"},{"postId":35364,"topicId":4447,"posterId":4,"postTime":1318538862,"postText":"I'm pretty sure Funny wants to keep it completely seperated."},{"postId":35366,"topicId":4447,"posterId":456,"postTime":1318539346,"postText":"We shall leave it separated. Working on fixing corrupted regions. when we are back up I will join you guys."},{"postId":35367,"topicId":4447,"posterId":377,"postTime":1318539646,"postText":"Yeah but with /home2 people at Xalton can easily access their old 1.7 homes and their new 1.8 homes with ease and still make it so New guys can't get to Xalton without being Guided there by one of us"},{"postId":36305,"topicId":4447,"posterId":249,"postTime":1319512639,"postText":"Updated the topic to include Town Hall, and added a spot for ideas. I think a rail to the portal is a horrible idea, and we should keep the town hidden forever :D"},{"postId":36518,"topicId":4447,"posterId":456,"postTime":1319743660,"postText":"In other news, whoever is spreading the rumors that me or a mod will do free teleports needs to stop because it is false. We (at least I) have never done that. If a new person wants to go to xalton, they must be guided there by a person who knows how to get there. That makes it so that the trek to get there from CC will make them treasure more the fact that they are there."},{"postId":36536,"topicId":4447,"posterId":249,"postTime":1319750911,"postText":"I told them to ask for it ;-;"}]}