{"topicId":4508,"forumId":104,"topicTitle":"Dum's Reviews #3 - Red Dead Redemption","topicTime":1318747813,"topicViews":39,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"The Ungrateful Dead","topicLastPosterColor":"","topicLastPostTime":1318973413,"posts":[{"postId":35481,"topicId":4508,"posterId":101,"postTime":1318747813,"postText":" Red Dead Redemption - Rockstar Games \n\nOkay, as I was gone I got to play a ton of games. And actually I played a few of the ones I'm going to make soon before my hard drive crash, but I was a bit too lazy to do those. ANYWAYS, Red Dead Redemption will now be referred to as RDR.\n\nRDR is a game that takes place right before the times of the wild west era was about to end. You play as John Marston, a cowboy who attempts to seek revenge on some person. To be honest I didn't find the story all that interesting, and it felt like this game's story would be better off as a movie. The attempts where it tried to tell the story were long and fairly boring.\n\nBecause of this, I am not going to get into the story much. Anyways, you wake up on the MacFarlane ranch and do a bunch of cool shit and then some stuff that you're not even sure why you're doing to be honest. That aside, one thing I'd immediately like to get into is how much this game feels like L.A. Noire. Or how Noire feels like this game. I think this game came first. So Noire feels like this game. Anyways, it is pretty much the same controls, but the combat system is a lot better. The cover system makes sense and you could tell what the fuck you were doing. That aside, one thing I was majorly disappointed in was that because of the cover system, killing bad guys is way too easy. Just sit behind cover, then quickly come out zooming in - which auto locks onto the nearest target (up to about 40 degrees) then just shoot. It's way too easy, and made killing people very boring. And if that weren't simple enough for you, you can go into slow mo, or dead eye, (at the cost of draining some dead eye meter) and auto lock on to the targets and paint them with X's so that when you leave you trigger finger the living shit out of them.\n\nAnother thing I wanted to point out is the characters. Some of the characters in the game made you feel like they were actually in the old western times, while others - including the main character himself - makes it feel like Rockstar picked random people up off the streets. The facial animations don't help.\n\nA few things to note is that this game really isn't very memorable. I didn't have that much fun playing it. The multiplayer is filled with hackers, pointless things (seriously, there is NO OBJECTIVE in some of the modes, the others its just \"kill kill kill\" which is pretty much the objective of the free roam already) and a really shitty leveling up system. So that's fun for about 10 minutes. If you care for achievements, you won't get that many. I got like 6 in about 12 hours of game play. After doing a few story missions, Ms. MacFarlane gave me a horse better than my current one, so I was like \"Sweet\", but I soon wanted a better horse. So I check to see how much it is: $15000. I figured the quickest way was to play \"Five Finger Filet\", which pretty much insists of me hitting ABAYAXABAY about 5 times in about 20 seconds (total). That might not sound hard, but believe me, it is. Even though half the time it said i screwed up I didn't. Luckily you get a few tries. Anyways, after forever of doing that I finally get enough. Guess what, I ALREADY HAD THE DAMN HORSE. It didn't tell me \"Oh you've been playing this game for 2 hours here's the best horse in the game.\" Even if it did it'd be stupid, but it'd save me some time. Seriously, make me work for a good horse, not just do it because I fucking did some annoying rodeo thing that's total bullshit on a few horses and is only trying to make you dizzy.\n\n  PROS AND CONS  \n -Decent graphics\n-Working cover system\n-Big environment\n-Plenty of weapons\n-Good controls\n-Many side distractions \n -Too easy to kill\n-Boring story\n-Some bad voice actors\n-Bad animations\n-Some missions were just fucking boring\n-The options it gives you don't really effect anything\n-No motivation to keep playing \n\n  Verdict: 5.5 out of 10. Not really worth it.  \n\nMaybe it's just me, but I didn't enjoy it at all. Also, this is dedicated to Mongo, since I played RDR multiplayer with him. Ruined by hackers.\n\nNext review: Dead Rising 2"},{"postId":35490,"topicId":4508,"posterId":605,"postTime":1318763844,"postText":"I have one extremely important note about this game;\nGetting plastered and tumbling around is fun... and is about the only fun you'd have in this game.... the end."},{"postId":35693,"topicId":4508,"posterId":693,"postTime":1318973413,"postText":">> 5.5/10 \n\nThe fuck you talking about.\n\nSure it's not perfect, but it's a lot damn better than that.\nI'd give it an 8/10"}]}