{"topicId":2171,"forumId":19,"topicTitle":"Puzzle Contest #1: Map Making!","topicTime":1300673204,"topicViews":312,"topicReplies":14,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Jasdahlk","topicLastPosterColor":"","topicLastPostTime":1302294145,"posts":[{"postId":17590,"topicId":2171,"posterId":101,"postTime":1300673204,"postText":"Yay, the first contest for puzzle :D Even though it hasn't been completely public (it's still in beta) the first contest will be making maps. Future contests may also be for different things, such as \"the person to have the high score set on ____ map on _____ date wins.\"\n\nRules:\n-Must have at least 7 stages\n-Must be completable \n-Must work (see below)\n-Must have map glitch-free\n-Must be semi-difficult (Can't be 7 stages of ''walk 5 steps'' for the prize)\n-Each participant must create the map by themselves (cannot steal a map)\n-Deadline: April 9th\n-Each participant can only submit one map, so if you make several pick the one you like most!\n\nPrizes:\n1st place: 1000 Puzzle Points  OR  500 Jail Points  OR  250 TTT points.\n2nd place: 750 Puzzle Points OR 250 Jail Points OR 150 TTT points.\n3rd place: 500 Puzzle Points OR 150 Jail Points OR 100 TTT points.\nParticipant: 100 Puzzle Points OR 50 Jail Points OR 50 TTT points.\n\n\nIf you have any questions, Steam Message me, Forum PM me, or post questions on this sticky.\nIf you would like a sample puzzle map to view in Hammer (to see how the spawns, checkpoints, etc work) Steam Message or Forum PM me.\n\nGet to work!"},{"postId":17595,"topicId":2171,"posterId":389,"postTime":1300679422,"postText":"Where exactly are these points coming from? If I remember correctly, you guys arnt able to distribute points with admin commands unless GASH LIED to me!~"},{"postId":17597,"topicId":2171,"posterId":292,"postTime":1300684532,"postText":"How are the maps going to be judged? Are you just gonna pick which one looks best? hardest? most balanced? most graphical?\nAlso how many judges are there gonna be? Just you?"},{"postId":17599,"topicId":2171,"posterId":2,"postTime":1300686189,"postText":"Dum's generous? PFFFT. I knew someone hacked his account..."},{"postId":17612,"topicId":2171,"posterId":389,"postTime":1300722983,"postText":">> How are the maps going to be judged? Are you just gonna pick which one looks best? hardest? most balanced? most graphical?\nAlso how many judges are there gonna be? Just you? \n\nIMO, I think this should be publicly judged by the community. (I bet winner will be the one everyone gets super pissed off at.)"},{"postId":17632,"topicId":2171,"posterId":4,"postTime":1300750269,"postText":"i like how puz_escape is going, so good luck to bird flu :D"},{"postId":17633,"topicId":2171,"posterId":2,"postTime":1300751609,"postText":"If the first place winner chooses points for TTT, I'll throw in 200 for him/her."},{"postId":17641,"topicId":2171,"posterId":101,"postTime":1300758588,"postText":"Thanks Gash, I have no idea how many points in TTT I have at the moment.\n\nAnd at Flame's first post: You shall no nothing. (I really just don't feel like explaining it at the moment, BUT WHO GIVES A SHIT ITS MY SERVER NOT YOURS)\n\nFlame's second: It will either be judged by me and gash OR the community (probably community). Soon I'll probably put up a thread/sticky saying \"Vote for your favorite!'' and have all the submitted maps there. And it really is just the \"most fun.\""},{"postId":17644,"topicId":2171,"posterId":3,"postTime":1300763240,"postText":"I do in fact submit Escape."},{"postId":17649,"topicId":2171,"posterId":272,"postTime":1300771317,"postText":"I want to see your Good map, Berd Floo."},{"postId":17653,"topicId":2171,"posterId":389,"postTime":1300819571,"postText":">> Thanks Gash, I have no idea how many points in TTT I have at the moment.\n\nAnd at Flame's first post: You shall no nothing. (I really just don't feel like explaining it at the moment, BUT WHO GIVES A SHIT ITS MY SERVER NOT YOURS)\n\nFlame's second: It will either be judged by me and gash OR the community (probably community). Soon I'll probably put up a thread/sticky saying \"Vote for your favorite!'' and have all the submitted maps there. And it really is just the \"most fun.\" \n\nWOW, way to be a douchebag Dum.... I was gonna say I would help donate points in for prizes if they come out of your points.\n\nSeriously.... don't gotta be such a douche about my question."},{"postId":17660,"topicId":2171,"posterId":605,"postTime":1300835328,"postText":"Well, the points could easily come from setting the server to locked, changing the amount you get from completeing one puzzle from 1 to 1000, do one puzzle, set it back and unlock... bam, prize is ready. But it really dont matter how it comes about, the fact is, the winner gets something, participants get something, the server gets new maps, everyone is happy.\nI assume, those who made the maps cant vote on their own map ;p. That being said, i'm more for a preset judges thing, but that's my 2 cents.\nI also assume, previously released maps can not be the one choosen, which I suppose would only affect me XD. Not that I would choose trickery_ basic or adv anyways, i've got better stuff in the works [insert your choice of winking face]. I'd just like to know for future refence in case of more competitions."},{"postId":17682,"topicId":2171,"posterId":101,"postTime":1300844804,"postText":"Flame, that was a half reference to Balenti's mod application.\n\nAnd besides, I'll only need help really if every single one of them picks TTT, I won't need help with Puzzle."},{"postId":18616,"topicId":2171,"posterId":101,"postTime":1302238312,"postText":"One day left! Only UDane has submitted a map so far!\n\nBird Flu, you might want to make a thread about your map/get it done quickly."},{"postId":18626,"topicId":2171,"posterId":573,"postTime":1302294145,"postText":"I'll be submitting my map, but I'm afraid it's as of yet untested.\nI've been waiting for Gash to get on today so we can run through my map once or twice on the server, to make sure it all works.\n----\n/edit: Phooey. Didn't get finished in time. I could still submit my first version (a few bits broken, no lighting, etc.) but I think I'd rather wait for the next contest to come around, when I have a better map ready.\nThanks anyway, Dum."}]}