{"topicId":4577,"forumId":12,"topicTitle":"POF Jail People","topicTime":1319097379,"topicViews":207,"topicReplies":13,"topicStatus":0,"topicFirstPosterName":"TGK_ReapaZ","topicFirstPosterColor":"","topicLastPosterName":"Cookieman","topicLastPosterColor":"","topicLastPostTime":1321330352,"posts":[{"postId":35858,"topicId":4577,"posterId":756,"postTime":1319097379,"postText":"Lately people form POF have started to play on NNJG's jail server and using the  same rules such as: The last guard getting to kill all the  prisoners without reason.\nI dont think they have even read the rules so they Free kill thinking their doing the right thing.\nThoughts?"},{"postId":35859,"topicId":4577,"posterId":1016,"postTime":1319097925,"postText":"This was an issue we faced for a couple of days, but I talked to some of the newbie pof people along with others about the no last guard rule. Frankly it hasn't been too much of an issue as of late, only thing we have is punks who like to rdm or trolls."},{"postId":35916,"topicId":4577,"posterId":101,"postTime":1319138990,"postText":"Make ban requests if it annoys you. Tell them it's not allowed."},{"postId":35938,"topicId":4577,"posterId":1016,"postTime":1319152393,"postText":">> Make ban requests if it annoys you. Tell them it's not allowed. \n\n\nHonestly we haven't had PoF issues in quite a while, only the first two days or so when the server came back up was it an issue. Only thing we're facing now is the late night trolls or people who are just ignorant of the rules."},{"postId":35981,"topicId":4577,"posterId":735,"postTime":1319174669,"postText":">> >> Make ban requests if it annoys you. Tell them it's not allowed. \n\n\nHonestly we haven't had PoF issues in quite a while, only the first two days or so when the server came back up was it an issue. Only thing we're facing now is the late night trolls or people who are just ignorant of the rules. \nrotwey came on jailbreak with no name and was advertising on the server, left, changed his name and came back. sux2be him lol."},{"postId":36001,"topicId":4577,"posterId":916,"postTime":1319208729,"postText":"Im so tempted to go there and troll."},{"postId":36003,"topicId":4577,"posterId":115,"postTime":1319221344,"postText":"We shouldnt have to stopp to their level to get back at them. Keeping our server up and running will take players from them, and thats how we get back at them."},{"postId":36022,"topicId":4577,"posterId":735,"postTime":1319237829,"postText":">> We shouldnt have to stopp to their level to get back at them. Keeping our server up and running will take players from them, and thats how we get back at them. \nNNJG is so more populated than them that rtowey(POf dude) had to advertise on the server."},{"postId":36035,"topicId":4577,"posterId":756,"postTime":1319247009,"postText":"It's not that bad now but it might go on to being the same in the near future"},{"postId":36041,"topicId":4577,"posterId":634,"postTime":1319248252,"postText":">> NNJG is so more populated than them that rtowey(POf dude) had to advertise on the server. \n>> rotwey came on jailbreak with no name and was advertising on the server, left, changed his name and came back. sux2be him lol. \nYes Aimbot we know. Please do not tell us a third time.\n\nI really don't see the purpose of this at all. If there is a problem with a rule breaker then handle it the same way whether they are PoF or not. Inform them if they make a a mistake and hope they can learn."},{"postId":37752,"topicId":4577,"posterId":1194,"postTime":1321069213,"postText":"Hey NNJG. The reason why im trolling your server is because countless members of yours come to mine and troll there... EX: just this day someone came on named \" Eros steam id >>  STEAM_0:1:27102928 came on MY server telling everyone that \"NNJG rules and to FUCK PoF\" I take this very seriously. Please stop or things will get ugly."},{"postId":37776,"topicId":4577,"posterId":101,"postTime":1321078006,"postText":"The person you speak of \"Eros\" is not administration. Our administration is told to act politely on other servers and give NNJG a good name. However, Eros is not in administration (or even a common regular I recognize) and we don't directly monitor his actions. If you want to ban him from your server, feel free, that's not our problem. Please note that this was not a scheduled attack on your server, as we do not set up those type of things in any ways."},{"postId":37909,"topicId":4577,"posterId":115,"postTime":1321313709,"postText":">> Hey NNJG. The reason why im trolling your server is because countless members of yours come to mine and troll there... EX: just this day someone came on named \" Eros steam id >>  STEAM_0:1:27102928 came on MY server telling everyone that \"NNJG rules and to FUCK PoF\" I take this very seriously. Please stop or things will get ugly. \n\nI'm late to the party, sorry about this.\n\nWe don't promote any trolling, and we assure our administration takes no part in such trolling. We here in NNJG are very strict when it comes to keeping our administration in line, and assure our servers are troll-free.\n\nSo Rtowey, you worry about your server, and we will worry about ours. :)"},{"postId":37952,"topicId":4577,"posterId":1195,"postTime":1321330352,"postText":"Well from what i know No PoF  members have been going to your server to trollin , i been going to your server for the pass week and keep my guys in line , so yahhh"}]}