{"topicId":3394,"forumId":22,"topicTitle":"Increased VIP chat limit","topicTime":1312066671,"topicViews":233,"topicReplies":20,"topicStatus":0,"topicFirstPosterName":"Playerhata27","topicFirstPosterColor":"009900","topicLastPosterName":"binlaninja","topicLastPosterColor":"","topicLastPostTime":1317529385,"posts":[{"postId":26976,"topicId":3394,"posterId":812,"postTime":1312066671,"postText":"The mic chat limit on this server of any server I've played is probably the most limited. Not saying that's a bad thing, because we rarely have mic spam problems. But I think giving VIP's just 15-30 seconds more chat limit in game would be a nice extension, and an addition to our VIP priveleges.\n\nOf course, abuse could come into this, but the time extension I'm requesting is nothing major, and I doubt someone who took the time to donate to the server is really going to abuse this that blatantly.\n\nOr, if this suggestion is shot down, could mic regeneration for VIP's be increased at least?"},{"postId":27000,"topicId":3394,"posterId":769,"postTime":1312075805,"postText":"Of all the people on this server, I KNEW Playerhata would be the one to suggest this. I vote yes so I can hear more of his  intriguing  stories."},{"postId":27003,"topicId":3394,"posterId":812,"postTime":1312077007,"postText":"Lol, thank you for the support, but hopefully not only me wants this implemented, I'm sure other people would enjoy this ! D:"},{"postId":27004,"topicId":3394,"posterId":237,"postTime":1312077595,"postText":"support for sure. I've been wanting thiis for awhile.\nSurely we're worth 5 more seconds ;D"},{"postId":27031,"topicId":3394,"posterId":79,"postTime":1312085714,"postText":"I would personally say no. Honestly, the VIPs get enough of a bonus they don't need to talk more. Def not for 15-30 seconds more. The chat limit as it is now is fine, anyone trying to talk more then it is prolly talking about nothing relevant to the round anyway."},{"postId":27038,"topicId":3394,"posterId":706,"postTime":1312087970,"postText":"yes i think we should also. Most of the vip's are mature enough not to spam the mic."},{"postId":27092,"topicId":3394,"posterId":735,"postTime":1312128578,"postText":"If this is implemented, there should be a buyable shop item for like 1000 points, like the extra credit. Should be like 30 extra seconds. Just my idea"},{"postId":27094,"topicId":3394,"posterId":79,"postTime":1312130703,"postText":"You guys are crazy, 30 extra seconds? No way in hell. If more time is ever added it should only be 1 or 2 more seconds. You guys REALLY don't understand how long even 10 seconds is. The chat limit atm is around 5 seconds and thats more then enough. The restriction is fine because any longer would really allow people to spam the mic again like they used to. You say players are mature enough not to spam, yet most of the players are not mature. There is the reason we added the mic limit in the first place."},{"postId":27102,"topicId":3394,"posterId":812,"postTime":1312136506,"postText":"Crisis, but having it for VIP's only will also give people another reason to donate. And I'm not exactly asking for 30 seconds, just 15-30 seconds.\n\n\nAnd currently I don't even know how the mic limit works lol, sometimes it will fucking drain in like record speed, and sometimes it stays for a good fifteen seconds. \n\nAnd of course some of what is said might not be relevant to the round, but that happens regardless of a mic limit. Plenty have I tried to say something important relating to the round, but must wait for a suitable mic amount to say it."},{"postId":27103,"topicId":3394,"posterId":1,"postTime":1312136603,"postText":">> You guys are crazy, 30 extra seconds? No way in hell. If more time is ever added it should only be 1 or 2 more seconds. You guys REALLY don't understand how long even 10 seconds is. The chat limit atm is around 5 seconds and thats more then enough. The restriction is fine because any longer would really allow people to spam the mic again like they used to. You say players are mature enough not to spam, yet most of the players are not mature. There is the reason we added the mic limit in the first place. \n\nIt wouldn't matter. If people wanted to spam the mic they have enough time to do it now, hence the purpose of gagging and muting. correct?"},{"postId":27114,"topicId":3394,"posterId":79,"postTime":1312141147,"postText":"How bout this. It should be possible but not sure exactly how atm. Make the mic limit based on your karma. 1000 karma = 10 seconds of mic, 1300+ = 15 seconds, if u drop below 700 your mic limit reduced to 5 seconds. Would help a few issues imo if you can manage to set it up. I believe it's possible.\n\nOverall that would solve RDM'ing to an extent and reward you for less rdm."},{"postId":27117,"topicId":3394,"posterId":769,"postTime":1312141674,"postText":">>  1300+ = 15 seconds  I've never seen anyone's karma above 1300 on our server"},{"postId":27119,"topicId":3394,"posterId":612,"postTime":1312141863,"postText":">> How bout this. It should be possible but not sure exactly how atm. Make the mic limit based on your karma. 1000 karma = 10 seconds of mic, 1300+ = 15 seconds, if u drop below 700 your mic limit reduced to 5 seconds. Would help a few issues imo if you can manage to set it up. I believe it's possible.\n\nOverall that would solve RDM'ing to an extent and reward you for less rdm. \n\nNonono. Rdmers affect more than just their own Karma. If they kill two people as detective then I hit them in the head with a deag or a scout my karma goes WAY down. Thus. Giving me less time to explain myself to admins. VIPs should get like increased chat limit. If they abuse it--> demotion."},{"postId":27120,"topicId":3394,"posterId":79,"postTime":1312142036,"postText":"VIPs get enough. Don't need to keep giving VIPs more things. It would either be everyone gets it or no one. Even something in the shop for this would be going too far, since a lot of people wouldn't have points to buy this. I personally believe we have enough mic time to say what need be said during the round. You don't have a mic limit in spectator or pre-round, so that's more then enough time as well to let people know what happened/going on. Since if you kill an inno, either your shot instantly or given long time to explain. Long enough to even type it if you wanted."},{"postId":27427,"topicId":3394,"posterId":79,"postTime":1312307556,"postText":">> >> How bout this. It should be possible but not sure exactly how atm. Make the mic limit based on your karma. 1000 karma = 10 seconds of mic, 1300+ = 15 seconds, if u drop below 700 your mic limit reduced to 5 seconds. Would help a few issues imo if you can manage to set it up. I believe it's possible.\n\nOverall that would solve RDM'ing to an extent and reward you for less rdm. \n\nNonono. Rdmers affect more than just their own Karma. If they kill two people as detective then I hit them in the head with a deag or a scout my karma goes WAY down. Thus. Giving me less time to explain myself to admins. VIPs should get like increased chat limit. If they abuse it--> demotion. \n\nKarma is effected by how much u actually do in dmg, + some more for the actual kill. If i remember correctly its around 1 karma loss per health and 30 for the kill.\n\nRough estimate that im really just guessing on. I know its based on dmg done and kill tho"},{"postId":28346,"topicId":3394,"posterId":1,"postTime":1312933368,"postText":">> How bout this. It should be possible but not sure exactly how atm. Make the mic limit based on your karma. 1000 karma = 10 seconds of mic, 1300+ = 15 seconds, if u drop below 700 your mic limit reduced to 5 seconds. Would help a few issues imo if you can manage to set it up. I believe it's possible.\n\nOverall that would solve RDM'ing to an extent and reward you for less rdm. \n\nThat would not work, especially for the people who are constantly accidentally RDMing....hint hint wink wink...\nand it wouldn't work for people who are always getting trolled and shot the person after the 3 warnings. Basing\nit off of someone's karma is going to end up in fail."},{"postId":28391,"topicId":3394,"posterId":812,"postTime":1312954451,"postText":"Being that VIP powers were taken away, I think that even gives this suggestion more leverage replacing benefits of being a VIP member on NNJG."},{"postId":28407,"topicId":3394,"posterId":1,"postTime":1312982134,"postText":"Yes, the fact that I can't gag or kick anyone anymore makes me feel like I should have more time to bitch them out . =D yes? yes."},{"postId":29500,"topicId":3394,"posterId":988,"postTime":1313455030,"postText":"I totally agree with this. Especially with VIP's at least getting more mic time than non-VIP's. \n\n   + support   "},{"postId":29971,"topicId":3394,"posterId":272,"postTime":1313797178,"postText":"I think it should be implemented, but 5 seconds more  AT MOST. \n\nDouble the current voice should be MORE than enough."},{"postId":34673,"topicId":3394,"posterId":1097,"postTime":1317529385,"postText":">> yes i think we should also. Most of the vip's are mature enough not to spam the mic. \n\nFor this statement,\n+Support"}]}