{"topicId":1899,"forumId":3,"topicTitle":"Betting/Lottery/Gambling","topicTime":1297646147,"topicViews":217,"topicReplies":11,"topicStatus":0,"topicFirstPosterName":"Flame","topicFirstPosterColor":"","topicLastPosterName":"MZP.inferno","topicLastPosterColor":"","topicLastPostTime":1301857644,"posts":[{"postId":15841,"topicId":1899,"posterId":389,"postTime":1297646147,"postText":"Sooo since we can now give points and such. There has been some gambling addictions :D.\n\nDum with his Raffle drawings.\nRandom players with the first to give me x points get 2x. (some could be scams)\n\nAnd well I was talking with kobooold about something like a betting ring to see who wins and what not. \n\nMaybe either have a addon where you guys can bet points preround / early round. and the ones that win will get a split pot.\n\nor\n\nI might take a friend's account that has gmod and use that as a point holder and then split it to the winners."},{"postId":15845,"topicId":1899,"posterId":272,"postTime":1297647872,"postText":"If we could set up a middleman, perhaps, that could be used more easily than a 2nd computer, that would work well."},{"postId":15847,"topicId":1899,"posterId":389,"postTime":1297649142,"postText":"It should be an official NNJG lottery system that is through admin/mod supervision.\n\nOr possibly a lottery, happens once every week.\nThey can buy a lottery ticket thing for points. The points are transferred to a temp holder account or w/e.\n\nIt works like a lottery ticket. Get n/x numbers and get some points back or part of the pot.?"},{"postId":15849,"topicId":1899,"posterId":101,"postTime":1297651477,"postText":"Well    I    thought my raffles worked pretty well.\n\nHowever, the betting system may be kind of mixed, considering you have no clue of wondering who the traitors will be."},{"postId":15850,"topicId":1899,"posterId":2,"postTime":1297652625,"postText":"> \"bet inno all\"\n\n*The Traitors Win*\n\n>\"shit\"\n>\"well now I'm broke\"\n>Player has disconnected (Disconnected by user)."},{"postId":15853,"topicId":1899,"posterId":272,"postTime":1297656551,"postText":"We're already doing a self-moderated version of it."},{"postId":15865,"topicId":1899,"posterId":389,"postTime":1297702066,"postText":"Dum.... All i gotta say is... Thanks :D Earned me profit yesterday :D"},{"postId":16409,"topicId":1899,"posterId":389,"postTime":1298607603,"postText":"   Random Raffle (Flame's Version)   \n\nI have a made program on C++ that will generate 5 numbers depending on number of participants.\n\nSo basically like Dum's raffle (there people will be assigned to a number by the order they come in).\n\nThen I will put the number of participants in my program and the number that appears most will be the winner.\n\nI'll prob do these raffles once in awhile when I have access to my friend's account. Also, the points will go into my friend's account cause hes my point holder thing.\n\nJust want to see some approval b4 I implement. :D\nAdmin Approval:\n\n\n   Round Betting (Flame's Style)   \n\nA set amount of points to bet will be given at start of each round.\nEach player will give GhostBuster (my friends accont im using for this), those points and bet on which team (traitors/innocents) will win.\nWinnings will be distributed at the end of each round to the winners.\n\nI will be doing this by myself most likely so, any lost of points will be blamed on me solely.\n(Also I will be betting, but I will be betting honestly - cause i wanna stay a mod hehe)"},{"postId":16458,"topicId":1899,"posterId":272,"postTime":1298777899,"postText":"Make a thread for it."},{"postId":18325,"topicId":1899,"posterId":634,"postTime":1301804516,"postText":"This would be so awesome. I think mods could serve the middleman purpose very well and admins of course."},{"postId":18369,"topicId":1899,"posterId":389,"postTime":1301854322,"postText":"Okay Destar... stop reviving a month old thread."},{"postId":18373,"topicId":1899,"posterId":521,"postTime":1301857644,"postText":">> Okay Destar... stop reviving a month old thread. "}]}