{"topicId":1961,"forumId":104,"topicTitle":"Balloon Diaspora","topicTime":1298298360,"topicViews":137,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1298428976,"posts":[{"postId":16231,"topicId":1961,"posterId":82,"postTime":1298298360,"postText":"Balloon Diaspora  is an amazing point n'' click adventure by Cardboard Computer. It follows the talking type of adventure, so paying close attention to the text is very important. To move you click on various areas of the screen, this game isn't too strong on the gameplay side, but Balloon Diaspora is more of an experience than a game, and an amazing experience at that. You begin the game when your balloon crashes, and you meet a guy that [img]might[/img] help you repair your balloon. I became very attached to him because he had his own opinions, ideas and veiws, he isn't just a mindless sidekick with a lamp. Most of the characters look very similar, but you can distinguish between ones that will do certain things. All of them have something to say, on a balloon you travel to a few different places, each one is rich in history, and people willing to talk about it. If you take the time to pay attention, read and make connections you will be in for an amazing trip. \n\n http://www.indiegames.com/blog/images/timw/balloond3c.png \n The sense of loneliness and scale at strong themes in Balloon Diaspora. \n\nThe music was written by Oliver Blank , he did the soundtrack amazingly well. Almost every song creates an eerie, calming and lonely feeling. The one track that didn't fit in was the Balloon Flying one, which is sad because it was the most wondrous part of the game. I don't want to spoil anything but my ending had me in tears. This is definitely an experience you won't want to miss, unforgettable and beautiful."},{"postId":16252,"topicId":1961,"posterId":272,"postTime":1298342952,"postText":"I will czech it out."},{"postId":16257,"topicId":1961,"posterId":82,"postTime":1298346045,"postText":">> I will czech it out. \nTell me what ending you get, the one I got drove me to tears."},{"postId":16295,"topicId":1961,"posterId":373,"postTime":1298428976,"postText":"Will see how it's superb\n\nEdit: I flew away with him to Balloon-Whatever ... Whattafawkjusthappened? Did I win?"}]}