{"topicId":4205,"forumId":124,"topicTitle":"Udane","topicTime":1316328786,"topicViews":102,"topicReplies":11,"topicStatus":0,"topicFirstPosterName":"๖Mr. Gash","topicFirstPosterColor":"000000","topicLastPosterName":"Playerhata27","topicLastPosterColor":"009900","topicLastPostTime":1316744082,"posts":[{"postId":33482,"topicId":4205,"posterId":2,"postTime":1316328786,"postText":"I've given Udane a 3 day trial moderator access to see how well he does, Ben has already agreed to allow this, I'm just posting this here so it won't come as a surprise upon joining. Yes, I do know there are unanswered staff applications, but Udane seems to be the only one that is on late at night.\nSure, some of them would make good moderators, but not at the times that we need them on. Late nights are left ignored, people breaking the rules get away with it. Unless the people that dislike him being promoted decide to stay up late at night and actually moderate the server, I'm not going to tolerate any of your complaints based off of your opinion or his past actions that have already been resolved."},{"postId":33483,"topicId":4205,"posterId":373,"postTime":1316331850,"postText":"I stay up late at night Gashie-poo D;"},{"postId":33497,"topicId":4205,"posterId":115,"postTime":1316359368,"postText":"I think you should stop getting your info from Udane, and ask others who are on at night. ^^"},{"postId":33563,"topicId":4205,"posterId":153,"postTime":1316392264,"postText":">> I think you should stop getting your info from Udane, and ask others who are on at night. ^^ \nI think you need to get some info."},{"postId":33566,"topicId":4205,"posterId":115,"postTime":1316393073,"postText":">> Ben\":3ri4tupn]>> I think you should stop getting your info from Udane, and ask others who are on at night. ^^ \nI think you need to get some info. \nI think I have more info than you and gash combined. It sounds like you two are basing your opinion right off of Udane's word, and nothing more. \n\nWe have administrator's who are up late at night. No, we don't have administrators who play every night up until 6am in the morning. Nor do we need that. We have plenty admins who stay up until 2-3am, and if you think otherwise, maybe it's time to demote some.\n\nUdane obviously isn't giving you the full info from what you stated. I think I have plenty of info, judging how I know at least 4 admins who stay on that late off the top of my head, not to mention Balenti's post right above."},{"postId":33576,"topicId":4205,"posterId":243,"postTime":1316393954,"postText":"I would like to point out the amount of bans Udane has placed.. in one day."},{"postId":33578,"topicId":4205,"posterId":115,"postTime":1316394128,"postText":">> I would like to point out the amount of bans Udane has placed.. in one day. \nForget 1 day, he made 9 bans in a matter of 6 hours."},{"postId":33585,"topicId":4205,"posterId":2,"postTime":1316394830,"postText":">> I would like to point out the amount of bans Udane has placed.. in one day. \n>>  I'm not going to tolerate any of your complaints  \n\n\n>> if you think otherwise, maybe it's time to demote some. \nBe careful what you say, this would include you."},{"postId":33587,"topicId":4205,"posterId":115,"postTime":1316394992,"postText":"If demoting me is what you would think would solve the problem, then go right ahead.\n\nBut I highly doubt that would solve anything. I think you know exactly the parts of the administration that I'm talking about."},{"postId":33592,"topicId":4205,"posterId":243,"postTime":1316396330,"postText":"I would like to point out that my comment was not a complaint, but watevz\nI think its nice to see things like that done.\n\nOntopic:\nGash has final say, I wont argue with anything he says.\nAnd from what I've seen, this seems personal for you, Quack, no offence."},{"postId":33602,"topicId":4205,"posterId":115,"postTime":1316397601,"postText":"It seems as if this is personal. I guess I just feel as if I'm not being heard.\n\nIn any case, I'm backing out of the whole udane shit. It seems quite apparent me arguing will get nowhere."},{"postId":34098,"topicId":4205,"posterId":812,"postTime":1316744082,"postText":"Just wondering, when exactly does his trial actually expire, or has he officially been promoted?"}]}