{"topicId":3387,"forumId":3,"topicTitle":"Kryzoid's TerrorTown MOTD [7-29-11]","topicTime":1311994451,"topicViews":199,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1312344998,"posts":[{"postId":26911,"topicId":3387,"posterId":4,"postTime":1311994451,"postText":"http://min.us/mbGgyvk\n© 2011 NoNerdsJustGeeks LLC.\n\n\n *Edit* \n Updated to the latest version. "},{"postId":26917,"topicId":3387,"posterId":634,"postTime":1311996314,"postText":"I love you"},{"postId":26935,"topicId":3387,"posterId":377,"postTime":1312011466,"postText":"!9. Only Detective's can do live checks?  Why?"},{"postId":26937,"topicId":3387,"posterId":4,"postTime":1312016009,"postText":">> !9. Only Detective's can do live checks?  Why? \nGives people a reason to want to be detective, sets the detective as the authority figure in the terrorist situation which further enhances the gameplay, and stops from alive check spam every 1 minute. Sometimes i just stop responding to them, even if im innocent. Besides, innocents can do live checks still, but in this case, the \"if you don't respond within 30 seconds you can be killed\" won't apply"},{"postId":26983,"topicId":3387,"posterId":101,"postTime":1312067613,"postText":"I don't like it. If theres like 9 people alive but theres actually 7 of them dead (1 v 1) and I do an alive check as inno, you're saying I can't kill the last guy? That needs to be rethought. Alive checks should only make someone not killable if they dont respond are either: Visually AFK (having the [AFK] tag) or being detective.\n\nBesides, dets. can already just buy a radar to see how many people are alive.\n\nThe ability to do alive checks and kos for not responding should not be the primary reason people will want to be detective, it should be the extra items you can purchase. If someone doesn't want to be detective you shouldn't PUNISH them for not wanting to."},{"postId":27022,"topicId":3387,"posterId":634,"postTime":1312082872,"postText":"I think having only detectives able to do live checks as long as one is alive makes sense. So once the detective(s) are dead anyone can live check. How do you know if the detectives are dead? A live check of course!"},{"postId":27027,"topicId":3387,"posterId":79,"postTime":1312084921,"postText":"Rule #12, set a direct time. Long period of time for some is 1 minute, others 5, some 30 seconds.\nRule #7, Can we just make the RTV not start till AFTER ROUND, would solve all those issues.\nRule #3, What counts as spamming? More then how many messages over what time-frame if its just random bs.\nRule #13, Is there ways to prove this OTHER then having to record a video?\nRule #19, I think that even the detective shouldn't be allowed to follow someone if warned, some people HATE being followed in general. Such as me\nRule #17, I think if the knife is in their face you can go on last seen, its pretty obvious he was knifed from the front. (pls clarify this one, confusion)\nRule #14, Does this include randomly calling yourself out?\nRule #4, Can we post random youtube videos if dead and think it be funny for people to watch? Or will this be punishable just based on linking it?\n\nJust a few rules and questions about them. These rules could either be manipulated in a way or ascertained horribly. (think thats right word, half asleep atm)"},{"postId":27050,"topicId":3387,"posterId":237,"postTime":1312089403,"postText":"limit live checks maybe, but don't restrict them."},{"postId":27062,"topicId":3387,"posterId":4,"postTime":1312093723,"postText":" I will re-write the Alive Checks rule soon, in all of your favors. (I derped there, i know.) "},{"postId":27064,"topicId":3387,"posterId":4,"postTime":1312094501,"postText":">> Rule #12, set a direct time. Long period of time for some is 1 minute, others 5, some 30 seconds.  I'll get to this soon. I'm thinking 1 minute max, since C4's are slightly less. \nRule #7, Can we just make the RTV not start till AFTER ROUND, would solve all those issues.  I can't do anything about that. \nRule #3, What counts as spamming? More then how many messages over what time-frame if its just random bs.  Spamming is usually pretty obvious. Saying something once in text chat, then saying the exact same thing shortly afterwards in either the exact same context or slightly different but still unconstructive. For microphone, it's just music playing, voice changers, excessive microphone hogging, etc. There are too many scenarios for this, i'll be sure to add a line of text to the MOTD that says \"If you have a question or need clarification and a certain rule, please feel free to contact so-and-so\" \nRule #13, Is there ways to prove this OTHER then having to record a video?  Not that i know of, unless they blatantly exclaim in text chat that they are going to fucking shoot near you. \nRule #19, I think that even the detective shouldn't be allowed to follow someone if warned, some people HATE being followed in general. Such as me  I don't agree, I mean c'mon, it will only and i mean ONLY lead to a teamkill if we throw detectives into this. Unless you're trying to hide and a detective is TRYING to blow your cover, i think the rule is fine. In most of all other situations, he would help you out in a gunfight with a traitor. \nRule #17, I think if the knife is in their face you can go on last seen, its pretty obvious he was knifed from the front. (pls clarify this one, confusion)  Thrown knives could change that, especially with crowds of people. \nRule #14, Does this include randomly calling yourself out?  Not really, you can act upon a self-callout, only if the player isn't a detective. \nRule #4, Can we post random youtube videos if dead and think it be funny for people to watch? Or will this be punishable just based on linking it?  This is a grey area. As long as it doesn't start to seem like a violation of rule 3, it's fine. \n\nJust a few rules and questions about them. These rules could either be manipulated in a way or ascertained horribly. (think thats right word, half asleep atm) "},{"postId":27571,"topicId":3387,"posterId":4,"postTime":1312344998,"postText":"Update: http://min.us/mbGgyvk"}]}