{"topicId":2166,"forumId":26,"topicTitle":"Huh, just noticed this... Intro time.","topicTime":1300615165,"topicViews":145,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1300919800,"posts":[{"postId":17573,"topicId":2166,"posterId":605,"postTime":1300615165,"postText":"Moving along, a few of you already know me, but those that don't, I generally suck at most any fps. That being said, I love to map and found myself enjoying puzzle gamemode enough to dedicate a good portion of my free time donating maps to it. Granted I have a very odd work schedule coupled with being a volunteer firefighter, so my schedule is very random, but at the very least, i'd like to shell out one map a week provided y''all dont get initimidated/enraged at the map rotation being dominated by my name. <---(Intimidation/Enragement was a joke) :O!\n\nOh, I like making faces at the end of my sentences in a normal conversation, and if this offends you, please cover your eyes... it's gonna get gruesome here on out. :D"},{"postId":17579,"topicId":2166,"posterId":101,"postTime":1300649176,"postText":"Oh god that smiley made me blind."},{"postId":17598,"topicId":2166,"posterId":4,"postTime":1300684727,"postText":"hey, i envy your map making skills, welcome to the forums :D"},{"postId":17708,"topicId":2166,"posterId":6,"postTime":1300860138,"postText":"I like your maps, good, and difficult(for me). Welcome!\n\n(Your avatar kinda scares me)"},{"postId":17712,"topicId":2166,"posterId":54,"postTime":1300864707,"postText":">>  (Your avatar kinda scares me) "},{"postId":17713,"topicId":2166,"posterId":605,"postTime":1300873959,"postText":">> >>  (Your avatar kinda scares me)  \nAnd if I were to say I thought my avatar looked cute? :O!\n \nThat aside, I'm glad you enjoy my maps, and I hope to keep churning out more and more ya'll could enjoy. This being said, I generally suck at the hard stuff myself in that gamemode XD (ie, \"trickery_adv_b4\"s \"pinpoint\")"},{"postId":17741,"topicId":2166,"posterId":4,"postTime":1300919800,"postText":"I'm pretty sure his avatar is a reference to emoticons and their side-ways-ness\n(:"}]}