{"topicId":2195,"forumId":35,"topicTitle":"Jake Venture's Application","topicTime":1300933588,"topicViews":102,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Jake Venture","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1300938924,"posts":[{"postId":17759,"topicId":2195,"posterId":611,"postTime":1300933588,"postText":"1) What position are you applying for? \nMod on Jail Break/ TTT (either works)\n2) How old are you? (if you prefer to say this in private, just ask): REDACTED\n\n3) Where do you live? (Country, time zone):\nUSA, Eastern Time\n4) Current In-Game Name: \n[NNJG] Jake Venture\n5) Steam ID & Link to your Steam Community page: \nSTEAM_0:0:31215557, http://steamcommunity.com/id/Minotti95\n6) Email Address:\nREDACTED@REDACTED\n7) How long have you been involved (frequent player, moderator, donator, admin) with [NNJG] or Shadow's TTT/Flood/Jail/ server: December 2010\n\n8) What you can bring to the [NNJG] Team (Web/Graphic Design, Lua/other Coder, Moderation, Map Maker, ect.)?: Moderation in TTT and/or Jail, I'm a current student learning web design.\n\n9) Why do you want to be part of the [NNJG]Team?: I think I would make a fine addition to your team.\n\n10 ) Any GMOD/TF2/CSS experience: almost a 100 hrs worth on gmod... (I spend a lot of time on Gmod), TF2 3.1 hrs and CSS: almost a days worth (on this account my original account before it got hacked was mostly made for CSS)\n\n11) Have you ever owned a GMOD/TF2/CSS server?: I had one up in gmod but closed it due to the bugs\n\n12) Do you have a microphone? Do you frequently use it?: yes, I use it a lot..... almost all the time\n\n13) Any other Comments or information you can provide:\n\nI have nothing else :) but thank you for looking this over..."},{"postId":17761,"topicId":2195,"posterId":611,"postTime":1300933697,"postText":"Oh! I have a minecraft server up and running :3"},{"postId":17764,"topicId":2195,"posterId":389,"postTime":1300936036,"postText":"You could have editted that at least.\n\nWell, my opinion (not like it matters i think). I do not support this person by the name of Jake Venture since he is not a regular player of TTT. I believe other players that are regulars would be more suitable for the position of a moderator on TTT.\n\nI believe there will be little to none support for him becoming a moderator on TTT."},{"postId":17765,"topicId":2195,"posterId":272,"postTime":1300936695,"postText":"I have never once seen this person on TTT, and the 10 reccomendations are NOT optional."},{"postId":17766,"topicId":2195,"posterId":611,"postTime":1300936889,"postText":"We must be missing each other because I have been playing :)\n\n_____________________________________________________________________\n\nand can you give me the details on recommendations? Just be like \"yo dawg, would you recommend me to be a mod on NNJG's (insert server here)?\"\n\nAnother reason why you may not remember me is because I changed my steam name from deathwing to Jake Venture... So I thought I should create another account using my current name."},{"postId":17770,"topicId":2195,"posterId":4,"postTime":1300938924,"postText":"I have either never or barely ever seen you on TTT, and you just recently joined our forum 3 days ago. Plus, as Kobooold said, you do need the recommendations.\n\nDenied for now, you can apply again in a few weeks if we need more moderators and if you become more active."}]}