{"topicId":3142,"forumId":14,"topicTitle":"unban request","topicTime":1309824183,"topicViews":203,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"sneekinbye","topicFirstPosterColor":"","topicLastPosterName":"sneekinbye","topicLastPosterColor":"","topicLastPostTime":1315132752,"posts":[{"postId":25020,"topicId":3142,"posterId":896,"postTime":1309824183,"postText":"Your In-Game name:Sneekinbye\nYour Steam ID: STEAM_0:0:9271345\nReason: I was accused of mas RDM i had nothing to do with what happened. some people were Ghosting Fox Mc.Cloud was one of them i don't remember the other ones. but some people decided to kill them until they leave. i finally got sick of it and left. when i tried to log on the next time i was banned\nLength of Ban/Date and time of Unban: permaban\nWhat server were you playing?: Terror Town\nWho banned you?: Kobold\nWhy should we unban you?: this server was the only one i ever played on, i like playing with the people on the server. I never try to rdm people, that is just disrespectful, If you ask around to most of the regulars they will vouch for me. i feel i have been wrongly accused by some children that were being stupid and the mod or admin believed them. nothing against them they are just doing their job."},{"postId":25271,"topicId":3142,"posterId":84,"postTime":1309838975,"postText":"You were banned because of mass rdm that others were also involved with. I had checked the logs, but before I could take action you had left already. I also had been asked to come on and actually deal with you and a few others that day."},{"postId":25280,"topicId":3142,"posterId":896,"postTime":1309865326,"postText":"the only time i ever killed anyone was when \nA. I was attacked.\nB. I was a traitor."},{"postId":25281,"topicId":3142,"posterId":896,"postTime":1309865441,"postText":"But that is cool if you don't want to believe me it is ok. I loved the server but i guess i can find another one to go join."},{"postId":25288,"topicId":3142,"posterId":84,"postTime":1309873800,"postText":"It's not that I didn't want to believe you sneek. Aside from that day I got asked to go on, every other time I saw you playing, you were doing fine and nothing wrong at all. Though, the mass rdm you were banned for shouldn't be mass(since it wasn't mass killing, more mass killers if anything). You can probably be unbanned, since I don't think I specified to Kob, how long the bans were, and it has been at least a month hasn't it?\n\nEDIT: Also, the \"ghosting\" you and others(the banned, and unbanned that you claimed[Fox]), isn't part of this since I couldn't prove it, nor could Fox or anyone else for the matter."},{"postId":25339,"topicId":3142,"posterId":896,"postTime":1309934545,"postText":"Yeah it has been about 2 weeks since this all happened. I apreciate you being straight forward with me, If there is good news then you guys will see me on the server again. i liked playing with you guys. \n\nabout the ghosting i heard the two kids that were with fox admit it on the server but if there is no proof then that is cool. just wanted to share the events that led up to my banning."},{"postId":25341,"topicId":3142,"posterId":84,"postTime":1309940181,"postText":">> Yeah it has been about 2 weeks since this all happened. I apreciate you being straight forward with me, If there is good news then you guys will see me on the server again. i liked playing with you guys. \n\nabout the ghosting i heard the two kids that were with fox admit it on the server but if there is no proof then that is cool. just wanted to share the events that led up to my banning. \nGhosting is hard to prove when you aren't in there when the duration of it is going on. But hopefully Kob or someone else that can unban you sees this. I do believe you deserve a second chance."},{"postId":25389,"topicId":3142,"posterId":896,"postTime":1310031585,"postText":"that is the thing is i was there for the duration. but my word does not mean anything because i got banned i understand"},{"postId":25392,"topicId":3142,"posterId":84,"postTime":1310049072,"postText":"I was actually referring to myself about not being there, not you Sneek."},{"postId":32045,"topicId":3142,"posterId":896,"postTime":1315132752,"postText":"so i am guessing that there won't be a repeal of my ban. i have been very patient but i guess i give up. thank you chopper for trying to help. bye all"}]}