{"topicId":451,"forumId":122,"topicTitle":"Ban Request: HumbleBrick/Brandos","topicTime":1279170833,"topicViews":168,"topicReplies":8,"topicStatus":1,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1279228126,"posts":[{"postId":4193,"topicId":451,"posterId":101,"postTime":1279170833,"postText":"Name: HumbleBrick\nSteamID: STEAM_0:1:26693292\nOffense: TTT: Constantly following me around and RDMing me 6-10 seconds after the round begins. Also a very massive troll. He also ADMITS he does it. However, he only does it when his fellow \"protector\" admin, Brando, is on. Brando is also oblivious to things of the sort.\nAdmins: Brando... even though he is VIP.\n\n\nWOOPS! Evidence... lemme get that real quickly\n\n\n00:27 | Teamkill                  | rufus was beaten up by HumbleBrick\n00:28 | Teamkill                  | Brando8850 was beaten up by HumbleBrick\n00:31 | Innocent killed traitor   | zx was beaten up by HumbleBrick\n00:39 | Body discovered           | HumbleBrick found the corpse of zx\n00:47 | Body discovered           | HumbleBrick found the corpse of rufus\n00:54 | Suicide                   | HumbleBrick couldn't take the strain and killed himself\n\n00:05 | Teamkill                  | bubs was killed by HumbleBrick using a Deagle\n\n00:00 | Game status changed       | The round began\n00:06 | Teamkill                  | Cunt Smasher was killed by HumbleBrick using a Shotgun\n00:09 | Body discovered           | HumbleBrick found the corpse of Cunt Smasher\n00:13 | Innocent killed traitor   | [|THX|] Dum =MC= was killed by HumbleBrick using a Shotgun"},{"postId":4197,"topicId":451,"posterId":47,"postTime":1279198052,"postText":"I kicked him 2 times cause i couldn't ban him, plus I was afk for some rounds so I didn't see the round reports so i couldn't save the logs. Also he claimed a room on multiple occations and said \"anyone who comes in will be killed.\" I have been killed by many other people who do that. After I kicked him he didn't join back. Later that night he joined back and continued to play properly. I have no problem with him being banned for a week, but you also were rdming."},{"postId":4200,"topicId":451,"posterId":6,"postTime":1279210072,"postText":">> \nI kicked him 2 times cause i couldn't ban him, plus I was afk for some rounds so I didn't see the round reports so i couldn't save the logs. Also he claimed a room on multiple occations and said \"anyone who comes in will be killed.\" I have been killed by many other people who do that. After I kicked him he didn't join back. Later that night he joined back and continued to play properly. I have no problem with him being banned for a week, but you also were rdming.\n \nThe playing properly later might have had something to do with me being on."},{"postId":4201,"topicId":451,"posterId":47,"postTime":1279211056,"postText":"I don't understand why you want to get me banned for not doing anything."},{"postId":4204,"topicId":451,"posterId":101,"postTime":1279225876,"postText":">> \nI kicked him 2 times cause i couldn't ban him, plus I was afk for some rounds so I didn't see the round reports so i couldn't save the logs. Also he claimed a room on multiple occations and said \"anyone who comes in will be killed.\" I have been killed by many other people who do that. After I kicked him he didn't join back. Later that night he joined back and continued to play properly. I have no problem with him being banned for a week, but you also were rdming.\n \n\n\n1. I was NOT RDMing in the RDM fest you ENCOURAGED. I only attacked when someone attacked me first. And you say I was RDM like I was walking around shooting everyone, while I was using self defense only. I think you mixed up me and Humble. He was shooting people as soon as he could. Innocent or traitor.\n2. Oh, you were afk during those rounds? Think again.\n\n\nTrouble in Terrorist Town - Round Events Log\n--------------------------------------------------\n TIME | TYPE                      | WHAT HAPPENED\n--------------------------------------------------\n      | Game status changed       | The preparation phase started\n00:00 | Game status changed       | The round began\n00:05 | Innocent killed traitor   | demon7789 was killed by [|THX|] Dum =MC= using a Shotgun\n00:05 | Teamkill                  | bubs was killed by HumbleBrick using a Deagle\n00:06 | Traitor killed innocent   | [|THX|] Dum =MC= was killed by Brando8850 using a Shotgun\n00:12 | Teamkill                  | HumbleBrick was killed by OKTOBEEEEEEEEEEEEEEEEEEERFEEEES using a Shotgun\n00:12 | Body discovered           | Brando8850 found the corpse of demon7789\n00:12 | Credit found              | Brando8850 found 1 credit(s) on the corpse of demon7789\n00:13 | Body discovered           | OKTOBEEEEEEEEEEEEEEEEEEERFEEEES found the corpse of HumbleBrick\n00:15 | Traitor killed innocent   | rufus was killed by Brando8850 using a Shotgun\n00:16 | Body discovered           | OKTOBEEEEEEEEEEEEEEEEEEERFEEEES found the corpse of bubs\n00:19 | Innocent killed traitor   | Brando8850 was killed by hoaftalia using a Deagle\n00:20 | Innocents won             | The lovable and innocent terrorists won the round!\n\n\nCheck 00:06...... You were NOT AFK. However, you WERE traitor. In fact, you were fine with the Random Death Match Fest.\n\n\n3. Let me tell the whole story of the day, yesterday. Everything was fine. HumbleBrick comes on, and I start speaking. Not to him. Just other people. Then about half a second into the round he hits me in the back of the head with a crowbar. I walk around the ship for a bit (ttt_titanic) and eventually we meet up again. Neither have anything against each other. He's like \"Dum why are you hurt. I don't care, I'm going to execute you.\" loud into his mic. So he just randomly circles me and then just kills me. RIGHT IN FRONT OF YOU BRANDO. I know it was right in front of you because a quarter of a second before he killed me I shot at the nearest person I could find, which happened to be you 5 feet away watching. Of course, the shot missed, and I died. Nobody did any effort to kill him. You did not warn him. You didn't do anything but watch and laugh. Later after he died (innocent... just like I was) he said \"It was funny!\" and I was like \"No it's not, jerk.\"\n\nA few hours later, at a different map.... powerplant... me and my 2 friends were on. Both in the same clan as me (one was not wearing tags.... but he has nothing to do with this.) Nothing really happened, except my friend WITH tags on accidentally (ACCIDENTALLY) killed Brando ONCE and he was wrong. Brando got upset and started a voteban against him. He left like half a second before the results because he had to go do something. The voteban stated \"No. User will not be banned.\" So after he comes back like 15 minutes later Brando starts ANOTHER voteban, while he was still in spectator. This one voted yes, and he got banned for a day. Later, the map voted gm_construct. I wanted to get revenge on Humble, so I jihaded him and noone else. His response: \"OH DUDE U SUCK UR A FAIL TRAITUR NOONE LAUGHS AT UR JOKES GO KILL URSELF\"\n\nA few MORE hours later, at Nexus, it was just me, Humble, Brando, and a few others. Humble starts randomly killing as soon as he sees someone, and does not stop, innocent or traitor. Every single round. This started to encourage EVERYONE, INCLUDING BRANDO to start Death Matching. Brando kept going \"Ok guys, I have to go...\" like every round for about 20 minutes. He even started DMing, and didn't warn anyone on their deathmatching.\n\n\n\nStory over."},{"postId":4205,"topicId":451,"posterId":47,"postTime":1279226357,"postText":"I said I was afk some rounds not all of them. Theres a difference between having proof of killing someone and rdming. Killing someone right infront of you is proof enough for killing someone.I didnt start to rdm I had a justified reason for every kill I made. Before I left for the night I kept saying that I would stay until I got traitor so that when I left."},{"postId":4206,"topicId":451,"posterId":103,"postTime":1279226865,"postText":"First off, you have an odd definition of the word troll. You have revenge killed me before on multiple occasions which i don't really care about. But hypocritical behavior aside, you shooting at me is a pretty legitimate reason to kill you. I have claimed rooms before and killed people entering but i follow rules and brando did take action against my Killing of innocents from room claiming Kicking me a few times. And i do not admit to Rdm or trolling. You started taking hostile actions against me when i killed you on suspicion, which you screamed rdm. After a few legitimate kills against you when you were traitor your pretty much started taking the action you claim me to be taking.\n\nI'm not worried about a ban, I'm just here to clean things up. I already willing gave you my steam Id as well because i did not do anything illegal.\n\nAnd on brando's defense, he did take action against me multiple times for room camping and killing non-traitors and a few traitors but otherwise he was following rules fine. \n\nI just think you need to get a better grasp on the rules of TTT, i have played many days worth of the game so i know the rules quite well.\n\nOh yeah and revenge killed me twice, i have the logs. XD \n\nEdit: oh and i just noticed. He claims: \"His response: \"OH DUDE U SUCK UR A FAIL TRAITUR NOONE LAUGHS AT UR JOKES GO KILL URSELF\"\" Really? And you call me a troll? If your going to pose a case against me at least bring legitimate facts to the table. -_-"},{"postId":4207,"topicId":451,"posterId":2,"postTime":1279227202,"postText":"1) You can not kill because you suspect someone\n2) You can not kill because you guess\n3) You can claim rooms, but if someone comes in you must give a 10 second warning for them to leave before shooting\n4) If you kill 2 innocents while you are innocent, you will be slain. If you do not suicide, and admin will take action and slay you.\n5) Logs can be changed, please take screenshots instead."},{"postId":4209,"topicId":451,"posterId":101,"postTime":1279228126,"postText":"Gash, you even saw the logs while he was on... You can see all. How did you not see that? You even tried to ban ZX (which did not work by the way, he was still on)\n\n\nHumble, do you admit to Random Death Matching last night when it was Oktoberfest, Demon, Brando, zs, you, a few other people, and I? Because if you deny this you are a liar."}]}