{"topicId":2887,"forumId":59,"topicTitle":"Tips on computer health","topicTime":1306947225,"topicViews":115,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"cappiman","topicFirstPosterColor":"","topicLastPosterName":"cappiman","topicLastPosterColor":"","topicLastPostTime":1306982323,"posts":[{"postId":23133,"topicId":2887,"posterId":754,"postTime":1306947225,"postText":"Hey guys/gals,\nhere are some pointers for keeping your computer for a longer time.\n\nTip 1: Don't overclock\n\nOver clocking by definition is Running a motherboard or processor at a higher speed than recommended. Over clocking is not recommended due to over heating and is not guaranteed to be stable. This can cause irreversible damage, and may have to replace expensive parts. This is also known as a stress test, or Geek test. ==Edit== It also depends on how fast you overclock your system, if its within 1GHz then you should be fine, but over than that you may run the risk of irreversible damage.\n\nTip 2: CLEAN CLEAN CLEAN!!\n\nClean you computer once in awhile, especially if it is in a high traffic area, ie living room. If you have an air fan then clean that out often so  that way no dust will get in the fan and cause the system to over heat.\n\nTip 3: Put the computer on a shelf\n\nYes a shelf, Static can charge up and once you touch the computer BAM you get ESD (Electro Static Discharge), thus you computer is pffft. Wood is a good insulator so that will help prevent from static getting charged on your computer.\n\nTip 4: Virus scan!!\n\nA virus can cause so much damages these days from frying your mother board to the Processor. Some suggested Virus scans are AVG (free or paid). AVG free can be found on any search engine by typing \"AVG free\". Norton is another one but it does not have a free version and is common amongst computer gamers. These are few virus scanners that are available today. So what does this have to do with Virus scan? Scan regularly it get rid of so many un-wanted cookies and potentially any deadly virus.\n\nTip 5: Take a 30 min break every 2 to 3 hours, helps keep it cool.\n\nTip 6: Keep your computer in a well ventilated area (this should be a duh tip)\n\nThese tips are just a few I have as I am still learning in college kinda figure I could give some tips. Hope these help.\n\nThe hardware repair guy,\nCappiman"},{"postId":23135,"topicId":2887,"posterId":252,"postTime":1306948989,"postText":">> Hey guys/gals,\nhere are some pointers for keeping your computer for a longer time.\n\nTip 1: Don't overclock\n\nOver clocking by definition is Running a motherboard or processor at a higher speed than recommended. Over clocking is not recommended due to over heating and is not guaranteed to be stable. This can cause irreversible damage, and may have to replace expensive parts. This is also known as a stress test, or Geek test.\n \nCan we stop bashing on overclocking?"},{"postId":23136,"topicId":2887,"posterId":754,"postTime":1306949769,"postText":"I don't mind over clocking but it can cause permanent damage, but if the person does want to take that risk then go ahead :D"},{"postId":23138,"topicId":2887,"posterId":237,"postTime":1306950803,"postText":"i overclocked my phone...it gets really hot sometimes (at 140, i have it set to underclock, and past that i have it set to shut off) but it runs some apps better."},{"postId":23140,"topicId":2887,"posterId":377,"postTime":1306951931,"postText":"That's nothing, I Overclock my Clock to move through a Day at twice the speed you guys are, My Goal Is to make it to Dec 2012 by August."},{"postId":23147,"topicId":2887,"posterId":456,"postTime":1306954417,"postText":"Overclocking ONLY causes damage if you mess with the voltages. Just upping the frequency does no damage and if it's not stable then you just revert to defaults. Please give out the whole truth ;)\n\nSource:\nAMD Phenom II x6 Factory: 2.6GHz, Running: 3.38 GHz"},{"postId":23166,"topicId":2887,"posterId":754,"postTime":1306982323,"postText":">> Overclocking ONLY causes damage if you mess with the voltages. Just upping the frequency does no damage and if it's not stable then you just revert to defaults. Please give out the whole truth ;)\n\nSource:\nAMD Phenom II x6 Factory: 2.6GHz, Running: 3.38 GHz \n\nI did, just depends on  how fast  you run it if it is 1 GHz or more then you have a risk of getting your computer damaged."}]}