{"topicId":2825,"forumId":3,"topicTitle":"Someone Clarify","topicTime":1306289710,"topicViews":250,"topicReplies":18,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1308049011,"posts":[{"postId":22718,"topicId":2825,"posterId":634,"postTime":1306289710,"postText":"On 67th way YOU CANNOT kill people for going through the teleporter that leads to the basement. Correct?\nIf this is true then someone explain that to Crisis because he attempted to kill me for going through the teleporter today. See? \nJust thought I'd let you know Crisis."},{"postId":22719,"topicId":2825,"posterId":397,"postTime":1306290149,"postText":"as far as im concerned you are correct that you are right. there a 3 portal entrances\n\nonly exception to that is if the detective has radar and sees no one up stairs anywhere \n\nand some one can not say im killing who ever goes in there cause that is also rdm"},{"postId":22720,"topicId":2825,"posterId":377,"postTime":1306290884,"postText":"This Falls Under the \"Shit Evidence\" catagory of Rdm"},{"postId":22721,"topicId":2825,"posterId":634,"postTime":1306291886,"postText":"my post was more about the rule and me making sure I was correct than crisis's actions. Sorry if I didn't make that clear."},{"postId":22722,"topicId":2825,"posterId":79,"postTime":1306292669,"postText":"Well, lemme clarify something in this regard. I gave out 3 warnings that traitor was in T room and told people very specifically not to go in any teleporters for this reason. Its been done to me and no admin/mod did anything about it when i argued it, so i figured id go ahead and do the same thing.\n\nIts kind of like the no following thing, you warned people many times and they do it so you kill em. Figure with enough warnings its fine. This was also RIGHT after someone got locked in and i immediately said not to use portals."},{"postId":22737,"topicId":2825,"posterId":112,"postTime":1306317032,"postText":"I don't think you can disallow people to use the teleporter."},{"postId":22743,"topicId":2825,"posterId":389,"postTime":1306337802,"postText":">> Well, lemme clarify something in this regard. I gave out 3 warnings that traitor was in T room and told people very specifically not to go in any teleporters for this reason. Its been done to me and no admin/mod did anything about it when i argued it, so i figured id go ahead and do the same thing.\n\nIts kind of like the no following thing, you warned people many times and they do it so you kill em. Figure with enough warnings its fine. This was also RIGHT after someone got locked in and i immediately said not to use portals. \n\nHas the ever happened  when I was here, cause I believe I have never heard of this plan?\n\nWell guys, they are times when u can kill people from using teleporter, as in you have calculated the last remaining traitors (As in u know everyone is a traitor, not like what storm did), and well basically if ur the last innocent alive lol.\n\nOR\n\nwhen u already have a guy confirmed KOS and he drops from the teleporter, yeah u can kill him."},{"postId":22746,"topicId":2825,"posterId":373,"postTime":1306347902,"postText":"You could also try commonsense like whenever the traitor door closes, someone comes from the teleporter.\nIt isn't a good thing to be a creature of habbit"},{"postId":22749,"topicId":2825,"posterId":101,"postTime":1306353201,"postText":">> I don't think you can disallow people to use the teleporter. \n\nJust like you can't disallow people from using the lights on Clue."},{"postId":23215,"topicId":2825,"posterId":634,"postTime":1307061692,"postText":"New Question: Can you kill someone for threatening a detective?\nEDIT: Answer has been recieved; Yes."},{"postId":23228,"topicId":2825,"posterId":389,"postTime":1307069135,"postText":"LOL who threatens to kill the detective?\n\nheres a decent question, \n\nShould admins play last human when theres 1 innocent left?\nor should it depend on situation?"},{"postId":23229,"topicId":2825,"posterId":112,"postTime":1307069511,"postText":">> LOL who threatens to kill the detective?\n\nheres a decent question, \n\nShould admins play last human when theres 1 innocent left?\nor should it depend on situation? \n\nIn my opinion it should only be played when nobody is MIA and/or the traitor admitted it or the innocent already knows.\nAside from that scenario, playing lasthuman is just admin endorsed ghosting."},{"postId":23231,"topicId":2825,"posterId":389,"postTime":1307069988,"postText":"Thats fair enough.\nNext question: Who thinks I should be stricter about the rules? (Kick / Ban Wise =] )"},{"postId":23232,"topicId":2825,"posterId":373,"postTime":1307070352,"postText":"Aren't you supposed to be strict?"},{"postId":23273,"topicId":2825,"posterId":112,"postTime":1307102449,"postText":">> Aren't you supposed to be strict? \n\nYeah\n\n\n>> Thats fair enough.\nNext question: Who thinks I should be stricter about the rules? (Kick / Ban Wise =] ) \n\nI rarely ever see you ban people, and I don't know if its because nobody is breaking rules, somebody else deals with it first, or if it is because you're not strict enough.\n\nIf somebody breaks a rule you need to punish them, simple enough.\nNo exceptions for friends or VIPs.\nNot much more to say"},{"postId":23304,"topicId":2825,"posterId":389,"postTime":1307136417,"postText":"Alright since Pharaoh has said something, its time to take action. *cough* Watch out noobies *cough*"},{"postId":23925,"topicId":2825,"posterId":634,"postTime":1307991613,"postText":"I am continuing this thread to ask another question.\n\nCan we kill for false callouts?\n\nWhen someone says to kill me when I havent done anything I can shoot them right?"},{"postId":24003,"topicId":2825,"posterId":718,"postTime":1308041210,"postText":" Thought i would post here instead of making a new thread about something so small.\nI have a question say this scenario takes place\n\nPlayer 1 is a traitor\nPlayer 2, 3 and 4 are inno\nPlayer 1 says \"Im a traitor and my buddys are Player 2, and Player 3\"\nPlayer 4 kills Player 1 and sees he is a traitor so everyone kills 2 and/or 3.\n\n\nWould Player 1 be breaking any rules by doing that?\n\nI havent seen it happen and dont really plan on doing it but i was just thinking. "},{"postId":24007,"topicId":2825,"posterId":605,"postTime":1308049011,"postText":"To destar, A false callout could be used by the Ts to try to kill off the innocents, so if someone calls you out and your not a T, either they are a T or just plain moronic. Ergo, imo, you can kill someone for a false callout, but odds are they are just some idiot.\n\nAs for Toxic dear's point, its similar to a T calling out an inno as the T. It's furthering their path to winning, albiet in a cheap manner. From what I've seen, if someones says they are T, they die really quickly by the trigger happy community. This means more then likely, this stunt will only net 3 inno kills, which means a jihad is probably a better bet to go with.\n\nThese are strictly from my point of view, but might as well say them since destar went unasnwered, and I assume since these two are the same in a sense, it would as well."}]}