{"topicId":3368,"forumId":122,"topicTitle":"Crisis STEAM_0:0:19239021","topicTime":1311915635,"topicViews":234,"topicReplies":19,"topicStatus":1,"topicFirstPosterName":"obsessivepie","topicFirstPosterColor":"","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1311933424,"posts":[{"postId":26704,"topicId":3368,"posterId":979,"postTime":1311915635,"postText":"Offender name?:Crisis\n-   TTT \n\n-  STEAM_0:0:19239021\n\n-What the Offender did?:Playing on ttt server, I go up a ladder and see crisis blow someone away with a mac10 I then kill him and much to my surprise (not) hes a traitor. Round is over and now he claims I rdmed him and that I need to slay myself, crisis repeated this statement multiple times on mic. I then said he was having his peroid and he shoots me in the head.Crisis never once said I was trolling, he never once warned me to stop talking to him and I only said two things to him minutes apart it wasnt as if I was constantly saying hey crisis fuck you *10 seconds later* \"crisis ur a faggot\". The reason he killed me was because he was mad I killed him when he was a traitor he used my two comments as justification for killing me. revenge rdm. He also rdmed some other guy in the same round claiming his mic cut out or something but im sure crisis has an explanation for that he always does.\n\nAdmins on?:not sure at the time, I was kicked for trolling later after I assume crisis showed screenshots of me to an admin where I was telling crisis to stop crying in chat After he rdmed me.\n\nProof?:I forgot to get a damage log when he killed me but he admitted to it in chat anyway, also I was talking to crisis in chat while he was responding in voice chat. I have a few screens of what I said and of crisis's karma\n http://steamcommunity.com/profiles/76561197991800294/screenshot/578929766363085588?tab=public \n\n http://steamcommunity.com/profiles/76561197991800294/screenshot/578929766363084651/?tab=public  - apparently I was  warned   many times  not to troll.NOPE.\n\nhttp://steamcommunity.com/profiles/76561197991800294/screenshot/578929766363086406/?tab=public this is me trying to reason with crisis, I did get frustrated due to his constant asking me to slay myself so I called him a fag.\n\n http://steamcommunity.com/profiles/76561197991800294/screenshot/578929766363105762/?tab=public  partial damage log showing him killing an innocent I killed him right after he shot him."},{"postId":26708,"topicId":3368,"posterId":612,"postTime":1311918123,"postText":"REDOING THIS POST\n\nPie killed crisis for killing me when it looked like i pushed mortos off the roof.\ncrisis called rdm on pie for killing crisis when he had enough \"reason\" to kill me. (reason in quotes because crisis knew mortos walked off, but used it to his advantage because he was T)\nthats all im explaining.\ni have the whole event recorded...again.\nwant the demo? link---> LIES. Mark has the demo. sent it at 2:23am EST 7/29/11\nvia teamviewer.\nDemo details:\njump to 55000 frames.\nit goes on for a while\nnot sure when it ends\n\nBTW admins on: only Quack.\n\n\nPS> the demo is VERY long. ill look over it to give you a time or frame number. if you need help about forwarding through the demo ask me.\nEDIT\nnot gonna get super involved. i just wanted to provide what eveidence i have. not sided in any way. good day chaps.\n\n\n\nDO NOT POST UNLESS DIRECTLY INVOLVED\n\n>> The other person he rdm was me i was following him and he said to stop on 3 and he counted 1....2....kill i would have stopped when he said three but he said his mic cut out and i was inno \nthis is true BTW he said his mic cut out on the third one. i believe him."},{"postId":26712,"topicId":3368,"posterId":706,"postTime":1311921029,"postText":"The other person he rdm was me i was following him and he said to stop on 3 and he counted 1....2....kill i would have stopped when he said three but he said his mic cut out and i was inno"},{"postId":26716,"topicId":3368,"posterId":79,"postTime":1311921737,"postText":"Real quick ill explain my situation. I warned Obsessive to stop follow/trolling me and he continued to do it for several rounds. I asked votekicks and gags/mutes from the vip and they all refused to do anything.\n\nOn fudge my mic cut out on saying 3 so im sry bout that, but if i remember correctly you kill on the third warning not after. (correct me if wrong on this)\n\nI have 2 pictures of Obsessive trolling me if i need to post them for any significant reason. Also asked Quack to get on and after a Admin logged on he mysteriously stopped trolling, but as said Quack was supposedly log on to do something about obsessive for trolling again. Overall i don't think i deserve a ban because without vip or anyone doing anything about his trolling and him non-stop doing it till a admin logged on. I had enough and most of it was over mic (i cant record so im s.o.l. on that proof)\n\nAnyway, the proof you have isnt any proof. Wow, i id'd bodies, i told you to post ban after you've been trolling, you took a snip of the dmg logs instead of entire thing to try and prove your own innocence. Overall, you trolled, you rdm'd, and you want me banned for it. All the proof you say you have doesn't show me doing ANYTHING other then id'ing and the chat talk is made from console, so how is it known i made it, other then the fact that im admitting to it.\n\nThe only proof you have is of Corey recording it, and god only knows whats on it. If i get banned i will be shocked because of the blatant trolling that was done which can set anyone off when no one does anything about it."},{"postId":26723,"topicId":3368,"posterId":979,"postTime":1311922564,"postText":"proof is in the video crisis you think that you can get away with anything by blaming others"},{"postId":26725,"topicId":3368,"posterId":115,"postTime":1311923018,"postText":"Yes, I was asked to enter the server after Crisis asked me to. Of course I was skeptic of the situation he was explaining to me. I asked for some proof from him, and after seeing some of it, decided to get on.\n\nOnce I was on, I asked several of the members I trust what was the deal with the sitiation. They explained not much but Obsessive was warned multiple times to stop following Crisis. They also said Obsessive wouldn't stop following Crisis.\n\nYour proof on him not saying warnings is false. He uses his mic most of the time, not his chat. \n\nHis karma doesn't matter, as mistakes happen. And if what I heard is true, then his karma is low for killing you for the RIGHT reasons."},{"postId":26727,"topicId":3368,"posterId":979,"postTime":1311923291,"postText":"except I stopped following him after he gave me two warnings, then he rdmed me"},{"postId":26729,"topicId":3368,"posterId":79,"postTime":1311923574,"postText":"Just figured id post his troll comments. Yes, these are trolling comments, not random funny things to say....\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/578929766362916606?tab=public\nHim telling me to keep crying.\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/578929766362886233/?tab=public\nHim saying im on my period.\n\n2 Troll remarks he typed over chat instead of saying on his mic like he normally does. I warned him not to troll when he spammed his mic the first 2-3 times. Again, don't have proof of his verbal trolling since i cant take video or fraps. Would also like a copy of the video sent to me, i believe i have every right to see it."},{"postId":26730,"topicId":3368,"posterId":979,"postTime":1311923635,"postText":"Playerhater I know ur watching this or anyone else that plays regular with me. I NEVER USE A MIC so crisis is blatantly lying.\n\n\njust so you dont erase\n---------------------------------------------------------------------------------------------------------------------------------------------------\n\nJust figured id post his troll comments. Yes, these are trolling comments, not random funny things to say....\n\nhttp://steamcommunity.com/id/hidden_ass ... tab=public\nHim telling me to keep crying.\n\nhttp://steamcommunity.com/id/hidden_ass ... tab=public\nHim saying im on my period.\n\n2 Troll remarks he typed over chat instead of saying on his mic like he normally does. I warned him not to troll when he spammed his mic the first 2-3 times. Again, don't have proof of his verbal trolling since i cant take video or fraps. Would also like a copy of the video sent to me, i believe i have every right to see it."},{"postId":26731,"topicId":3368,"posterId":79,"postTime":1311923739,"postText":"Ive heard you over mic a few times. Saying NEVER and hardly ever are 2 different things. You barely ever use a mic, but i have heard you. Either way, im done posting till i either see video or hear verdict."},{"postId":26732,"topicId":3368,"posterId":979,"postTime":1311923928,"postText":"I dont even have a mic crisis you have  never  heard me speak before. also why would you lie when an admin has the video?"},{"postId":26733,"topicId":3368,"posterId":79,"postTime":1311924258,"postText":"Guess i need to clarify this. A warning isn't a day to day basis, i didn't say you trolled today other then those 2 things. I said you've been warned not to troll me. Again someone who doesn't understand the simple phrases of their own language. I have told you to stop trolling me several times on different days, regardless of the day you trolled a warning DOES NOT disappear over a few days. I have told you to stop trolling and even a admin has told you. I have 2 pics of you trolling me today. The 2-3 times i warned you weren't exactly from today honestly, they have been over time. It's been from you trolling with following me randomly, or you typing/talking. You say you don't have a mic or talk, but i can almost guarantee you have talked before unless someone used your name."},{"postId":26734,"topicId":3368,"posterId":979,"postTime":1311924610,"postText":"unless you got proof thats all hearsay. I do not troll you every time you login into ttt I have not \"trolled\" you any time, those two comments you boast so proudly as your evidence were due to you crying about me \"rdming\" you and trolling you which were both lies. You were mad that I killed you when you were traitor you retaliated by killing me when we were both innocent.\n\nI dont want to turn this into a flamewar so unless you have proof then let the admin with the video decide."},{"postId":26735,"topicId":3368,"posterId":79,"postTime":1311925010,"postText":"Un-needed comments are trolling, those 2 comments were blatant troll attacks. Defending my own view is not flaming either, it is showing the side you refused to mention. Corey could have pushed Mortos of the edge who jumped. I killed Corey, you were standing behind me and just shot. When i talked with Corey about it being rdm, he mentioned you being behind me watching. So overall that means you saw mortos fall, you had to of heard them talking bout him pushing Mortos, which gives me reason to kill Corey. You ignored the entire situation and blatantly gunned me down before i could even identify the body in fact. So overall on your rdm:\n\n1) Mortos talking bout Corey gonna push him.\n2) Mortos looked like he got pushed by Corey.\n3) I gunned Corey down for it.\n4) You watched and blatantly gunned me down after the situation.\n5) I asked you to slay yourself for rdm.\n6) You refused and Corey said he would kick you for it. (never actually started a votekick)\n7) You start following me and trolling me.\n8) I kill you.\n9) Calling me another name and threatening to ban request from shit you started.\n\nMind you, calling someone names is personally attacking that person as well as trolling. So name calling in itself is breaking 2 rules. Specially when your not joking and dont apologize or person doesn't like you joking about it."},{"postId":26736,"topicId":3368,"posterId":979,"postTime":1311925105,"postText":"actually I came up the ladder when you started shooting..not when he pushed him. I had no knowledge of anyone being pushed all I saw was you shooting someone with a mac10 its that simple. I dont think anyone should take anything you say seriously in this thread since you lied about me harassing you over the mic. I hope a regular can get in here to verify that I never use a mic."},{"postId":26737,"topicId":3368,"posterId":612,"postTime":1311925158,"postText":"I am uploading the video as we speak.\nSCRIBBLE SCRIBBLE\n\n\nquality is shit for a few hours while it is processing"},{"postId":26739,"topicId":3368,"posterId":79,"postTime":1311925715,"postText":"Mind you i did say i killed him for trolling me again. That part i wont dispute. Bottom line is, he started to troll again and i have mentioned i've had enough. Following = trolling in a sense, and since no one seems to care when i get trolled, least the VIPS dont. I have no way to stop it other then kill them after several warnings. Again, the 2 pics i have show his trolling and my case of having to stop it some how since no admins were on and Quack was having trouble getting into a full server. If im just to post evidence of trolling then can something be done about it when i post it. Cause so far nothing has been done to repeated trolls towards me other then warnings. (Overall this is the 3rd or so time i told Obsessive to stop trolling me(Dont have pics of other cases since i delete stuff after bout a week or its dealt with, didn't take pics of his previous bs))\n\nAlso, do you record every round Corey, or just rounds that im on. Cause awfully suspicious you randomly have videos of this shit.\n\nIm going to sleep, so if i get banned i will promptly follow it up with a appeal of anything else that may need be said as well as a ban request in proper format when i find out his steam id. I do expect this one be taken seriously, since for whatever reason you 100% ignored my last few ban requests. (dont show favoritism, all my ban requests are real and expect them to be taken so. Ones been up for several days without a proper response. *hint hint*)"},{"postId":26740,"topicId":3368,"posterId":612,"postTime":1311926185,"postText":"destars contests has me recording at all times incase of epic moment. chill, the worlds not out to get you"},{"postId":26741,"topicId":3368,"posterId":54,"postTime":1311926251,"postText":"http://www.mediafire.com/?x4qyuquc0fsm1l6\nplaydemo a_2\nOrignal demo. (skip to 55000) and do shift + F2 to actually DO that.\n\nand a shitty quality youtube video\nhttp://www.youtube.com/watch?v=IatSJAH1rMs\n\nHave a good week away from TTT, Crisis. This is your second offense, you JUST got unbanned yesterday.\n\nEdit: I talked about the decision with Quack, we both decided the ban length and ban decision itself."},{"postId":26746,"topicId":3368,"posterId":54,"postTime":1311933424,"postText":"Also, Obsessive, I'm gonna need you to add me on steam so I can talk to you.\n\nhttp://steamcommunity.com/id/MonkeyFire"}]}