{"topicId":3826,"forumId":22,"topicTitle":"Credit Bonuses","topicTime":1314517621,"topicViews":75,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1314570048,"posts":[{"postId":31108,"topicId":3826,"posterId":82,"postTime":1314517621,"postText":"Credit Bonuses can be \"tasks\" that make the game more fun for everyone on the server, encourage teamwork, to make use of all features offered in the game and discourage rdm. Credit Bonuses build upon the idea of 10 points for 30 minutes of gameplay. They work like this: No innocents, detectives, traitors are teamkilled for a round? Good job! Everyone is rewarded with a few points. Each round in succession the same task is complete, the stakes become higher. Nothing absurdly high, but enough to make people want to attain the points at the end. There could be other Credit Bonuses, but this seems to me like the most easy to implement.\n\nComments, critiques, ideas?  Discuss "},{"postId":31123,"topicId":3826,"posterId":517,"postTime":1314545924,"postText":"Most, interesting my young padawan, i most certainly support this"},{"postId":31134,"topicId":3826,"posterId":243,"postTime":1314552361,"postText":"Very similar to something I suggested before, but this is new, I support this.\n\nMy ideas: if your team wins, you get extra points, if no one on your team dies, you get extra points, if you get more than five kills (NOT TEAMKILLS), you get extra points."},{"postId":31155,"topicId":3826,"posterId":82,"postTime":1314558872,"postText":">> Very similar to something I suggested before, but this is new, I support this.\n\nMy ideas: if your team wins, you get extra points, if no one on your team dies, you get extra points, if you get more than five kills (NOT TEAMKILLS), you get extra points. \nGreat minds think alike!"},{"postId":31168,"topicId":3826,"posterId":634,"postTime":1314560870,"postText":"Remember when gash added some extra features the help you gain points fast and then took it away after one day?\nHe added extra points for not dying and for doing well in a round.\nI think cooperative server efforts would be awesome though (No team kill for an entire round), of course you'd need to have like an 8 person minimum for this so it can't be farmed easily."},{"postId":31185,"topicId":3826,"posterId":956,"postTime":1314564948,"postText":"This seem like a great idea i support."},{"postId":31188,"topicId":3826,"posterId":1,"postTime":1314566327,"postText":"I like these ideas. I support."},{"postId":31199,"topicId":3826,"posterId":605,"postTime":1314570048,"postText":">> Credit Bonuses \nPoint Bonuses :O!\n\nBut ya, making it so that no innos kill another innos would make some people wait alot longer before shooting someone, because they want points, or in another situation, it would make trolls more likely to rdm, to prevent everyone else from getting the points. \nOther then these situations, I'd like this idea :o, Minus the whole \"each round the stakes become higher\"... I can just see like 4 people on the server exploiting it, and eventually getting 10+ extra points per round. Imo, 1 or 2 points per round per player for no rdm kills sounds good enough, but I wonder how hard it would be to code..."}]}