{"topicId":821,"forumId":26,"topicTitle":"GOOD EVENING, EVERYONE.","topicTime":1284525083,"topicViews":120,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"Meathook","topicFirstPosterColor":"","topicLastPosterName":"Meathook","topicLastPosterColor":"","topicLastPostTime":1284597646,"posts":[{"postId":7712,"topicId":821,"posterId":113,"postTime":1284525083,"postText":"Hello there, I am Meathook, but you can call me \"Almighty God.\"  I have been playing on the server regularly since June of the great year of 2010.  I was browsing through the forums, and noticed that I had never posted anything in the Introduction section.  After crying in the bathtub about it for 37 hours straight, I realized : \"Hang on, Meathook!  You can still post!\"  So, I triumphantly strided to my computer and turned it on, and typed in nonerdsjustgeeks.com in the internet window that I just opened before I typed it, went here, and wrote this post!  As soon as I clicked the \"New Topic\" button, I screamed : \"HELLO WORLD, MEATHOOK IS MY NAME!!!\"  to absolutely no one.  Well, that's about all I can muster right about now.  I hope that everyone is doing fine, and that reading this in the morning won't make me wonder what the fuck I was doing.  The End."},{"postId":7719,"topicId":821,"posterId":101,"postTime":1284576707,"postText":"Before June, I remember you from before I took my break, which was about January XD\n\n\nEDIT: That or I often mix up you and Bird."},{"postId":7722,"topicId":821,"posterId":113,"postTime":1284582863,"postText":"Well, I guess you have me confused with Bird.  I started no earlier than June.  :D"},{"postId":7723,"topicId":821,"posterId":112,"postTime":1284585994,"postText":"Ohello thar, just wondering but after crying for 37 hours, was there enough water for somebody to take a bath? :3"},{"postId":7727,"topicId":821,"posterId":113,"postTime":1284593853,"postText":">> Ohello thar, just wondering but after crying for 37 hours, was there enough water for somebody to take a bath? :3 \n\nEnough bath water for me and my beautiful Brazilian secretary Lola."},{"postId":7729,"topicId":821,"posterId":4,"postTime":1284595706,"postText":"she's your secretary?\nwell sorry but she looks like a slut and i couldnt help myself"},{"postId":7735,"topicId":821,"posterId":48,"postTime":1284596391,"postText":">> she's your secretary?\nwell sorry but she looks like a slut and i couldnt help myself \n\n^^ Basically Kry's way of acting like he did something with her,\nwhen really he just walked over, got rejected, and went home to fap."},{"postId":7736,"topicId":821,"posterId":4,"postTime":1284597248,"postText":"you know me too well <3"},{"postId":7738,"topicId":821,"posterId":113,"postTime":1284597646,"postText":">> she's your secretary?\nwell sorry but she looks like a slut and i couldnt help myself \n\nOh, its cool man.  There's nothing between us.  I'm just trying to get to her secretary's secretary's dog's secretary, Eva.    So, by all means..... go to town."}]}