{"topicId":3382,"forumId":14,"topicTitle":"Obsessivepie","topicTime":1311984649,"topicViews":251,"topicReplies":24,"topicStatus":1,"topicFirstPosterName":"obsessivepie","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1312258938,"posts":[{"postId":26872,"topicId":3382,"posterId":979,"postTime":1311984649,"postText":"Your In-Game name:ѺЬᵴεᵴᵴɨvεþɨε\n\nYour Steam ID:STEAM_0:0:15767283\n\nReason:Trolling\n\nLength of Ban/Date and Time of Unban:2800hours\n\nWhat server were you playing?:TTT\n\nWho banned you?:Pharaoh\n\nWhy should we unban you?:Well first off i'm a regular on this server this is my first offense I play just as much as crisis does yet I make a few comments in anger against crisis since he complained and demanded I slay myself, so he rdms me and was banned for it yet he gets to call me a little bitch and kill me then gets banned for a week AND he was just recently unbanned for traitor baiting. \n\nvideo evidence showing the entire incident in question where I made \"trolling comments\"  http://www.youtube.com/watch?v=IatSJAH1rMs \n-in the video you can clearly see me JUST coming up the ladder and witnessing crisis kill that inno I did not see mortos fall off.\nI do admit to making blatant comments calling crisis a fag and what not but that was because he was asking vips to votekick me off the server and continually asking me to slay myself for rdming him which in the video I clearly did not as he was a traitor and I saw him kill an inno.\n\nSo he calls me a little bitch in voicechat then he shoots me while we are both innocent and I get perma banned for first offense trolling comments and he gets a week ban?\n\nI would accept a ban maybe a for a few days but 2800 hours seems way too much especially when crisis lied in my ban request thread about how I harassed him in mic chat which has never happened and good luck finding anyone on the ttt server that has ever heard me speak because I dont own a mic."},{"postId":26873,"topicId":3382,"posterId":79,"postTime":1311986562,"postText":"In all honesty i requested you slay yourself and when you refused even though it was rdm. I asked a VIP to votekick you. Neither of those happened and i left it at that until you made trolling comments. If you wanna lie about not having a mic and never talking fine. But don't lie about how the course of events happened."},{"postId":26874,"topicId":3382,"posterId":979,"postTime":1311986775,"postText":"crisis did you even watch the video? you can clearly see me just coming up the ladder the moment you start shooting him which in my mind I came up the ladder, I see you aiming at someone, you open fire and I shoot you. And the fact that you claim I mic harass you is fine, i'll be talking with mark later and ask that he go and speak with playerhata,mimey moon, corey or any regulars and ask if any of them have heard me use a mic before hopefully you get whats coming to you for lying about it."},{"postId":26876,"topicId":3382,"posterId":397,"postTime":1311988169,"postText":"TTT\tObsessivepie (STEAM_0:0:15767283)\tTrolling\t08:16 26 Nov 2011\tPharaoh\n\nsorry for not being involved but i checked our bans page and was shocked at the length of time"},{"postId":26877,"topicId":3382,"posterId":79,"postTime":1311988605,"postText":"Btw, we can not go off of hearsay. You say you don't have a mic, i believe you do. Regardless of what others say can't be taken into effect. Either way, lets say you don't have a mic. You have still trolled and gotten warned before. I may not have pictures but if were going off hearsay then me saying it is enough.\n\nOverall lets just assume you don't have a mic. The ban length might of been a mistake, i don't know. Im not the one who banned you. Either way, I havn't lied and like i said before, people have recently been trolling others names, so it could of been someone using your name a previous time. We can't go off hearsay, you have to have proof. Since there is no way to prove you don't have a mic or do have one we have to leave it at that."},{"postId":26878,"topicId":3382,"posterId":979,"postTime":1311988830,"postText":"I can only assume crisis that you told an admin I was constantly harassing you over the microphone which is a lie, I played ttt last night and people were saying you should be perma banned for claiming I spammed you over the mic since they have played with me for weeks and I have not uttered a single word over mic chat.\n\nas per request not giving out names"},{"postId":26880,"topicId":3382,"posterId":79,"postTime":1311989220,"postText":">> Btw, we can not go off of hearsay. You say you don't have a mic, i believe you do. Regardless of what others say can't be taken into effect. Either way, lets say you don't have a mic. You have still trolled and gotten warned before. I may not have pictures but if were going off hearsay then me saying it is enough.\n\nOverall lets just assume you don't have a mic. The ban length might of been a mistake, i don't know. Im not the one who banned you. Either way, I havn't lied and like i said before, people have recently been trolling others names, so it could of been someone using your name a previous time. We can't go off hearsay, you have to have proof. Since there is no way to prove you don't have a mic or do have one we have to leave it at that. \n\nI re-utter myself, someone could have used your name. Its not something that difficult to do. If i made a mistake, sry bout it. But people want me perma'd from their own personal grudges. If nothing else this proves people have been attacking me for no reason. Also, again. I have no clue if the ban length was a mistake or not. I posted a ban request on 2 accounts of trolling, and that's it. Nothing else was involved in my ban request. I mentioned you were warned and that's about it. It's easy to make a mistake for someone who 'doesn't have a mic'' and someone using the name to troll. My name was recently trolled the other day and i feel people thought it was me.\n\nAgain, if i made a mistake i am sorry. I'm not against saying sorry when i in-fact make the mistake. If you want to solve some of the issues, maybe get a mic if you honestly don't have one, that way people can recognize you by voice, not by typing."},{"postId":26884,"topicId":3382,"posterId":979,"postTime":1311989574,"postText":"so now you're saying some imposter posing as me with my name which is ѺЬᵴεᵴᵴɨvεþɨε started trolling you? has this been happening often crisis because I have never seen someone impersonating me and trolling you over mic chat and I doubt anyone else has.\n\nand to me this statement you said earlier sounds like you were implying that I was harassing you in the same game where that video footage was taken from\n\nCrisis says: 2 Troll remarks he typed over chat instead of saying on his mic like  he normally does . I warned him not to troll when he  spammed his mic the first 2-3 times . Again, don't have proof of his verbal trolling since i cant take video or fraps. Would also like a copy of the video sent to me, i believe i have every right to see it."},{"postId":26887,"topicId":3382,"posterId":79,"postTime":1311990163,"postText":"General misconception. Didn't once say they all were in same day. Ill specify next time I guess. Didn't really think specifications on times and dates were always needed. But will do next time. You also don't have to be on the server for someone to use your name either. Also, no one says that anyone you personally know is on or maybe no one caught it. But someone with your name in lower cases was on the server at a previous date and was trolling.\n\nThis will be my last post so it doesn't look like a flaming forum post. My suggestion would be wait for the admin in question who banned you to make a post since he would have to be the one to un-due a non-perma ban i would believe. Or Gash if he looks at the post. I have some questions for a few people involved in this, but ill do that over steam chat."},{"postId":26893,"topicId":3382,"posterId":612,"postTime":1311991483,"postText":"As an innocent bystander, i demand you leave my name out of this. im sure moon would like that too. neither of us said that.\ni speak for moon because he is away.\n\nalso crisis. i didnt ignore you a few minutes ago. internet cut out. message me again\n\nalso. crisis. download the whole demo. obsessive pie doesn't say one word. he  does not have a microphone."},{"postId":26894,"topicId":3382,"posterId":979,"postTime":1311991763,"postText":"actually those words were said last night when I was on and you gave me the 15 points"},{"postId":26895,"topicId":3382,"posterId":79,"postTime":1311991817,"postText":"Then it must have been someone using his mic a previous day. I apologize then Obsessive."},{"postId":26897,"topicId":3382,"posterId":979,"postTime":1311991952,"postText":"I could understand a perma ban if I had harassed you over a series of days with my mic but I do not have a mic so you have to look at it from my perspective. I said 3 negative comments minutes apart from each other, you called me a complete bitch and then killed me then I get perma banned."},{"postId":26898,"topicId":3382,"posterId":612,"postTime":1311992057,"postText":">> actually those words were said last night when I was on and you gave me the 15 points \nnope.avi\ni dont want a perma. for one, this ban had nothing to do with me. why would i ask for a perma? you can talk to mark. he was in vent the whole time discussing the demo with me"},{"postId":26899,"topicId":3382,"posterId":79,"postTime":1311992186,"postText":"Just looked at ban length, its 2 months long. Prolly a mistake or mistype. Like i said, wait till whoever banned gets on and comments or talk with them. I hardly ever ask for a perma-ban myself. Normally in extreme cases or when admin on and see's non-stop. I would have been fine with a few days to a week. Hope it gets settled soon. Good Luck"},{"postId":26900,"topicId":3382,"posterId":979,"postTime":1311992232,"postText":"why did you give me 15 points when I logged onto ttt"},{"postId":26902,"topicId":3382,"posterId":612,"postTime":1311993101,"postText":"because you posted a ban request on crisis, that does not mean i want a perma"},{"postId":26903,"topicId":3382,"posterId":979,"postTime":1311993291,"postText":"I never said you did I just said you were there. anyways it would be nice if I had some clarification on my 2900 hour ban for saying 3 negative comments"},{"postId":26906,"topicId":3382,"posterId":634,"postTime":1311993562,"postText":"Just wait for pharaoh guys."},{"postId":26944,"topicId":3382,"posterId":112,"postTime":1312034624,"postText":"It was supposed to be a two day ban. I mistyped. Whoops >.>"},{"postId":26957,"topicId":3382,"posterId":979,"postTime":1312054434,"postText":"thats reasonable, when I saw banned for trolling 2900 hours I was like 0.o"},{"postId":27080,"topicId":3382,"posterId":153,"postTime":1312117589,"postText":"How did you confuse 48 with 2900?"},{"postId":27099,"topicId":3382,"posterId":112,"postTime":1312134949,"postText":">> Ben\":108idcms]How did you confuse 48 with 2900? \n\n2880 minutes = 2 days."},{"postId":27360,"topicId":3382,"posterId":153,"postTime":1312251213,"postText":"oic"},{"postId":27371,"topicId":3382,"posterId":2,"postTime":1312258938,"postText":"Late, but unbanned. Sorry!"}]}