{"topicId":4656,"forumId":22,"topicTitle":"Amaxing traitor wep","topicTime":1319591877,"topicViews":224,"topicReplies":22,"topicStatus":0,"topicFirstPosterName":"Radiored","topicFirstPosterColor":"","topicLastPosterName":"Radiored","topicLastPosterColor":"","topicLastPostTime":1320618711,"posts":[{"postId":36381,"topicId":4656,"posterId":1123,"postTime":1319591877,"postText":"Now i haven't really brainstormed on this for long but it seems like a cool traitor weapon.\nId be a regular pistol but it shoots out two balls attached with a rope between them. The main concept is a lasso type deal but it leaves the Innocents immobile or restrained to a wall. It may seem cheap but there could be a health sacrifice for the wepon or something"},{"postId":36382,"topicId":4656,"posterId":634,"postTime":1319592260,"postText":"A bola?\n http://www.flight-toys.com/bola/bola1.gif \nhttp://www.flight-toys.com/bolas.htm"},{"postId":36392,"topicId":4656,"posterId":1094,"postTime":1319596629,"postText":"1.  Should probably be moved to TTT Suggestions, although I think an admin has to do it.\n2.  Seems cool, but I don't know what function it would have.  Would it leave them alive and restrained?  Seems pointless in that case since they would just call you out, although it'd be funny to stick them to a ceiling (plus most people would just buy a knife or betrayal).  More elaboration please, sounds neat in concept."},{"postId":36398,"topicId":4656,"posterId":612,"postTime":1319599258,"postText":"Maybe add a gagg to it and a 15 second movement timer."},{"postId":36400,"topicId":4656,"posterId":101,"postTime":1319599937,"postText":"Moved to suggestions.\n\nAnd for the 4 billionth time, making a weapon gag would be a pain in the ass to code."},{"postId":36429,"topicId":4656,"posterId":612,"postTime":1319651026,"postText":"But possible."},{"postId":36452,"topicId":4656,"posterId":101,"postTime":1319669305,"postText":"If you want it go find someone who will code it / code it yourself. It would be very possible (I am assuming, I'm not an expert) to make it happen, it's just that it would probably conflict with SM a ton."},{"postId":36675,"topicId":4656,"posterId":1123,"postTime":1319919736,"postText":"well i havent searched around to find the sugjestion page but i sure as hell would use it if you could gag the person"},{"postId":36782,"topicId":4656,"posterId":1109,"postTime":1320039143,"postText":"i think this should be a detective weapon not T\ndetective suspects could be guy but no definite proof, only one T left, attach him to wall and see if any killings occure\n\nnot sure wat T would use this for other than trolling cross map innos?"},{"postId":36787,"topicId":4656,"posterId":605,"postTime":1320046089,"postText":">> i think this should be a detective weapon not T\ndetective suspects could be guy but no definite proof, only one T left, attach him to wall and see if any killings occure \n\nIf a normal T learned/saw this occuring... the best option would be to delay the round so that the D would think its the guy they tied up. Ergo, this sort of idea would only delay the round."},{"postId":36793,"topicId":4656,"posterId":1087,"postTime":1320063629,"postText":"Well why not have the bola only tie them up/pin them for say, 10-15 seconds...just enough to catch up to that run away T or pin that inno to the wall who witnessed knife a guy."},{"postId":36909,"topicId":4656,"posterId":1123,"postTime":1320192178,"postText":"No this would give too much power to the detective because a detective with dna and a bola would freaking merc, say a detec did have dna tho and he was by himself, the T could then use the bola to tie up the D Rope him to a wall just to witness his demize, now id love for this to be a wep, wed need to make sure they cant do the bind that \"THIs persons a traitor!\" but other than that itd be a pretty badass wep."},{"postId":36913,"topicId":4656,"posterId":1087,"postTime":1320196146,"postText":"It could pin facing wall? And add a drop to it so you have to arc it like the knife throw. This way you cant just whip it down from one end of the hallway on LostTemple *SpikeRoom* to the other end. Also coudl be used to attach a prop to a wall maybe.\n\nI:E. Bola a Explosive barrel to the wall, then shoot it when a inno gets close..maybe even to the ceiling so they dotn see it. Or can use it to pin ot the wall \"Heavy Object\" Then shoot the bola making the prop drop on the inno/detective/etc."},{"postId":36938,"topicId":4656,"posterId":634,"postTime":1320258956,"postText":"This is starting to sound more like a spiderman web shot that a bola to me. Both sound pretty cool though."},{"postId":36941,"topicId":4656,"posterId":612,"postTime":1320259074,"postText":"Decided: spider man. \nAs long as it isn't a one hit kill I'm good."},{"postId":36963,"topicId":4656,"posterId":1087,"postTime":1320270947,"postText":"Why not just make it a Net, that has spikes around it to stick to walls?"},{"postId":36977,"topicId":4656,"posterId":1123,"postTime":1320276152,"postText":"either way it sounds beastly, id prefer the bola because it would restrain, i didnt say it would kill it could be possible to have some damage when hit, if we stick with a bola idea it could wrap around the body or legs to where you can just pick the person up with magneto stick and or rod then attach to a wall, The spiderman idea also might be handy but then again if shot theyd attach to the wall behind them and that could cause a problem to where the T wants the body to be, When they are restraint with the bola this would allow the T to quickly take out anotherinno because there have been multiple times i wish i could have put one person to the side quickly. I know this is a suggestion but i think its a good idea."},{"postId":36980,"topicId":4656,"posterId":634,"postTime":1320276336,"postText":"http://www.youtube.com/watch?v=5hCe1YPP9nw\nnet launcher from predator.\n\nattaches person to the wall, someone has to crowbar them off before the net crushes them."},{"postId":36983,"topicId":4656,"posterId":1123,"postTime":1320277366,"postText":"i thought about it, seems like itd be a good kill wep, maybe crowbar the 4 pins that stick into the wall possibly? With the bola maybe you could crowbar it off aswell or shoot a restraint, I've also thought about another weapon, maybe it could be a possiblity for a net drop onto someone. Use a gun to shoot where the nets 4 ties would be and whenever the next person walks under it would drop and hit them"},{"postId":37059,"topicId":4656,"posterId":1087,"postTime":1320373293,"postText":"I think there should be a like a little Sentry Gun, that shoots one laser when someones walks by and deal 50 dmg then blows up to deal another 10 to anyone near."},{"postId":37145,"topicId":4656,"posterId":1123,"postTime":1320515649,"postText":"ehhhh id still stick to my bola, you control it yourself, itd be cool to have like a sentry that you place in a corner thats small and has a wep attached like a harpoon and you control it yourself."},{"postId":37241,"topicId":4656,"posterId":1087,"postTime":1320553999,"postText":"Yah, and it can spear people, multiple if they are in a line. Then expodes*0 dmg*, it should also be remote controlled."},{"postId":37336,"topicId":4656,"posterId":1123,"postTime":1320618711,"postText":"Sweet, too bad no one would take the time to make any of these weapons :p so were basically just talking"}]}