{"topicId":3332,"forumId":1,"topicTitle":"Steam Gifts","topicTime":1311732971,"topicViews":125,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Domineeto","topicLastPosterColor":"","topicLastPostTime":1313038944,"posts":[{"postId":26388,"topicId":3332,"posterId":82,"postTime":1311732971,"postText":"A lot of people will think this is a scam with good reason, and now having received my first game, and giving 2 things away. I can assure you this ain't a a scam. It works on a cumulative point system, for every $10 given away on the site, 1 point is given out to EVERYONE currently signed up! You start off with 25 points if I am not mistaken. Since it's launch just over  one month  ago it has gained a vast following of generous people.\n\nStats As Of 26/07/2011:\n7,945 Members\n2,558 Gifts\nGifts Valued at $32,905.69\n\nThere has been a sudden increase in members, so entries on popular giveaways have gone from less than 300 to upwards of 800, but eventually everyone will win! It is and will forever be invite only so if you want and invite just talk to me. Good Luck!\n\nView Giveaways And Sign Up "},{"postId":26396,"topicId":3332,"posterId":856,"postTime":1311734680,"postText":"I would like an invite Please ;3."},{"postId":26409,"topicId":3332,"posterId":517,"postTime":1311737656,"postText":"ive been with that site a while won tfc 100% legit"},{"postId":26429,"topicId":3332,"posterId":243,"postTime":1311742740,"postText":"<3\nI think its amazing to have that many people sign up already, to make it invite only.\nAnd I would love an invite! :D"},{"postId":26442,"topicId":3332,"posterId":82,"postTime":1311756903,"postText":"D: Registration is currently disabled due to Humble Bundle #3, you need at least $30 worth of games on your account to prevent multiple accounts and the bundle makes this security measure useless. Sorry D:"},{"postId":28546,"topicId":3332,"posterId":82,"postTime":1313038944,"postText":"If anyone wants a key, I have 2 extra keys available for free!!! PM me of contact through steam, I would put them in this post but I fear someone I dislike would get a hold of one olol first come, first serve!"}]}