{"topicId":3921,"forumId":104,"topicTitle":"Brink","topicTime":1314927678,"topicViews":86,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"cappiman","topicFirstPosterColor":"","topicLastPosterName":"The Ungrateful Dead","topicLastPosterColor":"","topicLastPostTime":1315172216,"posts":[{"postId":31732,"topicId":3921,"posterId":754,"postTime":1314927678,"postText":"Brink what do I have to say? Lets see, combine mirrors Edge and Call of Duty you get brink. The goal of the game is move more than you shoot. You will go through health quickly if you don't move more often than you shoot. In this game you can do fancy moves call parkour (pardon my spelling). You can slide in to cover, peek around corners, which is very useful if you are using a sniper, and jump over railings, boxes, ect., this provides excellent opportunities for a surprise when you are using a grenade launcher or a machine gun with buffed damage. In this game you can customize your gun, and you character, but be careful some traits on your character cannot be undone, such as scars and tattoos. There are three body traits that you can use, Heavy, medium, and light, which has their own guns and abilities (see in game for which guns you can use). This game has map-able buttons or preset game controls which you can use, even has Call of Duty and Gears of War presets if you play those games more often. This game however has major glitches in the game that you can use which will effect the game play experience. With all of this concerned I am giving it a 4 out of 5. I recommend this game for people who are new to FPS or just want a game that is semi serious."},{"postId":31761,"topicId":3921,"posterId":517,"postTime":1314936061,"postText":"Bought it, crashes on startup :C"},{"postId":31876,"topicId":3921,"posterId":754,"postTime":1315022708,"postText":">> Bought it, crashes on startup :C \nFor what?"},{"postId":32102,"topicId":3921,"posterId":693,"postTime":1315172216,"postText":"I hated Brink, the Ai was so bad it just ruined the game for me.\n\nThen again, still haven't played the Agents of Change DLC, so they may have patched it up.\nIf not, the next DLC should be the \"Good AI\" DlC for like $5"}]}