{"topicId":4632,"forumId":14,"topicTitle":"Mr Derpa Unban Request","topicTime":1319433132,"topicViews":66,"topicReplies":1,"topicStatus":0,"topicFirstPosterName":"Mr Derpa","topicFirstPosterColor":"","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1319517717,"posts":[{"postId":36222,"topicId":4632,"posterId":1150,"postTime":1319433132,"postText":"  First of all:  \nI've tried to add two of the admins from the server to steam so I could at least ask why I was banned and get some closure but only one of them have had the guts to accept the friend request & actually talk to me...\nI've even got a friend to go onto the server to ask them to accept the invites & they have refused to tell him why I was banned & they won't accept the invitation.\n\n 1) Which server: \n[NNJG] Trouble In Terrorist Town [ US / FastDL ]\n\n 2) Your in-game name: \nMr Derpa\n\n 3) Your SteamID: \nSTEAM_0:1:23240412\n\n 4) When were you banned and for how long: \nI was banned at 3:50 PM eastern Australian time on the 25th of November, 2011 & i was banned PERMANENTLY.\n\n 5) Reason for ban: \nWhen i first joined the server I was bunnyhopping around the map for fun & when asked to stop I first asked why & then I proceeded to stop but after the round was finished a random player screamed into the microphone\n\" I SAW MR DERPA BUNNYHOPPING! \". I got kind of irritated by that & I admit that I was rude to the player because It honestly was none of his business & I didn't even know him.\nApart from that I haven't done anything wrong & I was playing on the server semi-afk for the next 20 minutes after that before I was suddenly banned without any consulting.\n\n 6) Who banned you: \nMark\n\n 7) Why should we unban you or shorten your ban period: \nI don't believe it is right to ban someone without consulting them or at least letting them know what is happening.\nTo my own knowledge apart from bunnyhopping LEGITIMATELY ( I DID NOT USE A SCRIPT ) I haven't done anything to break the rules & I really do enjoy Trouble In Terrorist Town & I know all of the rules, I've been playing it for over a year now on a variety of servers & it feels bad to be banned. I'm a nice guy but I can get irritated at times & I want to take the time to apologise to the person I yelled at if he ever sees this thread & I promise if I can play on the NNJG server again I won't bunnyhop & I won't be rude to other players.\n\nThank you for reading & reviewing my unban request & I hope you unban me or at least shorten my ban to non - permanent."},{"postId":36311,"topicId":4632,"posterId":54,"postTime":1319517717,"postText":"There's no rule at all for bunny hoping, but when you're using a script there's a problem. I suspected you from the start, because it LOOKED like a script from the start. I speced you, and you were right on time every single time with NO delay, which led me to believe you had a script. No, I didn't ban you off assumption. I consulted with two other admins, and we did a little research, and we came to the conclusion you had some sort of hack. It wasn't just my decision, so i'll let the other admins involved respond as well. To be honest, you seemed like a nice person and all, but we don't allow hacks. It's just that simple."}]}