{"topicId":4362,"forumId":126,"topicTitle":"puz_revelations (prize topic)","topicTime":1317295963,"topicViews":68,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1317550343,"posts":[{"postId":34536,"topicId":4362,"posterId":605,"postTime":1317295963,"postText":"It's nothing too major, just 1,000 puzzle points, and one room for a puzzle to be specified by you.\nAll you gotta do is a take a screenshot of each of the 6 secret images, with the pictures in plain sight while on the nnjg server, thats it. I'll even start you off with an easy one, as soon as you spawn in the map, back up, and your in a secret room.\nOf course, any form of cheating will discredit them from this award. Also, nutter is void from part of this contest, as he is already getting his own map, along with the man/woman who beats puz_trickery_exp in under 30 mins without a skip. *cough* not happening *cough*\nThis being said, if nutter were to post all of the images first, he would recieve the points, but the later prize would still be up for grabs.\n\n\nNote: The really hard secret room one does not count to this total, both because its nigh impossible to get to, and just wouldnt be fair to add in to the requirement.(You'd know it by what's in the secret room, if you're lucky enough to find it/cheat)\nNote2: I decided it would be better to seperate this from the actual changelog/map topic, just in case this topic gets spammed with images, I wouldn't want it to disrupt any comments about the map itself or its changelogs."},{"postId":34541,"topicId":4362,"posterId":517,"postTime":1317301053,"postText":"Udane me boyo, im on the case"},{"postId":34547,"topicId":4362,"posterId":612,"postTime":1317313953,"postText":"I WON\n http://k.minus.com/jbqV5ETNb5OgoD.jpg \n http://k.minus.com/jbgxjs5Q6t9ycF.jpg \n http://k.minus.com/jbleOyYC3eO1Q8.jpg \n http://k.minus.com/jA0HDl90MKKK7.jpg \n http://k.minus.com/jRYbscnpiDk2o.jpg \n http://k.minus.com/jWxwyXOciHkgF.jpg "},{"postId":34697,"topicId":4362,"posterId":605,"postTime":1317550343,"postText":"Late reply was late, but he did in fact win, and as thus, the reward was up to him to be used as he saw fit, he already regifted it ;p"}]}