{"topicId":313,"forumId":3,"topicTitle":"Brando/Moderators","topicTime":1276651569,"topicViews":202,"topicReplies":12,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"[NNJG] Cake","topicLastPosterColor":"","topicLastPostTime":1276728095,"posts":[{"postId":2938,"topicId":313,"posterId":79,"postTime":1276651569,"postText":"Theres normally not a moderator on the server bout half the time, and Brando doesn't seem to be using his moderator privelages correctly. While he's on i continually get rdm'd and nothing is really done about it. Was traitor and one guy kept calling me out as traitor since start of round when all i had was a crowbar, then i get killed by him and he does NOTHING, not even warn the guy about doing it."},{"postId":2939,"topicId":313,"posterId":26,"postTime":1276652654,"postText":">> \nTheres normally not a moderator on the server bout half the time, and Brando doesn't seem to be using his moderator privelages correctly. While he's on i continually get rdm'd and nothing is really done about it. Was traitor and one guy kept calling me out as traitor since start of round when all i had was a crowbar, then i get killed by him and he does NOTHING, not even warn the guy about doing it.\n ''\n\nHumble apparently claimed you had a knife, I wasnt there so i dont have a say. \n\nBut yeah."},{"postId":2947,"topicId":313,"posterId":79,"postTime":1276653462,"postText":"So if i say u have a knife and u NEVER had it out, its k to kill everyone as long as there a traitor? If thats the way it works then ill use that excuse and when i get banned i will flame the forums non-stop. If all i gotta do is claim something."},{"postId":2958,"topicId":313,"posterId":48,"postTime":1276658310,"postText":":/ \n\nI wasn't there so I really don't know what to say about it....\nBut you shouldve saved a text log and posted it on the forums with the offenders steam id's to get them banned.\n\nEven as an admin, if you don't actually see it happen you can't just jump in and start banning people because other people say to.\nYou need visual proof :/"},{"postId":2989,"topicId":313,"posterId":26,"postTime":1276663068,"postText":">> \nSo if i say u have a knife and u NEVER had it out, its k to kill everyone as long as there a traitor? If thats the way it works then ill use that excuse and when i get banned i will flame the forums non-stop. If all i gotta do is claim something.\n \n\nClean up your posts, i understand shit.\n\nIf you DID have a knife, you could kill them, or if a detective weapon scans you and finds a knife in your inventory they can kill you\n\n\n@deth\n\nI wasnt here, brando was the one that told me about it, and since i wasnt there i never took action"},{"postId":2990,"topicId":313,"posterId":79,"postTime":1276664194,"postText":"I dont think people understand. I was a traitor. No detective was around me and he blames me non-stop for being a traitor even before the round starts. All a text log would say is, he killed a traitor. It's not proof of anything since at that point he could say, well he shot me and i just defended myself or i saw him with a knife. The whole problem was over chat. He said he saw me with a knife, which i never did anything with but bought it. U cant save replays in the game so i cant have any viable proof since everything was over chat. My whole thing is that the moderator on (Brando) didn't say a word about it even tho i was shot right next to him. The argument im making has nothing to do with anything the text logs could show. Im smart enough to know what to do with text logs if they are viable (im innocent and other guy was too) but when one is traitor while other is not, a text log wouldn't do anything for me. The other problem im having is when i talked with brando during the game, he didn't do anything. Then i get threatened when i took matters into my own hands, all i want is a viable admin/moderator on during the day so stuff like this doesn't keep happening, since every time brando is on, rdmers dont seem to have any consequences brought upon them."},{"postId":2991,"topicId":313,"posterId":55,"postTime":1276688069,"postText":"I was there rainrain and crisis got rdmed Yesterday so many time and same for me humm brando was there yeah he tried to kick one but he left ;_; lol But yeh brando should take time to listen ppl.And crisi yeh me i understand you i was there :D but i can't do nothing about it so.. sorry :("},{"postId":3001,"topicId":313,"posterId":39,"postTime":1276704663,"postText":"But the fact of the matter is that you DID have a knife.\nHe may have had a weapon scanner, cause even if he wasn't detective, he may have picked it up off a dead guy/"},{"postId":3002,"topicId":313,"posterId":79,"postTime":1276706990,"postText":"Start of round = no dead detective, he had ZERO ways of knowing it was me. Which if u read ud realize that there wouldn't be anyone dead at the time he accused me."},{"postId":3004,"topicId":313,"posterId":39,"postTime":1276708515,"postText":"Alright I don't know who you are, but don't talk to us like that\nyou've proved 0 proof to support your claims, and 0 proof to prove that he had no way of finding out you were traitor\nFor all you know the detective could have dropped the weapon scanner and the other guy picked it up.\nOn top of that there have been glitches in which owning a knife may accidently turn your gun model into a knife model.\nSo don't come yelling at us because you have 0 evidence to support your claims."},{"postId":3005,"topicId":313,"posterId":79,"postTime":1276709580,"postText":"Lol, i think this is funny that u think your that important. I talk to whoever however i want, im not gonna be scared off with tail between legs because of admins/moderators. Theres no proof i can get that will show u who's right or wrong, because everything that was said wasn't typed. And please dont get all defensive when i say very few things. I havn't even really insulted anyone on here. If ur a little hurt from my words thats too bad. I posted on here because i was told to after talking with Gash about what happened. I told him nothing would be solved from making a post here, this is just a way to get everyone's opinion on what happened. Clan members always stick together and theres prolly very few actual outside posts from here. I just wanted to hear what people had to say and see how much they would back up there own clan members. Even tho my main complaint is about a guy who isn't a member."},{"postId":3009,"topicId":313,"posterId":39,"postTime":1276712697,"postText":"If you don't have proof we can't ban\nEnd of discussion"},{"postId":3015,"topicId":313,"posterId":13,"postTime":1276728095,"postText":"I didn't read any of these confusing posts, No Refunds I behalves you need to chastise them :), but I just want to say I agree with Crisis these \"new admins\" are ridiculous. You know who you are and ones I trust I have talked to you about it, with all due respect to The Big 3, you rushed into these new guys. Most of them don't know how to properly admin, and there are too many times I have been called by disgruntled server goers saying that server is out of control, and the nerve when I find out there are already mods on! Most of the time, with them going crazy with \"new powers\", they do more damage than good, and I have seen while in disguise mass amounts of people leaving server when mods get stupid."}]}