{"topicId":3378,"forumId":1,"topicTitle":"Need update on the rules and things that can be done.","topicTime":1311969972,"topicViews":136,"topicReplies":12,"topicStatus":0,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"__Crisis","topicLastPosterColor":"","topicLastPostTime":1312098079,"posts":[{"postId":26824,"topicId":3378,"posterId":79,"postTime":1311969972,"postText":"First and foremost the most important thing. Trolls.\n\nIf there are no admins on and VIPs refuse to do anything what are normal players supposed to do? (Recently asked admins/mods to get on and no one came for 20-30 minutes)\n\nI believe that we should be able to do something if they troll over normal chat, since we dont want to wait an hour while being trolled for something to get done. Or maybe just start forcing VIPs to start taking action.\n\nAdmins/mods maybe being a little more respectful when asked to hop on to deal with something real quick instead of waiting forever to help. I know no one wants to deal with 20-30 minutes of trolling with NOTHING being done.\n\nAlso, for once and for all. CAN WE GET A HARD PROOF DEFINITION of trolling, every admin has a different opinion, but something that is a rule needs a hard definition of what the hell it is."},{"postId":26836,"topicId":3378,"posterId":397,"postTime":1311972015,"postText":"vips are not staff just an upgraded regular player, but i do try my best to keep the server under control when staff are away.\n\ni honestly dont believe trolling it self is against the rules but actions that trolls do like rdm/mic spam/hacking."},{"postId":26838,"topicId":3378,"posterId":769,"postTime":1311972693,"postText":">> vips are not staff just an upgraded regular player, but i do try my best to keep the server under control when staff are away.\n Same. If you personally have a problem with someone, please tell us. We don't know how it feels to be Crisis and we can't tell for sure if someone is trolling you, so please let us know and then we can attempt to deal with the problem with gags or votekicking.\n\nI'm on the server in most of my free time and I've rarely heard you ask us to take action so this:\n>> Or maybe just start forcing VIPs to start taking action. is something that you yourself should be doing."},{"postId":26852,"topicId":3378,"posterId":79,"postTime":1311978141,"postText":"Perfect example. other day i asked vips to do something and that someone was trolling. They still refused to take action. VIPs have some power for a reason, not to abuse but to benefit. At least 5 VIPs on and none did anything when i asked. So overall would like some mods/admins to start forcing VIPs to take action once in awhile. Maybe start having VIPs gag/mute instead of the admin doing it even if they are on, to maybe make it so VIPs are used to doing something.\n\nYou can tell its a troll comment because a comment that gets a negative emotion/response is trolling. If i respond in a negative matter, its obvious i don't like what they said."},{"postId":26855,"topicId":3378,"posterId":397,"postTime":1311978890,"postText":"like i said vips are not staff. we dont have to do anything, we are just players like you. \n\nthat being said i am repeating my self that i do try to keep the server under controll"},{"postId":26864,"topicId":3378,"posterId":634,"postTime":1311980918,"postText":"VIPs aren't obligated to take any action.\nIf you want to have the VIP powers to use Crisis, why not donate 10 bucks?"},{"postId":26866,"topicId":3378,"posterId":769,"postTime":1311981744,"postText":">> VIPs aren't obligated to take any action.\nIf you want to have the VIP powers to use Crisis, why not donate 10 bucks? Or better yet, 5 bucks! \n\n/shameless advertisement"},{"postId":26921,"topicId":3378,"posterId":54,"postTime":1311997681,"postText":">> VIPs aren't obligated to take any action.\nIf you want to have the VIP powers to use Crisis, why not donate 10 bucks?  Actually, VIPs are obligated to take action. If he is being trolled, don't watch it happen, do something.\n\nSo, starting today, I'm going to be giving warnings and bans for trolling, if I get complaints of another player trolling someone else, and I see it with proof, I'm going to take action. No one enjoys being trolled, and it's no longer going to happen. This matter has been addressed to the other admins and mods, and it will be taking effect by ME in general asap.\n\nTrolling: In Internet slang, a troll is someone who posts inflammatory, extraneous, or off-topic messages in an online community, such as an online discussion forum, chat room, or blog, with the primary intent of provoking readers into an emotional response or of otherwise disrupting normal on-topic discussion. (Yes, I googled this)"},{"postId":26931,"topicId":3378,"posterId":237,"postTime":1312008123,"postText":"farrow, where are your gifs?!\n\nAHEM. crisis, dude, if nobody is listening, steam chat. \nWhen i see blatant trolling i usually gag, but we can't mute and idk if it's votekickable. Even then democracy fails often. Also as was said, the line between fun and trolling depends on the people. A clear \"Please stop\" should be given."},{"postId":27023,"topicId":3378,"posterId":634,"postTime":1312083417,"postText":"Sorry Mark but I say bullshit. We don't have to do anything. We gave 10 bucks because we like the community. If we chose to help (like most of us do and should) it is because it is the right thing to do. You don't take on responsibility when you give the community money, that's just doesn't make sense to me. I'm not discouarging people from doing the right thing but I am saying that you shouldn't get demoted for NOT doing anything (which is what you are implying)."},{"postId":27042,"topicId":3378,"posterId":706,"postTime":1312088120,"postText":"VIP usually always do something to the trolls of they keep on trolling but most of the time no one is trolling!!!"},{"postId":27048,"topicId":3378,"posterId":612,"postTime":1312088595,"postText":">> VIP usually always do something to the trolls of they keep on trolling but most of the time no one is trolling!!! \nThis."},{"postId":27070,"topicId":3378,"posterId":79,"postTime":1312098079,"postText":">> >> VIP usually always do something to the trolls of they keep on trolling but most of the time no one is trolling!!! \nThis. \n\nMost don't understand term trolling which isn't a recent event. If it makes someone react with a negative emotion its normally trolling. Name calling is the most typical trolling that isn't thought of as bad. I personally don't see an issue calling a group idiots for watching me get knifed in front of them and miss it. But calling someone a minge or other things directed at 1 person and only 1 person is normally trolling. This is something that most VIPs don't do something against, and tbh i have very solemnly seen a VIP do anything to blatant trolls as well. Mic spam is another form of trolling, but most of the time dealt with immediately, same with RDM. I believe the issue comes down to mainly name-calling and following.\n\nWhich brings me to another rule that i think needs a little clarity. The rule of stop following me warnings 1-3.\n\nPlayer A and B\n\nPlayer A warns B to stop following.\n5-6 seconds later Player A warns B to stop following.\nPlayer B walks away for 30 seconds.\nPlayer A then warns B to stop following again.\n\nShould that third warning in the same round be constituted as warning 3, or is there a time frame on if they start blatantly following you again that the warnings reset. In my personal opinion, if they start following you again in a area where its blatantly obvious they following you directly, you should count it as third warning regardless of time frame and kill them. This is of course if this is all done in the same round. I believe the next round you'd have to start at warning 1 again and if continued following/trolling in this manor continues report them. Any ideas?"}]}