{"topicId":2527,"forumId":104,"topicTitle":"Minecraft!","topicTime":1304184229,"topicViews":178,"topicReplies":4,"topicStatus":0,"topicFirstPosterName":"Cake","topicFirstPosterColor":"","topicLastPosterName":"TheWarBoy","topicLastPosterColor":"","topicLastPostTime":1305456742,"posts":[{"postId":20198,"topicId":2527,"posterId":710,"postTime":1304184229,"postText":"Ok, this is a review for the SUPEREPICAWESOMEDUCKYOMGWTFBBQ game, Minecraft.\n\nCreativity. In the world of minecraft, you gather resources from caves or in the open or from animals/monsters. You use them to build almost ANYTHING. This is what I love most about minecraft, the amount of things you can make! You can craft doors, make windows, fortresses, castles, the list could go on forever. I give it a 9/10\n\nExploring. Deep in the world of minecraft, there are deep and dangerous caves, that have either monsters, or very valuable materials. There are very dangerous things though, called Monster Spawners. These objects spawn monsters, and LOTS of monsters. Near the monster spawner, is a very evil looking atmosphere, mossy cobblestone, mushrooms, but you get a reward. A chest with useful and some valuable items, like saddles for riding pigs :3. I give it a 9/10 also.\n\nMultiplayer. In minecraft, there is a multiplayer function. There is lots of different gametypes, from building to spleef to the original minecraft, like collecting items together and making cities. But on the downside, there are the hell of multiplayer, GRIEFERS. Griefers are trolls or kids that like to destroy stuff for fun. *cough* AVO *cough*. For multiplayer, it's still a bit glitchy, but a 7/10 will do.\n\nSo, overall, minecraft is about 8.5/10. I recommend this game GREATLY, as it is cheap and is only a 50mb download."},{"postId":20208,"topicId":2527,"posterId":521,"postTime":1304190622,"postText":"This game rapes\n\nI gief it a 9001/10"},{"postId":20477,"topicId":2527,"posterId":636,"postTime":1304313652,"postText":"i love minecraft and give it a 9.5/10 on everything. ( havent played multiplayer yet tho put app to be put on whitelist for nnjgs server xD)"},{"postId":20555,"topicId":2527,"posterId":634,"postTime":1304373764,"postText":"Minecraft will never be finished... ever.\n\nBut even incomplete as it is it is still amazing!"},{"postId":21852,"topicId":2527,"posterId":720,"postTime":1305456742,"postText":"i Give this game a 9.5/10 Lots of things to do its butiful but [glow] CANT A GUY MAKE A GOLDEN PENIS WITHOUT A DAM CREEPER [/glow] 3:<"}]}