{"topicId":4259,"forumId":122,"topicTitle":"Marzu RDM/Propkill and Leave","topicTime":1316563813,"topicViews":59,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"Loliconvict","topicFirstPosterColor":"","topicLastPosterName":"Playerhata27","topicLastPosterColor":"009900","topicLastPostTime":1316572750,"posts":[{"postId":33918,"topicId":4259,"posterId":1094,"postTime":1316563813,"postText":"Offender Name: Marzu\nWhich Server: TTT\nOffender's Steam ID: STEAM_0:1:424\nAdmins on: No.\nProof:\n http://cloud.steampowered.com/ugc/542906046389137640/948BF329E39974D9ED7F72BFAD34A93B5E5D40E8/ \nFirst he propkilled Rainbow, using explosive barrels.  Unfortunately I didn't catch on until it's too late but you can see him laughing and such.\n\n\n\n http://cloud.steampowered.com/ugc/542906046389134259/991A3BF2F99CF4D92038852F4F895182D41E2492/ \nI injured him first here, because I was given a warning about him prop pushing with the barrels and he started doing the same to me.  I warned him verbally, and after several times and him pushing me and the prop injuring me, I shot the barrel to stop it.  He proceeded to kill me while I didn't fight back, then left immediately afterward.\n\n\n\n http://cloud.steampowered.com/ugc/542906046389136121/5B28CB04B29988505E10BAE5D4E7DF2E308A431E/ \nHere is the pic of him leaving immediately after he killed me and was subsequently killed.\n\nI don't know if this is really substantial, I'm not aiming to get him perma'd or anything, but still.  He deserves at least a bit of a ban for it.  Sorry about the lack of logs from the game before."},{"postId":33937,"topicId":4259,"posterId":812,"postTime":1316572750,"postText":"You don't really have much evidence of the prop killing, as this would be hard to document anyway without video proof, but seeing other players in-game say the same thing it's apparent that he was causing a problem\n\nI'll ban him for 3 days for propkilling and leave.\n\nLocked.\n\nEdit:You have the incorrect Steam ID here, but luckily I found his ID by looking through my recent players. Next time please provide the correct ID."}]}