{"topicId":1844,"forumId":12,"topicTitle":"death at spawn","topicTime":1297201247,"topicViews":122,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"jesus","topicFirstPosterColor":"","topicLastPosterName":"Bird Flu","topicLastPosterColor":"000099","topicLastPostTime":1297614679,"posts":[{"postId":15499,"topicId":1844,"posterId":371,"postTime":1297201247,"postText":"i just want to know exactly what causes it, sometimes i spawn as a prisoner and right when i do i die. does anyone know what this is? if you do can someone fix it"},{"postId":15532,"topicId":1844,"posterId":456,"postTime":1297228858,"postText":"With all due respect, jesus, if you can walk on water, you should be more than able to fix this yourself."},{"postId":15537,"topicId":1844,"posterId":438,"postTime":1297235254,"postText":"Are you on the mars map? If so, it must be the doors. If you are standing right next to them when the guards open them, it's a strange glitch that kills you. If not on mars, you must be glitching with another player or something."},{"postId":15539,"topicId":1844,"posterId":366,"postTime":1297239336,"postText":"I have no idea what you're talking about."},{"postId":15559,"topicId":1844,"posterId":372,"postTime":1297289284,"postText":"It is not the doors.  It occurs as soon as the next round begins.  Sometimes for me it would say I suicided in the console.  I'm guessing it couldn't find a place for me on the map so it killed me.  I'm not sure but it defiantly is not only for him.  Also, I've only had it happen on the map Mars."},{"postId":15562,"topicId":1844,"posterId":371,"postTime":1297292111,"postText":"ya its like what mario said, it only happens at mars and right when you spawn, it used to happen a lot before but lately it hasn't happened a lot to me"},{"postId":15742,"topicId":1844,"posterId":389,"postTime":1297477575,"postText":"Its most likely, there isnt enough spawn points for the number of players as prisoner. (That is, if this is like CS 1.6, where people just die cause not enough spawn points)"},{"postId":15810,"topicId":1844,"posterId":3,"postTime":1297614679,"postText":">> Its most likely, there isnt enough spawn points for the number of players as prisoner. (That is, if this is like CS 1.6, where people just die cause not enough spawn points) \nThat is correct."}]}