{"topicId":2011,"forumId":1,"topicTitle":"A Beautiful Story","topicTime":1298862766,"topicViews":281,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Radiophobia","topicLastPosterColor":"990000","topicLastPostTime":1299208691,"posts":[{"postId":16536,"topicId":2011,"posterId":4,"postTime":1298862766,"postText":" © 2011 -  Kryzoid Publications  \n Scrolling down without reading first could expose yourself to spoilers! Please don't \"TL;DR.\" \n\n\n\"Oh fuck.\"\nThis is all Matthew Gash could think to say as him and his son stormed down the halls of the Steam City Hospital after they were found to be late to the birth of Matthew's once close friend, Chase McStealth. \"Dad...are we almost there...i'm...i'm getting tired of all this running.\" his son uttered. NNJG was Matthew Gash's son's name. Gash thought it was unique as symbols instead of an actual name like most common names entitled to children these days.\n\"Almost, I promise.\" Gash replied.\nAs the two raced to a corner, they stumbled into a familiar looking nurse.\n\"Right this way, Mr. Gash.\" the nurse said.\nMr. Gash and NNJG walked into the hospital room and panted as they witnessed Gash's former friend Chase McStealth on the hospital bed, about to give birth in the miracle of life.\n\"Sorry we're late, man.\" Gash said.\nStealth grunted.\n\nGash and Stealth had been fighting days before the time Stealth was scheduled to give birth, as such their bond as friends was weak.\nThe hospital room was an average sized room with a medical bed on which Chase McStealth lay, connected to a stabilizer and several other machines next to the bed. There was a window on the side of the room opposite to the door, and a few chairs situated at the foot of the bed and corner of the room.\n\n\"Sit on that chair over there.\" Gash gestured to NNJG.\nAs NNJG sat down on a chair in the corner of the room, Stealth's stabilizer began to beep uncontrollably.\n\"Mr. Gash, i need you to sit down next to NNJG, the baby is coming!\" the nurse said.\nGash quickly jumped to a chair next to NNJG as they witnessed the doctors now entering the room gathering close to Stealth's hospital bed.\n\"ARGAGAGAAAAAHHH\" Stealth screamed.\n\"Doctor, we need to deliver it immediately, the time has come.\" the nurse said.\nOne of the doctors nodded and began working.\n\"McStealth, liste-\"\n\"AAAHHHHHHHHHH!!!!!!!!!!!!!!!!\" Stealth interrupted.\n\"MCSTEALTH, I NEED YOU TO LISTEN CAREFULLY.\" the doctor stated. \"I need you to push as hard as you can, we're going to get you through this.\"\n\nTension increased in the room as Gash and his son were on the edge of their seats, their hearts pumping in regards to what was happening.\n\n\"PUSH!!!\" the doctor said.\nChase McStealth's stabilizer began to emit smoke from the top.\n\"Doctor, something is wrong.\" a nurse said.\n\"What is it?\" the doctor replied, looking over at the stabilizer.\n\nAt this point, the stabilizer was literally breaking from the inside.\n\n\"The baby...may not survive the birth.\"\nNNJG stood up and approached the nurse.\n\"WHAT?!\" he said.\n\"ASHDGSHHDSHHDHHDH\" Stealth exclaimed.\n\n-----------------------\n\nA rift of light appeared through the window of the hospital room as McStealth's screams were drowned in the essence of brightness entering the area.\n\n-----------------------\n\n\"Congratulations, Mr. McStealth, it's a....erm...\"\nThe doctor turned and whispered to the nurse intently for the next several minutes.\nGash, NNJG, and Stealth, now catching his breath, waited anxiously at what was to come.\n\n\"Friends, we have some bad news.\" the doctor said.\n\"What is it, tell us the baby is safe!\" Gash replied.\n\n\"...It seems that your baby is, in fact, a boy...\"\n\nCheers errupted from the people in the room.\n\n\"...However, it was born without a penis.\" the doctor explained.\nA tear dropped from Chase McStealth's eye.\n\n\"You can't be serious doctor, this can't be happeni-\" Gash began to say.\nStealth rose from his hospital bed and turned to the doctor.\n\"It's my son... and i will t-t-take him even if the loss of any ....limb ...makes him that much more disabled. He is perfect in my *cough* eyes.\" Stealth uttered.\n\n\"What are you going to name your dickless child?\" Gash asked.\n\nThe words escaped his mouth before he could stop them.\nStealth angrily kicked Gash into the wall of the opposite side of the hospital room, knocking him and his son NNJG unconscious.\n\"I want my new son's name to be unique, i guess you could say a bit like that sorry excuse for a friend's son NNJG.\" Stealth said.\n\nThe nurses attempted to calm McStealth as a birth had just occured.\n\"I know.\" Stealth said.\n\n\n\n\n\n\n....\n\n\n\n\n\n\n\n\"I'll call him S3G.\""},{"postId":16540,"topicId":2011,"posterId":525,"postTime":1298864462,"postText":"the relation between the penis and s3g.."},{"postId":16541,"topicId":2011,"posterId":101,"postTime":1298869829,"postText":"TLDR: S3G is like our baby except we are better."},{"postId":16546,"topicId":2011,"posterId":112,"postTime":1298898287,"postText":"Lewlewlewlewl"},{"postId":16556,"topicId":2011,"posterId":48,"postTime":1298926417,"postText":"S3G is for the dickless?\n\nSo NNJG it is for me."},{"postId":16566,"topicId":2011,"posterId":373,"postTime":1298932195,"postText":"Kry that story was beautiful, you should write novels!"},{"postId":16569,"topicId":2011,"posterId":2,"postTime":1298933313,"postText":">> Kry that story was beautiful, you should write novels! \nHey I was the one to say that in the shout box >:("},{"postId":16580,"topicId":2011,"posterId":373,"postTime":1298938580,"postText":">> >> Kry that story was beautiful, you should write novels! \nHey I was the one to say that in the shout box >:( \n\nNOU"},{"postId":16585,"topicId":2011,"posterId":4,"postTime":1298941780,"postText":"Thanks for such a positive response.\nI have considered a career in writing and might go for it in later years, the only thing stopping me is my laziness."},{"postId":16730,"topicId":2011,"posterId":272,"postTime":1299203395,"postText":"This story is relevent to my interests."},{"postId":16733,"topicId":2011,"posterId":252,"postTime":1299208691,"postText":"When will this marvelous story be available for purchase in iBooks?"}]}