{"topicId":862,"forumId":22,"topicTitle":"Can we please get rid of this damn mic limiter?","topicTime":1285179372,"topicViews":148,"topicReplies":12,"topicStatus":0,"topicFirstPosterName":"Ungrateful Dead","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1285363770,"posts":[{"postId":8160,"topicId":862,"posterId":39,"postTime":1285179372,"postText":"I mean, for starters, is Mic Spamming REALLY that much of an issue to start with. I've seen maybe one or two mic spammers on the server in my entire time playing on NNJG.\n\nIts hinders players more than it helps. Not only do you focus too much on the meter when your talking, but if the meters out and your getting shot, well then I guess your screwed.\n\nSeriously, I think (most of) the VIP plus the mods can handle the situation without hindering gameplay."},{"postId":8163,"topicId":862,"posterId":112,"postTime":1285181470,"postText":"Yeah, it recharges too fast to acually stop anybody from really spamming, but I've never even gotten below half on it and you all know how much I talk. :D\nI don't understand how you guys are running out so much"},{"postId":8164,"topicId":862,"posterId":82,"postTime":1285181819,"postText":"It takes forever to recharge, what you talkin'' about? I can hardly rap long enough to get my message across, and I WOULD like the limit if it lasted longer...\n\nAnd it doesn't hinder gameplay, It adds a new layer of depth. You are forced to think about what to say and when to say it."},{"postId":8166,"topicId":862,"posterId":39,"postTime":1285182668,"postText":">> And it doesn't hinder gameplay, It adds a new layer of depth. You are forced to think about what to say and when to say it. \n\nOnline games shouldn't be strict business, they should also be about socializing.\nSo unless you type you're completely removing the social aspect of the online game and making it completely business as in\" Don't talk unless its important.\" Which I'm sure defeats the purpose of any clan."},{"postId":8172,"topicId":862,"posterId":101,"postTime":1285184825,"postText":"I hate it how it is. 3 ways to fix it:\n\n\n-Increase starting limit\n-Increase regeneration speed\n-Decrease the like 20 second wait (seems like forever when you are playing) if you hit the bottom to like 3 or 5."},{"postId":8183,"topicId":862,"posterId":113,"postTime":1285193489,"postText":"I was told by some of the admins that it was there solely for testing purposes.  In my opinion, the test failed.  I have not heard one person say that it is cool or a good addition to the server.  We have sooo many VIPs with gag abilities that its not even funny.  The server has never really had micspam problems before anyways.  \n\nThus, remove it.  Please."},{"postId":8231,"topicId":862,"posterId":2,"postTime":1285272510,"postText":"i've never actually seen the actual meter :| screenshot?"},{"postId":8232,"topicId":862,"posterId":48,"postTime":1285273232,"postText":">> i've never actually seen the actual meter :| screenshot? \n\nForce Gash to use a mic imo, amirite?"},{"postId":8234,"topicId":862,"posterId":112,"postTime":1285273468,"postText":">> >> i've never actually seen the actual meter :| screenshot? \n\nForce Gash to use a mic imo, amirite? \n\nyep, but only if I'm on. I dun wanna miss that :D"},{"postId":8236,"topicId":862,"posterId":4,"postTime":1285276829,"postText":"agreed :D"},{"postId":8240,"topicId":862,"posterId":82,"postTime":1285278198,"postText":"He sounds like a ten year old girl ;-;"},{"postId":8248,"topicId":862,"posterId":112,"postTime":1285281256,"postText":">> He sounds like a ten year old girl ;-; \n\nXD \nand FFUUU kry's sig ;-;\nBack on topic...\nI honestly haven't seen this do any good yet, besides I guess giving T's an advantage for people who don't stop talking?\nMost people who mic spam just scream into the mic for small spurts, not long enough for this to really do anything...\nAnd what meathook said about Vips ''n'' gaggin mang. There is really never a point where nobody has the power to do anything in ttt."},{"postId":8314,"topicId":862,"posterId":2,"postTime":1285363770,"postText":">> He sounds like a ten year old girl ;-; \nI don't have a mic lol.\n\nMaybe you're thinking of  Punkedmind  :O!?!?\n\nloljk\n\n[edit]\n\nI also tried using my mic, and it didn't show a meter. :| I'm assuming it has to have sound... HLDJ HERE I COME :V"}]}