{"topicId":4627,"forumId":122,"topicTitle":"Ban request on Mr.Fishyyy","topicTime":1319382378,"topicViews":46,"topicReplies":0,"topicStatus":0,"topicFirstPosterName":"eclipse","topicFirstPosterColor":"","topicLastPosterName":"eclipse","topicLastPosterColor":"","topicLastPostTime":1319382378,"posts":[{"postId":36178,"topicId":4627,"posterId":798,"postTime":1319382378,"postText":"1) Which server: TTT\n\n2) Offender's name: Mr.Fishyyy\n\n3) Offender's SteamID: STEAM_0:0:36637468\n\n4) Explain the situation in detail: Well, I am walking around the castle in peaches castle and notice a person shooting the ceiling, afterwards, he goes afk, soon after 2-3 people start crowbarring his feet (damagelog:http://steamcommunity.com/profiles/76561198032454327/screenshot/631854688464062550/?tab=public) and eventually kill him.\n He was the only traitor, they say he was \"traitor baiting\" when he shot the ceiling two minutes ago (when they obviously could of killed him before) there was also an excuse \"He was afk. And noone was traiting as traitor.\".\n Soon after Mr. Fishyyy begins to tell me to stop raging because they killed a 'traitor baiter''. And he continues, none the less.\nA few rounds after this, Fishy and I get stuck in the teleporter together, at first he tries to use his magneto stick to push us out, then he whips out his crowbar and attempts to kill me. He eventually stops after about 3 or 4 hits, then I kill him. He complains that he ''accidentally'' pulled out his crowbar when it was obvious he could of stopped at 1 hit.\nHe also begins to harass me, along with others saying \"Can I just kill eclipse?\". Vasto Lordes was also on the server at the time, and can confirm Fishy of disrespect.\n\n5) Were any specific server rules broken: Rule 1 (ofcourse) Rule 5, and that's about it.\n\n6) Any staff members on the server at the time of the offence: None\n\n7) Proof: http://steamcommunity.com/profiles/76561198032454327/screenshot/631854688464073500?tab=public (the first screenshot I posed shows a little of the disrespect)"}]}