{"topicId":4571,"forumId":126,"topicTitle":"*cough* MAPS ARE HARD *cough*","topicTime":1319090960,"topicViews":132,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"TGK_ReapaZ","topicFirstPosterColor":"","topicLastPosterName":"nicholsml","topicLastPosterColor":"","topicLastPostTime":1319661357,"posts":[{"postId":35844,"topicId":4571,"posterId":756,"postTime":1319090960,"postText":"These maps are really hard and I personally haven't finished one, just wanted to know if   this was the case for anyone else"},{"postId":35861,"topicId":4571,"posterId":605,"postTime":1319100646,"postText":"You do know to use the shift key to sprint, and most jumps require shift, crouch and jump keys to all be pressed at once, correct? The only map I have not completed is trickery_expert.\nAlso, I've already noted that I must make some easier maps at some point, and plan on doing so."},{"postId":35872,"topicId":4571,"posterId":756,"postTime":1319106675,"postText":"Yeah i do sprint but i have it binded to X, your maps are hard but must have taken a lot of skill and time to make and i do enjoy playing them on most occasions, even though i have never completed one"},{"postId":35886,"topicId":4571,"posterId":605,"postTime":1319113216,"postText":"Skill yes, time, not so much, only on average about 20 hours were used to make each of the puzzle maps... I am known for being quick :o (you'll complete some after practice, puzzle aint something that comes easy.)\nAs I said, I plan on releasing some maps, having a long easy route, with a seperate hard route for players who would get bored going the easy way. Hopefully, this would make the hardcore puzzlers and the rest of the playerbase happy at the same time."},{"postId":35992,"topicId":4571,"posterId":735,"postTime":1319181178,"postText":"Puzzle isn't supposed to be easy, it tests your skill, patience, and ability to hold back rage."},{"postId":36005,"topicId":4571,"posterId":101,"postTime":1319225646,"postText":">>  and ability to hold back rage.  \n\nIf you really want to test your might with this then just go play Call of Duty or League of Legends."},{"postId":36441,"topicId":4571,"posterId":1140,"postTime":1319661357,"postText":"Well, the problem is we have different experiences of players. We have to make the maps difficult enough for everyone, so they are pretty much all hard. You'll get better over time."}]}