{"topicId":1139,"forumId":24,"topicTitle":"Mark;","topicTime":1289258667,"topicViews":91,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"Mak_-","topicLastPosterColor":"","topicLastPostTime":1289322909,"posts":[{"postId":10715,"topicId":1139,"posterId":26,"postTime":1289258667,"postText":"First things first: I'm not pming him for two reasons: He's either always offline on steam or blocked me, and i want public opinions.\n\n>> 1.Why is RainRain even admin for one? 2.He's been demoted so many times. 3.And he wanted to LEAVE NNJG to start his own community with me. I didn't want to, he kept begging me, but I wanted to stay in NNJG. He said if he found a person who would give him a server and what not, he'd do it. 5.He complained about Sanya being super, when Sanya deserves super, and gets Sanya demoted. That's BS, Sanya deserves super and Rain doesn't deserve anything. 6.NNJG shouldn't have traitors among them.\n\nYours Truly, \nMark \n\n1. I applied for mod, Got it, Then later on donated to get admin, A cheap way, But im still a good one.\n\n2. And the same reason i'v been PROMOTED back each time; Unfair demote/Temp demote.\n\n3.No, I did not. I wanted to stay with NNJG and EOF at the same time, NOTHING is wrong with this, And iirc you'r in quite a few fucking clans yourself. You originally wanted me to make the server with you, I suggested a forum possibly, And then you said sure, That idea died, and you revived it again with the whole idea of a forum and clan, Don't pin this bullshit on me, I took the blame for nearly getting you demoted and offered ben to just demote me only, Which your rather lucky i did.\n\n4.No, Now your simply making up bullshit, When you left EoF due to nearly getting demoted, i asked if you were sure because i was working out a deal with ben to keep our positions and ease the stress between the two clans (mainly just ben really)\n\n5.I'm sorry, Is asking why a person is super from no where (No offense sanya, but you never really DO much with admin powers in perp) Complaining? I asked ben to promote me aswell, he said no, and i asked him why was sanya super, He didn't respond. BS? Thats your personal opinion and should not be used in a argument without back up or proof.\n\n6. Real traitors get banned, Real traitors are thrown away, I did nothing to betray nnjg, Sure making a new clan isn't the best idea, But nnjg is not effected in any fucking way due to it. I am NOT a traitor. If anything you are, Nearly trying to get all admins demoted.\n\nNo offense mark, But what the fuck is going through your head? This plan was long dead, And now out of a sudden you want me gone."},{"postId":10716,"topicId":1139,"posterId":55,"postTime":1289258806,"postText":"I say Mark is the truly traitor which left NNJG manytimes and trolled and stopped on TTT BAM!"},{"postId":10719,"topicId":1139,"posterId":101,"postTime":1289262054,"postText":"I dont really like either of you, sooooo"},{"postId":10722,"topicId":1139,"posterId":82,"postTime":1289265002,"postText":">> I dont really like either of you, sooooo \nWho doesn't like MaK D: also I am confussled."},{"postId":10725,"topicId":1139,"posterId":112,"postTime":1289265458,"postText":">> >> I dont really like either of you, sooooo \nWho doesn't like MaK D: also I am confussled. \n\nthis thread is about Mark (Crazy Monkey) not Mak.\nSo I'm assuming Dum wasn't reffering to mak unless he was\nconfused too.\n\nAnd the quote that Simon has is from a demote request for simon from Mark that is somewhere on the forums but I forget..."},{"postId":10726,"topicId":1139,"posterId":101,"postTime":1289267076,"postText":">> >> >> I dont really like either of you, sooooo \nWho doesn't like MaK D: also I am confussled. \n\nthis thread is about Mark (Crazy Monkey) not Mak.\nSo I'm assuming Dum wasn't reffering to mak unless he was\nconfused too.\n\nAnd the quote that Simon has is from a demote request for simon from Mark that is somewhere on the forums but I forget... \n\nI dont like Mark nor Semen"},{"postId":10738,"topicId":1139,"posterId":55,"postTime":1289322909,"postText":"Yeah me and dum are Almost buddys and we don't hatespeech eachothers :p"}]}