{"topicId":3380,"forumId":18,"topicTitle":"Domineeto","topicTime":1311975345,"topicViews":46,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"[NNJG]Ben","topicFirstPosterColor":"000000","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1311983474,"posts":[{"postId":26842,"topicId":3380,"posterId":153,"postTime":1311975345,"postText":"I think we should give him admin back. Or at least mod. You guys?"},{"postId":26843,"topicId":3380,"posterId":4,"postTime":1311975632,"postText":"He would most likely decline both."},{"postId":26846,"topicId":3380,"posterId":101,"postTime":1311976417,"postText":"He JUST got here and has a history of trololing.\n\nIf I was someone such as NinjaBreadMan or one of our regulars who isn't really acknowledged, I'd be pissed as a vegetarian in a butcher shop if he got it back. It clearly would show favoritism and would upset some of our regulars."},{"postId":26850,"topicId":3380,"posterId":6,"postTime":1311977151,"postText":"I vote no, not because he doesn't deserve it, but he was gone for a while, and just got back, I think he could possibly still make a good one, but he stepped down, on his own, and left. Also, like Kryzoid said, he would probably decline.\n\n\nI agree with Dum, too, he brings up a good point, about regulars LIKE Ninja Breadman who have been with us for a long time, but never was brought up in mod discussions."},{"postId":26851,"topicId":3380,"posterId":101,"postTime":1311977665,"postText":"Besides my whole list of people that could be promoted but everyone was like \"No because I dont like them\" to."},{"postId":26868,"topicId":3380,"posterId":153,"postTime":1311982293,"postText":"He asked me if he could have it back but instead of just giving it back I decided to ask you guys."},{"postId":26869,"topicId":3380,"posterId":115,"postTime":1311982441,"postText":"It's too soon. He has to prove himself again that he's here to stay and not trolling."},{"postId":26870,"topicId":3380,"posterId":153,"postTime":1311983474,"postText":"Fair Enough."}]}