{"topicId":1467,"forumId":122,"topicTitle":"Ban request for a Troll","topicTime":1293709402,"topicViews":63,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"Whitellama13","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1293718579,"posts":[{"postId":13046,"topicId":1467,"posterId":404,"postTime":1293709402,"postText":"Offender name?: Re:: Bryanchoong\nWhich Server?: Jailbreak\nOffender's Steam ID?: STEAM_0:1:31512716\nWhat the Offender did?: Numerous things, however I only have the evidence for one. (I didn't want to spend a bunch of time editing videos, uploading, and some things I couldn't get recorded. But the stuff I do have, should be enough to show I am telling the truth.\n\nBryan did freekilling, he called it \"survive and hide game\" where you had to hide (without even opening cells) and hope he didn't find you and kill you. He also team killed other guards with knives, and i heard he was doing a lot more before I got on the server. Every round he also raced to the Auto-Shotty and got everyone stuck inside him before he got it first. I have no clue how he was getting people stuck, but caused some LONG rounds.\nAdmins on?: None. This would be so much easier if there was. Sadly, it's 3:30 in the morning.\nProof?: http://www.youtube.com/watch?v=GFbjzMLQETk\n\nThe proof is a single bit of a video I chose, it involves him team killing me, another guard, with a knife. Sorry about the sound, I'm new to this fraps thing, and it only records my microphone.\n\nEDIT:\nI have more evidence below. The first one is him refusing to kill an AFK when he and the afk are the only ones left, and he sits there for ages. This video is MUCH longer but I didn't want something that would take an hour to upload. The one after that is him freekilling me for walking up to him with a syringe out. I didn't inject it on him or anything.\nhttp://www.youtube.com/watch?v=QkwXbErNwfo\nhttp://www.youtube.com/watch?v=yIQjR3wOOjc"},{"postId":13056,"topicId":1467,"posterId":153,"postTime":1293718579,"postText":"Banned and Locked."}]}