{"topicId":2441,"forumId":116,"topicTitle":"ttt_nothingspecial_nnjg","topicTime":1303560042,"topicViews":231,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1304037287,"posts":[{"postId":19454,"topicId":2441,"posterId":605,"postTime":1303560042,"postText":"As some of you may know, I had gash secretly place the map into the server, and randomly goto it. I did this to get a better honest opinions on the map ;p\nThis being said, it appears some simple things needs to be fixed... so when I fix the map sometime after I wake up, i'll be posting the link here and yell at gash.\n\nNeed to fix the blindingly bright light alot of people seem to see.\nNeed to change the button from the T credit item, so it either no longer makes sounds, or worse, kills innocents who try to grab it. (Improvised traitor testing makes me sad panda)\n\nNext map idea... a freaking pyramid in the desert nearby a destroyed town. The pyramid is the focus though :o"},{"postId":19456,"topicId":2441,"posterId":112,"postTime":1303561036,"postText":"I didn't realize anybody was making TTT maps. I'm excited to try it when you get it fixed.\n\nSide note: Omfg pyramid <3"},{"postId":19481,"topicId":2441,"posterId":605,"postTime":1303598300,"postText":"I've seen a couple of people talking about making maps, but I decided to do mine in mostly secret, with only a very few knowing of the process ;p\nThis being said, don't expect this map to be amazing, most of it was me getting used to mapping for TTT... im certain its playable, and possibly even a bit of fun, but I know the next map(s) I make will be better. Also, the rifle in the corner of the map, the one that makes a box float around you, makes me giggle alot... I'm so going to have to keep these kinds of weapons in future maps.\nAnywho, heres the link to download for those who want it earlier then getting it from the server... plus, I like having it officially logged on the forum. More so because any maps I make for TTT/puzzle is designed to be for the NNJG community only.\nhttp://www.garrysmod.org/downloads/?a=view&id=120557\n\nThe next map, focused on being inside the pyramid, will probably remind yall a bit of lost temple, but without objectives, and probably less traps... but more secret passages. And of course, like with this map, they will feature mostly only random weapon spawns, instead of preset weapons... ie, a room will always have 5 weapons in them, but what weapons they are will change every round."},{"postId":19557,"topicId":2441,"posterId":605,"postTime":1303705417,"postText":"Updated to version b4, before b3 was even put on the server... basically.. I learned myself a few tricks on compiling the map into a smaller size, and I also added some special brushes that should help eliminate the frame lag some people are recieveing. EDIT* It would appear the fix would sometimes cause a crash... rather it lag a bit then crash randomly. It's still smaller though.\nhttp://www.garrysmod.org/downloads/?a=view&id=120626\n\nAlso in news of ttt_desert_pyramid\n http://i309.photobucket.com/albums/kk373/cyoungz/2011-04-24_00001-1.jpg \n http://i309.photobucket.com/albums/kk373/cyoungz/2011-04-24_00002.jpg "},{"postId":19628,"topicId":2441,"posterId":4,"postTime":1303772225,"postText":"@udane: ...Epic\n\nI'm sure Pharaoh will shit bricks when he sees those screenies"},{"postId":19686,"topicId":2441,"posterId":112,"postTime":1303826103,"postText":">> @udane: ...Epic\n\nI'm sure Pharaoh will shit bricks when he sees those screenies \n\nI just did. \nI cannot wait until your done with that map. Those pictures are fantastic.\nI looked at it on my iPod the first time and couldn't see the screenshots, I just remembered this thread again. xD\n\nAs in the words of Rebbecca Black: we we we so excited.\n:D"},{"postId":19738,"topicId":2441,"posterId":4,"postTime":1303863213,"postText":"just a suggestion: most maps nowadays have an awesome style and such \"A HUGE BALL OF DEATH\" but all you get to see it the outside of it at the spawnpoint before you walk inside the ball and the rest of the map is inside the thing. You should make it so that in your pyramid map, some of the gameplay can be experienced outside the pyramid, like say, on it, at the top, on the sides, etc."},{"postId":19746,"topicId":2441,"posterId":272,"postTime":1303870956,"postText":"Moar secret passages! Moar!"},{"postId":19944,"topicId":2441,"posterId":112,"postTime":1304037287,"postText":"Any idea when you will be finishing the pyramid map?"}]}