{"topicId":2153,"forumId":12,"topicTitle":"Lockdown needs help","topicTime":1300485494,"topicViews":155,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"MarioDJW","topicFirstPosterColor":"990000","topicLastPosterName":"MZP.inferno","topicLastPosterColor":"","topicLastPostTime":1300876195,"posts":[{"postId":17494,"topicId":2153,"posterId":372,"postTime":1300485494,"postText":"There is a map that I played today. It was called Lockdown and was amazing.  It took awhile to download, but it had more than any map that I had ever played before had.  But there are some issues. First, the armory door cannot be opened so guards are stuck in there, and so are prisoners.  Also, as soon as another round started, the server crashed.  I would really like to be able to play this map, but these issues make it unplayable. This map is good enough that it should be fixed, and I am amazed that I never even played such a polished map until today, and it was broken. \n\nThanks, I know it will take time, but this would be awesome, since I am very tired of some of the maps that do work but that are boring.\n\nEdit: Link to the map, and if you download it from here, it is still compatible with the server version - http://www.gamebanana.com/maps/124944"},{"postId":17516,"topicId":2153,"posterId":521,"postTime":1300542867,"postText":"Theres a few mappers on the forums \nThey might do it for you"},{"postId":17606,"topicId":2153,"posterId":438,"postTime":1300690342,"postText":"I'm a beginner at mapping, but I can fix doors. I don't quite know about what is causing the crash on round start. It may be the spawn points"},{"postId":17616,"topicId":2153,"posterId":372,"postTime":1300733372,"postText":"Thanks hitman.  I don't really want to do anymore testing with the map on the server because I would be the only person on.  Maybe I'll do it late at night.  But really thank you."},{"postId":17711,"topicId":2153,"posterId":438,"postTime":1300863330,"postText":"Sort of a problem. This map is protected. I cannot edit it :/"},{"postId":17715,"topicId":2153,"posterId":521,"postTime":1300876195,"postText":"Deprotect it with MPQ editor or Xdep"}]}