{"topicId":1272,"forumId":24,"topicTitle":"A small slice of nnjg historeh","topicTime":1291679562,"topicViews":92,"topicReplies":4,"topicStatus":0,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1291755220,"posts":[{"postId":11603,"topicId":1272,"posterId":26,"postTime":1291679562,"postText":"5:35 PM - Scott Pilgrim: I seriously just want to know why gash is such a fucking dick to me\n5:35 PM - Flowers: But yeah we met around the time he got admin on \"redd's rp\"\n5:35 PM - Scott Pilgrim: ah\n5:35 PM - Flowers: I like rarely hear from Gash anymore\n5:35 PM - Flowers: Only in game. and thats rare\n5:35 PM - Scott Pilgrim: i talk to he a few times a week\n5:35 PM - Scott Pilgrim: him\n5:35 PM - Flowers: I talk to him once a week it seems\n5:35 PM - Flowers: If even that\n5:36 PM - Scott Pilgrim: if i ever try to start a casual convo though\n5:36 PM - Scott Pilgrim: it usually ends up with him saying\n5:36 PM - Scott Pilgrim: \"i dont care\"\n5:36 PM - Scott Pilgrim: by ends up\n5:36 PM - Scott Pilgrim: i mean his first reply\n5:36 PM - Flowers: I first met kryzoid on his darkrp server\n5:36 PM - Scott Pilgrim: lol\n5:37 PM - Flowers: Kryzoid made this big house out of boxes, and it got destroyed in a zombie war(aka gash and 4bc abuse war)\n5:37 PM - Scott Pilgrim: Lol\n5:37 PM - Scott Pilgrim: 4bc?\n5:37 PM - Flowers: 4bc was another close friend of mine, and somewhat Gash's that he left out\n5:37 PM - Scott Pilgrim: closer\n5:37 PM - Scott Pilgrim: then\n5:37 PM - Scott Pilgrim: me?\n5:37 PM - Flowers: nahh, not really\n5:37 PM - Scott Pilgrim: :3\n5:38 PM - Flowers: I havent talked to 4bc since the summer when he spammed niggers in the ttt\n5:38 PM - Flowers: (Note: 4bc was very racist)\n5:38 PM - Scott Pilgrim: lol\n5:39 PM - Flowers: Ahh Redd's rp, when i first met Gash, it was when my irl friend rdmed him as cop when he didnt know what rdm was\n5:39 PM - Scott Pilgrim: ....\n5:39 PM - Scott Pilgrim: so\n5:39 PM - Scott Pilgrim: you've played gmod\n5:40 PM - Scott Pilgrim: longer then gash?\n5:40 PM - Flowers: Ehh, I would say a BIT shorter\n5:40 PM - Scott Pilgrim: lol\n5:40 PM - Flowers: Because I got gmod when he first got admin on redd's\n5:40 PM - Flowers: I think i might have been there the day after he got it, not sure\n5:40 PM - Flowers: it = admin\n5:41 PM - Scott Pilgrim: he was admin\n5:41 PM - Scott Pilgrim: and didnt know what rdm was\n5:41 PM - Flowers: Lol\n5:41 PM - Scott Pilgrim: good fucking god\n5:41 PM - Scott Pilgrim: i knew all the know-hows of ttt the first day i played\n5:41 PM - Scott Pilgrim: FIRST\n5:41 PM - Scott Pilgrim: DAY\n5:41 PM - Flowers: I remember the day I met you\n5:41 PM - Flowers: Your mic kept bugging out\n5:41 PM - Scott Pilgrim: what\n5:42 PM - Scott Pilgrim: my mic was perfect back then\n5:42 PM - Scott Pilgrim: only 'til summer however\n5:42 PM - Flowers: It was all static-y then a few days later you said your mic was fixed\n5:42 PM - Scott Pilgrim: dont remember\n5:42 PM - Scott Pilgrim: also\n5:42 PM - Scott Pilgrim: funfact\n5:42 PM - Scott Pilgrim: i met kry and gash before you\n5:42 PM - Scott Pilgrim: they were trucing in nexus and owning the armory\n5:43 PM - Flowers: Oh yeah\n5:43 PM - Flowers: Those were the days man, us 3 owned that armory\n5:43 PM - Scott Pilgrim: then i joined ^.^\n5:43 PM - Scott Pilgrim: inb4theneverythingwentdownhill\n5:43 PM - Flowers: It was like 5 people owning the armory until trucing got outlawed\n5:43 PM - Scott Pilgrim: 0mhm\n5:44 PM - Flowers: I remember the night that it got outlawed\n5:44 PM - Scott Pilgrim: gash outlawed it when he killed you when you were truced\n5:44 PM - Scott Pilgrim: you did same next round\n5:44 PM - Scott Pilgrim: and he got piss angry\n5:44 PM - Flowers: Yeo\n5:44 PM - Flowers: Yep*\n5:44 PM - Scott Pilgrim: and i was T like 4 fucking rounds in a row\n5:44 PM - Flowers: He actually slapped me to 1 hp when i killed him\n5:44 PM - Scott Pilgrim: Lol\n5:44 PM - Flowers: Thanks to Cake and his hp station, I got full health again\n5:44 PM - Flowers: Then he slapped again...\n5:45 PM - Scott Pilgrim: man i should so post this on forums\n5:45 PM - Flowers: OVer the summer was the best time for the server imo\n5:45 PM - Scott Pilgrim: \"a small portion of nnjg history\"\n5:45 PM - Scott Pilgrim: over the summer was when i was on nonstop\n5:45 PM - Flowers: Same\n5:45 PM - Scott Pilgrim: then around august i started mabi again\n5:46 PM - Flowers: I dont get on near as often anymore\n5:46 PM - Scott Pilgrim: mhm\n5:46 PM - Scott Pilgrim: it was everyday everyhour ttt\n5:46 PM - Scott Pilgrim: then\n5:46 PM - Scott Pilgrim: well for some reason it just got boring\n5:46 PM - Scott Pilgrim: new games came out\n5:46 PM - Scott Pilgrim: gmod kinda went down"},{"postId":11606,"topicId":1272,"posterId":4,"postTime":1291680019,"postText":"and i hate gash to this day for destroying my hard work on that server.\n/joke.\n\n\nnow that we have punk and gash's perspective on how their whole story started, maybe i should post mine from my perspective? :O\noh, and to this day, you can still see some graffiti on the outside of the armory that says \"walk in and get rifled by gash's aimbot\" from our fun trucing adventures :]"},{"postId":11610,"topicId":1272,"posterId":2,"postTime":1291694098,"postText":"That aimbot was fun, man. Well, that was when I was acting like a dick and just got mad at everyone (make a joke [KRYZOID] and I will rage at you.) so I used an aimbot :0 Didn't rdm though, but I stopped that shit after a week. lol. It was before NNJG, actually, that we had that armory war thing if I remember correctly. Then I switched it to NNJG."},{"postId":11613,"topicId":1272,"posterId":101,"postTime":1291698939,"postText":">> That aimbot was fun, man. Well, that was when I was acting like a dick and just got mad at everyone (make a joke [KRYZOID] and I will rage at you.) so I used an aimbot :0 Didn't rdm though, but I stopped that shit after a week. lol. It was before NNJG, actually, that we had that armory war thing if I remember correctly. Then I switched it to NNJG. \n\n\nThen a while after we got Zombie Survival then you whipped it out again! :D"},{"postId":11615,"topicId":1272,"posterId":2,"postTime":1291755220,"postText":">> >> That aimbot was fun, man. Well, that was when I was acting like a dick and just got mad at everyone (make a joke [KRYZOID] and I will rage at you.) so I used an aimbot :0 Didn't rdm though, but I stopped that shit after a week. lol. It was before NNJG, actually, that we had that armory war thing if I remember correctly. Then I switched it to NNJG. \n\n\nThen a while after we got Zombie Survival then you whipped it out again! :D \nThen a while after we got Zombie Survival scriptenforcer was added! :D"}]}