{"topicId":413,"forumId":59,"topicTitle":"Windows 7 :(","topicTime":1277942902,"topicViews":89,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"Dick Nixon 17","topicFirstPosterColor":"","topicLastPosterName":"DethSlayr","topicLastPosterColor":"990000","topicLastPostTime":1278088363,"posts":[{"postId":3914,"topicId":413,"posterId":67,"postTime":1277942902,"postText":"So, my entire windows 7 operating system is messed up. Fails to start / crashes in use 80% of the time. Anything i can do short of completely whiping memory / sending it back?"},{"postId":3919,"topicId":413,"posterId":48,"postTime":1277948903,"postText":"Switch to XP?\n\nI use vista which is also kind of troublesome...\nbut Xp seems to not have troubles, and is a more stable base for gaming.\n\nIdk what to say.\nMaybe reformat your hard drive, and do a system defrag?\nJust cuz they're supposed to be done anyways, and could help?\n\nI really am not a computer expert, so I'm not one to be asking...\nbut theres my input :/"},{"postId":3932,"topicId":413,"posterId":39,"postTime":1277992510,"postText":"Truly, Windows 7 is crap, the only reason I use it is because apparently they don't make XP anymore.\nUnfortunately, I also had the same issue as you, It is NOT however caused by your operating system. This means that the system was not fully installed on your computer in the factory. You are unfortunately going to have to wipe everything and reinstall the system software. Do not attempt to do this without Tech Support guiding you through what you have to do. Backup everything you don't want to lose, cause there is no getting it back."},{"postId":3934,"topicId":413,"posterId":12,"postTime":1277999059,"postText":"I have to agree with ungrateful there. I personally would just downgrade, but if you don't want to you will have to wipe your comp and redo it all. I personally use Istanbul and the only issue I have with it is the not so often blue screen power thing but it doesn't harm it, just fails to shutdown properly. Other than that works great execpt that firefox and any steam game can't run on the same time but I can live with that! Anyway sorry for the mini rant, but good luck!"},{"postId":3944,"topicId":413,"posterId":3,"postTime":1278017426,"postText":"It's possible to downgrade?"},{"postId":3947,"topicId":413,"posterId":67,"postTime":1278038962,"postText":"idk but i dont think windows xp can support my 8 gigs of ram"},{"postId":3953,"topicId":413,"posterId":3,"postTime":1278083298,"postText":">> \nidk but i dont think windows xp can support my 8 gigs of ram\n \nYup, that RAM will slow it down, go ahead and destroy half of it. x3"},{"postId":3956,"topicId":413,"posterId":48,"postTime":1278088363,"postText":"Yes you can downgrade, \nand i think if you use a 64 bit copy of XP you should still be able to use it all.\n\n:/"}]}