{"topicId":4886,"forumId":24,"topicTitle":"Hey NNJG from rtowey(PoF)","topicTime":1321070460,"topicViews":137,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"rtowey","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1321163706,"posts":[{"postId":37756,"topicId":4886,"posterId":1194,"postTime":1321070460,"postText":"Hello its me =|PoF|= rtowey =|F|=, Founder and creator of PoF.\n\nDo you know why i was trolling your server??? Because your clan mates decided it was ok to troll my server first. I do not think this a very good way of setteling things between Premonition of Fate and NNJG. Please do not troll the PoF servers or things will get very ugly very fast. I do not intend of doing anything bad but some of my other clan members disagree. For example, a clan member was wiling to buy a DDoSer just because I got banned from your server. Please stop all trolling because i do not have control over my clan members doing very bad stuff. So please take this in to concideration.\n\nPS: If you insult PoF then you are insulting Wreckless gamers, The Cyber Poliece, Havoc Gamers and New Havoc Gamers, which these grerat clans have passed away but I still kept the triditional Jailbreak gamemode alive.\n\nPSS: I also think you MIGHT get ddosed from former Havoc Gamers clan founder Liquid or Clark(Because he did it to my JB server)"},{"postId":37757,"topicId":4886,"posterId":1194,"postTime":1321070850,"postText":"Also please ban Own3r from your servers and kick him out of your clan because he was the one that insulted PoF the most..."},{"postId":37764,"topicId":4886,"posterId":634,"postTime":1321073546,"postText":"The staff at NNJG never has condoned trolling other servers and staff members can be demoted if they do.\n\n>>  Please stop all trolling because i do not have control over my clan members doing very bad stuff. \nWe have similar problems here. Take note of the member that is doing it on your server. Look on our staff list and if the names match up you should probably notify a high ranking staff member here. I'll do the same for PoF if I see any of your staff \"trolling\" us."},{"postId":37768,"topicId":4886,"posterId":812,"postTime":1321075158,"postText":"I think I speak for all of us in saying that we appreciate you registering here and doing this.\n\nSadly we're all aware of the tension between the both of our communities, and a few 'radical'' members have decided to reflect a terrible image of us. I think the Jailbreak administration would agree in apologizing for what has taken place. It would be great if both our communties could be at peace, as it should be.\n\nAnd as Destar said, if ANY member of NNJG were to represent our community in a bad light, I would speak directly to Quack  the newly promoted Server Manager for Jail. Not once have we promoted the trolling of your server, apparently people let pride come before respect.\n\nI look forward to seeing you around the forums rtowey."},{"postId":37772,"topicId":4886,"posterId":735,"postTime":1321077511,"postText":"You came on the jailbreak server, made your name nothing and started to advertise your own server,etc. You then left and came back, by then, I had already gotten your steamid and banned you.\nEdit: An eye for an eye, and the whole world would be blind."},{"postId":37774,"topicId":4886,"posterId":101,"postTime":1321077759,"postText":"Also, indirectly threatening us is not a good way to get this resolved, as is the set of mind \"You do this to us, we do this to you.\""},{"postId":37789,"topicId":4886,"posterId":916,"postTime":1321122993,"postText":"This wont Stop me from Taking Videos of your Jailbreak,Making Examples,Etc."},{"postId":37797,"topicId":4886,"posterId":1194,"postTime":1321133634,"postText":"And why are you makeing videos of my jailbreak server?"},{"postId":37798,"topicId":4886,"posterId":634,"postTime":1321133875,"postText":">> And why are you makeing videos of my jailbreak server? \nTo plot your ultimate downfall of course.\n\nor maybe he just wants to highlight map additions/other servers rules/playerbase/administation.\nIt's not only your server, he went on and did one of a random TTT server the other day."},{"postId":37811,"topicId":4886,"posterId":916,"postTime":1321142195,"postText":"Exactly..im Rendering one right now"},{"postId":37828,"topicId":4886,"posterId":2,"postTime":1321163706,"postText":"\"An eye for an eye\" is a horrible way of thinking, as it does not accomplish anything in the end. If you have issues with those that favor our server, deal with it how you see fit, as long as you do not group all of us with them. \n\nThe owner of a server represents the server itself, and by your performance I can assure anyone that has decided it would be okay to \"troll\" your server, that they're just wasting their time."}]}