{"topicId":3817,"forumId":35,"topicTitle":"CoreyW.Rogerson","topicTime":1314505329,"topicViews":154,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"CoreyW.Rogerson","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1315018457,"posts":[{"postId":31078,"topicId":3817,"posterId":612,"postTime":1314505329,"postText":"1) What position are you applying for: Moderator\n2) Your age:18 (as of August 31, 2011) (You can disclose this information to us privately if you wish)\n3) Your location: USA, VA, Chesapeake(Country, timezone)\n4) Current In-Game Name: Dr. Corey. W. Rogerson\n5) Steam ID & Link to your Steam Community Profile:  STEAM_0:0:24225449 \n6) How did you find out about NNJG: Server browsing\n7) How long have you been involved with NNJG and/or Shadow's servers:about a month before my forum join date, Feb. 2011\n8) What you can bring to the NNJG Team: (Web/Graphic Design, Lua/Other Coder, Moderation, Map Maker, etc.)\n9) Why do you want to be part of the NNJG Team: I feel that i would be an asset to the community and contribute to the moderation of our TTT server. I hope to control the server to the best of my ability and to treat each player with fair and equal jurisdiction\n10) Do you have any past experience with the position you're applying for:not on NNJG, I have owned MANY servers, and have had admin on a lot more. i currently Own and utilize a ventrillo server and have had one for over 3 years, i can assure you that i have never been demoted or remove due to abuse, only to insufficient funding of servers. For any reassurance, ask William Fudge he has been with me for more than 4 years and is my best friend on the web.\n11) Do you own a decent microphone, and do you frequently utilize it: Yes, i do!\n12) Any other comments or information you can provide: If i am chosen for moderator i will do my best to help with not only the server, but with the fundamentals of NNJG i would also be willing to help support this beloved community in anyway possible.\n\n  I can promise you that im done with the Crisis hate. I will not troll/annoy/anything it piss him or anyone off intentionally. What happened before has been looked atin hindsight and i have done some rethinking about it all, and would like to say that I am truly sorry and it's never to happen again.\n\n SCREENSHOTS \n\n  YES:  \n\n http://i51.tinypic.com/34rg3lk.png  dont_touch_that_cactus  http://i56.tinypic.com/2qbdlxl.png  [NBLCKK] CTRL ALT DEFEAT\n\n http://i55.tinypic.com/2rmtp1y.png  Funny~Raff  http://i51.tinypic.com/esna8n.png  4²°мAf¡å™|Sfc.James\n\n http://i53.tinypic.com/3310ntg.png  Kryzoid  http://i55.tinypic.com/2pq6sxs.png  Luamerava\ni messed this one up ^ Kryzoid said if i dont keep\nthe mess up with crisis, he will (hopefully) confirm\n http://i55.tinypic.com/dp8ppe.png  Mario  http://i55.tinypic.com/34e6j4y.png  Mongo\n\n http://i55.tinypic.com/104rlg0.png  Nutter Butter  http://i51.tinypic.com/s6tbx4.png  [NNJG] Popl43\n\n http://i51.tinypic.com/m7tdl5.png  theportalsniper  http://i56.tinypic.com/w0iz68.png  ryancarson25\n\n http://i56.tinypic.com/30t2vih.png  Smoogles  http://i53.tinypic.com/20pf7a.png  Spaghetti\n\n http://i51.tinypic.com/2dqq0w5.png  TheToxicDear  http://i54.tinypic.com/2092fe1.png  Norple\n\n http://i51.tinypic.com/295g29f.png  [NNJG] Human Aimbot: \n\n  NO:  \n http://i55.tinypic.com/34eq3x2.png  Playahata\n\nThank you all for being honest, i really appreciate it! \n\nI can only say as a final thought that I hope you take time to consider me as a viable choice, i really would appriciate this role, and would respect it."},{"postId":31867,"topicId":3817,"posterId":2,"postTime":1315018457,"postText":"Unfortunately, we are unable to accept your application at this time."}]}