{"topicId":4576,"forumId":4,"topicTitle":"Modern Warfare 3 or Battlefield 3","topicTime":1319096380,"topicViews":92,"topicReplies":11,"topicStatus":0,"topicFirstPosterName":"TGK_ReapaZ","topicFirstPosterColor":"","topicLastPosterName":"Moonrakerone","topicLastPosterColor":"","topicLastPostTime":1319583297,"posts":[{"postId":35853,"topicId":4576,"posterId":756,"postTime":1319096380,"postText":"What do you think, Me personally Im thinking Battlefield 3 Will be Better"},{"postId":35898,"topicId":4576,"posterId":517,"postTime":1319117117,"postText":"this don't even need a reply, if anyone chooses modern warfare 3 over battlefield 3 then I don't want to live on this planet anymore."},{"postId":35918,"topicId":4576,"posterId":101,"postTime":1319140782,"postText":"There's no way of telling when MW3 isn't out yet. (BF3 had it's beta)\n\nSeriously, if you're saying one's better than the other already then you're a stubborn fanboy.\n\nEDIT: Unless you went to COD:XP and then played BF3"},{"postId":35923,"topicId":4576,"posterId":4,"postTime":1319143344,"postText":"I want Battlefield 3."},{"postId":35924,"topicId":4576,"posterId":1140,"postTime":1319144914,"postText":"I believe in terms of gameplay, graphics, physics, and Multiplayer, Battlefield 3 will reign. However, most people will still buy MW3 Just because COD has a much larger fanbase, and many will get it just to play with their friends. I personally would prefer Battlefield 3, but i think MW3 will still be the champ it terms of sales and userbase."},{"postId":35930,"topicId":4576,"posterId":101,"postTime":1319147492,"postText":"I have both pre-ordered with Limited Edition for BF3 (free, lol) and Hardened Edition for MW3. I have no doubt both will be fun."},{"postId":36081,"topicId":4576,"posterId":6,"postTime":1319307261,"postText":"Well, judging from the past, Battlefield 3 will probably be better in every way. Every COD game after COD4 has sucked completely. Whereas Battlefield Bad Co has been really fun. There is no way of telling which is better right now, but if the past is any indication, BF3 will win big."},{"postId":36097,"topicId":4576,"posterId":856,"postTime":1319314704,"postText":"Would have gotten MW3 instead, but luckily, I'm gonna get BF3 and MW3 for 100$ :DDDDDD"},{"postId":36321,"topicId":4576,"posterId":1140,"postTime":1319555356,"postText":">> Would have gotten MW3 instead, but luckily, I'm gonna get BF3 and MW3 for 100$ :DDDDDD \n\n\nHow does that work? some kind of deal at your local store or something? Im jealous. \n\n\nAlso, this is kinda off topic, but I got mad when I ordered my legendary edition of Halo:Reach, just to find out that they are making a NEW halo (I got it because it was supposedly the last one in the series) and you could get all the items that the legendary edition came with, ingame. like, wtf?"},{"postId":36325,"topicId":4576,"posterId":812,"postTime":1319571526,"postText":">> >> Would have gotten MW3 instead, but luckily, I'm gonna get BF3 and MW3 for 100$ :DDDDDD \n\n\nAlso, this is kinda off topic, but I got mad when I ordered my legendary edition of Halo:Reach, just to find out that they are making a NEW halo (I got it because it was supposedly the last one in the series) and you could get all the items that the legendary edition came with, ingame. like, wtf? \nYeah, Reach is the last Halo by BUNGIE, Halo is now being directed by 343 Industries.\n\nAnd really it's no question for me to decide over BF3 or MW3. I've purchased all the COD's up to Black Ops, and that's where I'm stopping. It's just a joke how they just ship almost an entirely identical game every year, and will still make a shitload of profit.\n\nBattlefield 3 looks like an amazing God-damn game, and it baffles me that people even have to decide over this or MW3...."},{"postId":36331,"topicId":4576,"posterId":612,"postTime":1319573172,"postText":"It's not about better. It's apples to oranges. >>  cod is an arcade shooter. Bf is a realism shooter. "},{"postId":36353,"topicId":4576,"posterId":237,"postTime":1319583297,"postText":"i'm getting both. BF3 will be great for intense sessions, MW3 will be great when i want quick-paced, un-realistic fun. Like corey said, they're both crazy different."}]}