{"topicId":4833,"forumId":122,"topicTitle":"Chuck Testa Hacking.","topicTime":1320701297,"topicViews":59,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"Own3r","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1320704098,"posts":[{"postId":37431,"topicId":4833,"posterId":849,"postTime":1320701297,"postText":"1) Which server:  Jailbreak \n2) Offender's name:  Chuck Testa \n3) Offender's SteamID:  STEAM_0:1:41152155 \n4) Explain the situation in detail:  I joined the server and many players were complaining of an RDMer named Chuck Testa, I asked him about what he did and a player named Chinese Government was accusing him. Chuck Testa then threatened to put Chinese Government out of the game, which he did and exclaimed ''EVERYONE PRESS TAB AND LOOK AT CHINEESES PING.'' He wasn't joking, and it raised to 999 and Chinese Government disconnected shortly after. I then slapped him to make sure Igor McGee was indeed Chuck Testa. He flew in the air so I knew it was. He then threatened me and my ping started to raise. I quickly typed status in console and left. \n5) Were any specific server rules broken:  Hacking, RDMing. \n6) Any staff members on the server at the time of the offence:  Nope. \n7) Proof: http://imageshack.us/g/249/2011110700001o.jpg/\n 1: Chuck Testa telling everyone to look at Chinese Government's ping\n2: Further proof.\n3: Me slapping Chuck to make sure it was him (You can see him flying)\n4: Chuck Testa threatening me. "},{"postId":37437,"topicId":4833,"posterId":1169,"postTime":1320703255,"postText":"What he did was used the ip address that I connect with to shut off my internet using command prompt.\n\nIt's not a big deal to me because I have a batch file that changes my ip to whatever I specify, and I use that for situations like these. But I agree, he should be banned for this."},{"postId":37439,"topicId":4833,"posterId":115,"postTime":1320704098,"postText":"I recently banned him from jailbreak. So hes permnantly banned."}]}