{"topicId":2794,"forumId":14,"topicTitle":"I was unfairly banned.","topicTime":1306089508,"topicViews":108,"topicReplies":8,"topicStatus":1,"topicFirstPosterName":"jimmy","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1306111424,"posts":[{"postId":22438,"topicId":2794,"posterId":800,"postTime":1306089508,"postText":"Your In-Game name: Jimmy Bameson\nYour Steam ID: STEAM_0:1:20524414\nReason: GTFO\nLength of Ban/Date and Time of Unban: Permanent\nWhat server were you playing?: TTT\nWho banned you?: That Guy\nWhy should we unban you?: The circumstances were completely unfair. We were playing the map \"cyberpunk\" which, as some of you may know, has a music room and DJ booth below ground. You can press these different buttons to play music. People got annoyed and everything went kind of crazy. Soon, people started RDM'ing or shooting at you if you entered the room; even if it was just to mute the annoying music playing. I entered the room and saw a terrorist and a detective. The terrorist started shooting me first. I shot at him with a HUGE. Right when I was about to kill him, the detective goes up and starts strafing and shooting me before I could identify the body. I'm almost positive you can kill a detective in self-defense if you're unfairly accused, and I did just that. Of course everyone outside thought I was a traitor because they (the admin included) couldn't see what happened behind those doors. It really isn't my fault that the others felt like RDM'ing anyone who entered the room. So everyone called for a perma like it was some kind of witch hunt or something."},{"postId":22439,"topicId":2794,"posterId":377,"postTime":1306090213,"postText":"I admit i should of put a better reason but the reason I banned you was I had complaints about you rdming and ghosting, and you shot and killed me as traitor OUT OF NOWHERE and ran off shooting when I heard someone complain about you rdming again.  Everything was calm until you killed me and ran and that was enough proof for me that you were ghosting and rdming so a Banned you.  I know I should of put the reason in the ban, that's my fault, but I saw you rdm and had sufficient evidence of Ghosting so that is the reason, but I apologize for being a bad Moderator and not putting the reason Down."},{"postId":22441,"topicId":2794,"posterId":800,"postTime":1306090645,"postText":"It's okay. At least you're explaining your reason here. I must affirm you, though. I am no ghoster. I don't \"RDM\" as you would put it. I have reasonable suspicion of everyone I kill. I obviously don't remember your case in particular, or I would bring it up now, but I was a traitor half the time on that map. So perhaps you thought I was RDM'ing when really I was completing the objective? In any case, if you are willing to compromise, perhaps you could reduce my ban limit to a month or so if you feel that is justified. I do love that server and I was just about to buy a neat hat in the shop."},{"postId":22442,"topicId":2794,"posterId":377,"postTime":1306091323,"postText":"right before I banne you I saw you fill up my face with buckshot\nand had numurous complaints about you"},{"postId":22447,"topicId":2794,"posterId":800,"postTime":1306095534,"postText":"So you were the traitor in the music room? You shouldn't have shot me. And I only shot others out of self-defense. When the door to the DJ booth opened it was like a firing squad of five people on me. If you were one in the crowd and I shot you when you weren't shooting back, sorry. I didn't mean to. The shotgun spread is hard to control in a crowd situation. Regardless, I have the event recorded. I had it running because I was doing awesome C4 work as a traitor in the music room. The bomb won the round once and I had a great score and decent karma. Don't see why your misconception earned me a permanent ban."},{"postId":22449,"topicId":2794,"posterId":377,"postTime":1306096006,"postText":">> So you were the traitor in the music room? You shouldn't have shot me. And I only shot others out of self-defense. When the door to the DJ booth opened it was like a firing squad of five people on me. If you were one in the crowd and I shot you when you weren't shooting back, sorry. I didn't mean to. The shotgun spread is hard to control in a crowd situation. Regardless, I have the event recorded. I had it running because I was doing awesome C4 work as a traitor in the music room. The bomb won the round once and I had a great score and decent karma. Don't see why your misconception earned me a permanent ban. \nThere was no shooting at all, until you shot, it was quiet until you killed me and ran out"},{"postId":22469,"topicId":2794,"posterId":54,"postTime":1306107873,"postText":"You cannot ban off of complaints, and because he killed you and someone else, doesn't give you the right to perm him. For what he did, MAYBE a few day ban, not a perm imo though."},{"postId":22473,"topicId":2794,"posterId":377,"postTime":1306109555,"postText":"No, I've Seen him rdming and people have been saying he was ghosting but at first i didnt see any evidence but the fact that he came up to the traitor and shot him, ran out and shot anybody in his way was kind of the red light for me.  A bunch of people were claiming Ghosting and Rdming and that stunt there + the rdm spree he attempted to start was reason enough for me.  NO RDMING AND NO GHOSTING are in the Damn MOTD, If they can't abide by the rules, MAJOR RULES AT THAT, they have no business on our Server.  \nP.s. It's people being soft on rdmers thats causing the rdm problem"},{"postId":22481,"topicId":2794,"posterId":2,"postTime":1306111424,"postText":"Unbanned for invalid ban reason."}]}