{"topicId":4375,"forumId":14,"topicTitle":"Applejack","topicTime":1317454883,"topicViews":102,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"[NNJG]Crausidia","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1318035793,"posts":[{"postId":34620,"topicId":4375,"posterId":204,"postTime":1317454883,"postText":"Your In-Game name: Applejack\nYour Steam ID: STEAM_0:0:15479720\nReason: \"Blatant rdm, mic spam, obv troll\"\nLength of Ban/Date and Time of Unban: \"Permanent\"\nWhat server were you playing?: \"NNJG TTT\"\nWho banned you?: \"Udane\"\nWhy should we unban you?: Because i had proof that udane was traitor, i did not record it cause i didnt think he would ban me for killing him, he had left the police station (amsterdam map) and i walked in and saw that there was a un id body in there so i id'd it and it was the detective, killed by a Mac10, i said \"i think udanes the traitor\" and then i see he had a mac10 and i yelled \"UDANES THE TRAITOR\" 5 times (i think thats why i got banned for micspam too) and i tried to kill him, but he shot me to death, and then went on to kill some other people, round ended in a stab to the back in the river. So i think that all his reasons were invalid."},{"postId":34621,"topicId":4375,"posterId":605,"postTime":1317457274,"postText":"I left the building you spoke of a long before you saw me, around 2 minutes. People could easily miss that spot the body was in while coming in, and in fact, 1 did. As thus, it would have been the same as if you called out that innocent in that situation, I was just unlucky you didnt see him near the building. Also calling out people based on their guns is against the rules as any player can just as easily drop/pick up the gun used for the murder. But this is not the only issue at hand.\nNot only did you attack me based on assumptions that round, but threw an incen killing another one, and harming another during the very same round.\nAlso, you were muted the round before then, for mic spam, because you kept making random sounds in the mic. The same round that I got called into the server for players causing problems.\nDue to all this occuring in rapid sucession to each other, I assumed you were just a troll coming into the server to do harm.\n\nEdit:\nDoing a background check on your ip, this is not the first time banned either, you should know the rules after having a month ban under your belt. \nAlso, you appear to break rules under different names only."},{"postId":35044,"topicId":4375,"posterId":153,"postTime":1318035793,"postText":"I know from much experience Crausidia(Applejack) is a good player and if he did RDM you it wasn't intentional.\nShortening ban to 2 months."}]}