{"topicId":478,"forumId":26,"topicTitle":"Re: I'm Pretty Dum.","topicTime":1279654538,"topicViews":199,"topicReplies":11,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1283103527,"posts":[{"postId":4422,"topicId":478,"posterId":101,"postTime":1279654538,"postText":"Well, even though pretty much anyone who has played TTT in the last week knows me... I figured I will still make this thread.\n\nOh, and before I begin.... if you make a joke about my name, it is 95% of the time UNORIGINAL. Even if it is fucking hilarious.\n\nOk, ANYWAYS. Hello, I am Dumdadumdoo but in game I am Dum. I live in New York STATE.\n\nThe first server of (kinda sorta) NNJG was Shadow's Jailbreak, even though it wasn't technically NNJG yet, because it was not created yet. I then played on it a lot, but it switched to Shadow's Flood. I still played on it a ton. However, at this time I found a different clan, and went and played on that for a while. At this time I knew all the main people which are here today (Bird Flu, Kryzoid, Punked, Gash/Shadow) and still talked to them a tiny bit. Oh, and in case anyone needs to know what I mean when I say Home Bro, I am talking about Punked. I am (apparently) School Bro. Even though Kryzoid  =  :-*. Anyways, soon after I went to a different clan, because the first clan I was in was a BUNCH OF SHITHEADS, putting it lightly. Anyways, then I went to a small other clan, then I came here because nobody was active, I brought Magicnachoz with me to the small clan then here. You may also see a few other people I know who play on the servers because I do, like Aaron2140p (with some tags on), Redskingmen (with some tags... Oh, and for all of the people who think its Redskin Gmen... Its Reds King Men... -_-), Mr. Diaperman, and a few others.\n\nSo I've come back to actually join NNJG. I've already donated the Team Fortress 2 Server.\n\nA tiny about myself and my relations(hip) to others:\n\nI can map.\nI am usually on for most of the day.\nKryzoid =  :-*.\nPunked = Home Bro.\nPunked calls me School Bro.\nBirdflu calls me Flarpnugget.\nMy original name was Dumdadumdoo, as my forum name is, but I switched it to Dumdadumdoodadupdee later because I found it funny how people were trying to pronounce it. At first it was funny, then it got sad, then it got funny again (Ellis ftw) then I switched it to Dum.\nI can add on weapons to Flood and TTT, if you guys want me to do that.\nI am considered a Portal 2 \"fanboy.\"\nPortal 1 and 2 is/will be fucking awesome.\nI have most Valve MAIN games except for DOD, HL:OF, and HL:BS. I might get all 3 of them soon though.\n\n\nSo, hello NNJG. Mah name is Dum."},{"postId":4429,"topicId":478,"posterId":4,"postTime":1279656625,"postText":"Hello gentlewomen."},{"postId":4436,"topicId":478,"posterId":6,"postTime":1279665780,"postText":"Sup School Bro."},{"postId":4440,"topicId":478,"posterId":67,"postTime":1279671763,"postText":"HAI.\n\n>> \nOh, and before I begin.... if you make a joke about my name, it is 95% of the time UNORIGINAL\n \n\nDumDum Doogan"},{"postId":4443,"topicId":478,"posterId":101,"postTime":1279675168,"postText":">> \nHAI.\n\n>> \nOh, and before I begin.... if you make a joke about my name, it is 95% of the time UNORIGINAL\n \n\nDumDum Doogan\n \n\n\n96%...."},{"postId":4445,"topicId":478,"posterId":48,"postTime":1279677712,"postText":"I'm also a portal 2 fanboy.\n\n:D  :-X"},{"postId":4449,"topicId":478,"posterId":101,"postTime":1279678598,"postText":">> \nI'm also a portal 2 fanboy.\n\n:D  :-X\n \n\n\nTook me like a week to find someone who I am going to play co-op with. Finally found Kryzoid  :-*"},{"postId":4456,"topicId":478,"posterId":4,"postTime":1279683911,"postText":"*face brights up*\n\nfart."},{"postId":4477,"topicId":478,"posterId":101,"postTime":1279741301,"postText":">> \n*face brights up*\n\nfart.\n \n\n<3"},{"postId":4679,"topicId":478,"posterId":153,"postTime":1280107389,"postText":"LOL"},{"postId":6357,"topicId":478,"posterId":232,"postTime":1283103449,"postText":"L augh\nO ut\nL oud\nO omg WTF what now\nL ..."},{"postId":6359,"topicId":478,"posterId":101,"postTime":1283103527,"postText":">> L augh\nO ut\nL oud\nO omg WTF what now\nL ... \n\nPlease do not revive dead threads."}]}