{"topicId":4045,"forumId":35,"topicTitle":"Eclipse's TTT Moderator Application","topicTime":1315449824,"topicViews":105,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"eclipse","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1316158930,"posts":[{"postId":32640,"topicId":4045,"posterId":798,"postTime":1315449824,"postText":"1) What position are you applying for: TTT Moderator\n2) Your age: 13 (14 in 3 months)\n3) Your location: Ohio, USA (Eastern)\n4) Current In-Game Name: eclipse\n5) Steam ID & Link to your Steam Community Profile: STEAM_0:1:36094299, http://steamcommunity.com/profiles/76561198032454327/\n6) Tell us about yourself: I'm like any other kid enjoying his games, I've been involved with gmod since august of last year, I'm a frequent TTT player, I enjoy the gamemode and everything about it, in the server I usually never create drama of any sort, I try to stay away from these kinds of conflicts.\n7) How did you find out about NNJG: Jailbreak\n8) How long have you been involved with NNJG and/or Shadow's servers: 6-7 moths-ish\n9) How long have you been a registered user on Steam: Little over a year\n10) What you can bring to the NNJG Team: Moderator of the TTT server.\n11) Why do you want to be part of the NNJG Team: I've always enjoyed NNJG, this is the first and only TTT server I've ever played, and I've grown to love the game and community.\n12) Do you have any past experience with the position you're applying for: Yes, I have been a admin on two DarkRP server, one failed, the other still thriving (I just quit the second because I pretty much quit DarkRP and now play TTT.).\n13) Have you ever posted a ban request, and if so, was it accepted: No, though I have attempted to, but my peers do it instead.\n14) How often do you play on an NNJG server: 7 Days a week (usually) 2-4 hours (school day) 4-8 hours (weekend)\n15) Do you own a decent microphone, and do you frequently utilize it: I have a microphone, I use it off and on, soon I will be building a computer and be getting a new microphone which I will use frequently.\n16) How well can you speak the English language: Very well\n17) How well can you type: Very well\n18) What is your favorite and least favorite aspect of NNJG: My favorite aspect is the community and people here, my least would have to be the lack of admins/mods on at certain times.\n19) Any other comments or information you can provide: I hope that my application is considered, even if denied, I have hoped to become a moderator on here ever since I joined.\n\nRecommendations: \nhttp://steamcommunity.com/profiles/76561198032454327/screenshot/577807044870184849?tab=public\nhttp://steamcommunity.com/profiles/76561198032454327/screenshot/577807044957809248/?tab=public\nhttp://steamcommunity.com/profiles/76561198032454327/screenshot/576681779220866118/?tab=public\n\nThank you for reading, goodbye."},{"postId":33363,"topicId":4045,"posterId":2,"postTime":1316158930,"postText":"Unfortunately, we are unable to accept your application at this time."}]}