{"topicId":574,"forumId":122,"topicTitle":"Shark_Shooter","topicTime":1281492407,"topicViews":249,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"[NNJG] Zack","topicFirstPosterColor":"","topicLastPosterName":"[NNJG] Zack","topicLastPosterColor":"","topicLastPostTime":1281735769,"posts":[{"postId":5242,"topicId":574,"posterId":130,"postTime":1281492407,"postText":"Offender name: ṧнαяк_ṧнσσṫeя\nOffender's Steam ID: STEAM_0:1:17410071 \nWhat the Offender did: ṧнαяк_ṧнσσṫeя is 13 witch means he shouldnt be playing gmod anyways. Second this guy cheats the flood server so badly by always glitching in the walls and spamming c4's. Third ṧнαяк_ṧнσσṫeя is so annoying over the mic. and he is always spamming saying \"In my mouth Yeeeeeeeah\". I have oftenly heard players say Admins please do something but they refuse to disipline after hearing a \"No sory, sorry, I'll stop Hahahaha\" so I hope the owners take deep consideration into the matter. Thank You for your time.\nWere there any admins on at the time?: Yes, Boom Shaka\nProof: [NNJG]Zack: Stop spamming shark please\n         jake1055: mute him admins please\n         skate4life84: shark stop, STOP"},{"postId":5258,"topicId":574,"posterId":26,"postTime":1281517898,"postText":">> \nOffender name: ṧнαяк_ṧнσσṫeя\nOffender's Steam ID: STEAM_0:1:17410071 \nWhat the Offender did: ṧнαяк_ṧнσσṫeя is 13 witch means he shouldnt be playing gmod anyways. Second this guy cheats the flood server so badly by always glitching in the walls and spamming c4's. Third ṧнαяк_ṧнσσṫeя is so annoying over the mic. and he is always spamming saying \"In my mouth Yeeeeeeeah\". I have oftenly heard players say Admins please do something but they refuse to disipline after hearing a \"No sory, sorry, I'll stop Hahahaha\" so I hope the owners take deep consideration into the matter. Thank You for your time.\nWere there any admins on at the time?: Yes, Boom Shaka\nProof: [NNJG]Zack: Stop spamming shark please\n         jake1055: mute him admins please\n         skate4life84: shark stop, STOP\n\nPictures, Logs can easily be edited\n\n "},{"postId":5259,"topicId":574,"posterId":55,"postTime":1281532325,"postText":"Today i'll log on on flood and if he come back i'll get an eye on him ;) But like Rain said you need Picture 'Screenshot'' because if you only give logs... We can't really know if you edited or not :p\nIf you don't know how to make screenshot just ask we'll teach you O_O ty.\n\n\nMaK_-"},{"postId":5263,"topicId":574,"posterId":39,"postTime":1281543716,"postText":"You can't make a ban request due to his age or if hes annoying on the microphone."},{"postId":5266,"topicId":574,"posterId":4,"postTime":1281544455,"postText":"Spamming c4's...i don't see a rule that prevents that, unless he's using a script so that he can use multiple c4's at one time.\nOther than that, if he's mic-spamming, i think this topic should go into the Gag-Requests board."},{"postId":5274,"topicId":574,"posterId":2,"postTime":1281562276,"postText":"Spamming c4 = Spamming = Against rules.\n\n ::)"},{"postId":5286,"topicId":574,"posterId":143,"postTime":1281582010,"postText":"first \nage = no difference he could be playing worse and we all know this\nexploit of c4 = against the rules but everybody takes advantage of it now they dont even go away\nmic spamming = just mute him then u can take care of that yourself\nand glitching into walls = way against rules but still fightable, i deal with worse everyday im in the server and i can stop who ever is screwing me.\n\n*future notes* when reporting somebody dont add their age it makes no difference in the solution and it only makes you sound more desperate to get them banned, dont report something you can easly prevent take some charge and take care of it your self mic spamming just mute them dont think twice, REPORT things that you can not prevent like exploit of c4 warn him take a screen shot of it as proof and then report if they dont stop. \n\n*ps* dont get mad at me if you read this and think im a bitch because im not even a rank ive been on flood for a while now and im tired of hearing people cry over small issues"},{"postId":5312,"topicId":574,"posterId":78,"postTime":1281591972,"postText":"Shark act different when there is admin  >:(\nwhen there is no admin on server he alway want money round\nand for who is not admin and don't want a money round\nHe tells every body to kill that one person and then do the money round\nJake send me 3 messeges saying shark and Zack have been money rounding"},{"postId":5320,"topicId":574,"posterId":4,"postTime":1281597082,"postText":"Well, if anyone wants to do anything about it,\nSTEAM_0:1:17410071"},{"postId":5396,"topicId":574,"posterId":130,"postTime":1281735769,"postText":"Ok I would like to add something, saying that all day today that Shark has been welding our stuff around \nand after we weld it he unwelds it at 10 sec and then throughs our props around"}]}