{"topicId":4226,"forumId":3,"topicTitle":"Resignation","topicTime":1316401828,"topicViews":144,"topicReplies":11,"topicStatus":1,"topicFirstPosterName":"FunnyRaff","topicFirstPosterColor":"990000","topicLastPosterName":"SuperFluffyKittens","topicLastPosterColor":"","topicLastPostTime":1316489356,"posts":[{"postId":33629,"topicId":4226,"posterId":243,"postTime":1316401828,"postText":"I am resigning myself from the position of administrator.\nPlease remove me from the admin group, and leave me at VIP, or normal user, whichever you like.\nReason? The community isn't going so well, and if you wanna say that I'm the only one that thinks so, look at every other.. I mean the other two admins."},{"postId":33633,"topicId":4226,"posterId":812,"postTime":1316402439,"postText":"Probably one the most level-headed and fair staff members this server has seen. You've always been there and I really appreciate it dude. I'm really sad to see you go and hopefully we can stay friends."},{"postId":33634,"topicId":4226,"posterId":243,"postTime":1316402559,"postText":"Ill still be around, just not part of administration."},{"postId":33635,"topicId":4226,"posterId":612,"postTime":1316402677,"postText":">> Probably one the most level-headed and fair staff members this server has seen. You've always been there and I really appreciate it dude. I'm really sad to see you go \nagreed.\n\nyou shouldn't resign."},{"postId":33636,"topicId":4226,"posterId":243,"postTime":1316402702,"postText":"LOL, TOO LATE"},{"postId":33637,"topicId":4226,"posterId":243,"postTime":1316403304,"postText":"Just wanted to add, If things get better, I will gladly come back, but until then I can honestly say, the server is going to hell."},{"postId":33641,"topicId":4226,"posterId":142,"postTime":1316404616,"postText":"^ I'll apply again if anything when things get better but for now I'm done."},{"postId":33653,"topicId":4226,"posterId":272,"postTime":1316431412,"postText":"We're sorry to see you go, Funnyraff. Best of luck as part of the community."},{"postId":33660,"topicId":4226,"posterId":634,"postTime":1316432666,"postText":"Sorry to see you go Funny, you always made some time to show up on the server when i asked even if your connection didn't favor it. Thanks for your time and dedication."},{"postId":33665,"topicId":4226,"posterId":769,"postTime":1316436537,"postText":"FunnyRaff, you're a good man. I'm glad you're sticking around at least, so I can knife you and stuff."},{"postId":33680,"topicId":4226,"posterId":364,"postTime":1316444807,"postText":"I think things are going ok, ya sure there have been an increase in ban requests. Also, and increase in people in NNJG trying to ban each other... wow, that sound shitty... Hmm... Well, I deal with it by not not being active... That way when I come back I'll be as happy as ever, hopfully."},{"postId":33777,"topicId":4226,"posterId":945,"postTime":1316489356,"postText":"I'm sad to see you go, FunnyRaff. You were a very good and cool-headed admin :/\nGlad you're still staying around, though [:"}]}