{"topicId":545,"forumId":59,"topicTitle":"Re: Converting Videos with Subtitles","topicTime":1280904651,"topicViews":71,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"[NNJG] Cake","topicFirstPosterColor":"","topicLastPosterName":"DarK_St3alth","topicLastPosterColor":"","topicLastPostTime":1283734896,"posts":[{"postId":5014,"topicId":545,"posterId":13,"postTime":1280904651,"postText":"I'm googling it but no luck so far so if I don't find it maybe one of you can help. Ok so I downloaded an anime series, Japanese with English subtitles, but it came in mkv format. I want to convert it to MPEG-4 or something normal that I can watch on computer without special player and more importantly, so I can watch on Xbox. I got a converter (Ultra MKV Converter), and it converted it like normal, but the subs aren't there -_-, they were on original file so... idk I know nothing about how subs work so someone tell me how to make it work."},{"postId":5023,"topicId":545,"posterId":4,"postTime":1280937907,"postText":"I don't know about conversion but i always watch Anime that comes to me in awkward formats on VLC Media Player.\nIf you have a good codec it should work there."},{"postId":5048,"topicId":545,"posterId":13,"postTime":1280964022,"postText":"I can watch it fine on comp with VLC player but I want it to work on Xbox :(. Converting is easy, trying to get it to convert with subtitles, no. I found something that was supposed to help, something about re-encoding it to new format that can take subtitles. It takes forever though!  A 24 minute episode took an hour and a half to do, and it was like 5 in the morning when I started, so I let it run while I went to sleep, when I woke up it was done, but idk where output file is lol.\n\nEdit: DAMN, I found the output file. It was were I thought it was I just didn't know beause it was the same format as original -_-. Now I gotta wait another hour and a half to convert it (at what I think are the right settings this time) to see if hopefully it will work this time. Although even if it does work, do I really want to do this for every episode in the season? I can queue them up but still atleast an hour and a half for each episode, times 12 episodes (it's a short show), ugh."},{"postId":6525,"topicId":545,"posterId":222,"postTime":1283269701,"postText":">>  Cake\":1kacsivy]I can watch it fine on comp with VLC player but I want it to work on Xbox :(. Converting is easy, trying to get it to convert with subtitles, no. I found something that was supposed to help, something about re-encoding it to new format that can take subtitles. It takes forever though!  A 24 minute episode took an hour and a half to do, and it was like 5 in the morning when I started, so I let it run while I went to sleep, when I woke up it was done, but idk where output file is lol.\n\nEdit: DAMN, I found the output file. It was were I thought it was I just didn't know beause it was the same format as original -_-. Now I gotta wait another hour and a half to convert it (at what I think are the right settings this time) to see if hopefully it will work this time. Although even if it does work, do I really want to do this for every episode in the season? I can queue them up but still atleast an hour and a half for each episode, times 12 episodes (it's a short show), ugh. \n\n\nOr instead of wasting your time, try these options (yes, I know this is an old thread but I know everyone will be asking):\n\nA) Install K-Lite codec pack , because I'm 100% sure that your using something like DivX.\n\nB) Use ffmpeg, a much better alternative to ANY \"video converter\" (it's free, open source and can do any media format to any other media format). Just google around for a compiled version or I might post my copy that works."},{"postId":6533,"topicId":545,"posterId":13,"postTime":1283282114,"postText":"Normally we discourage against revieving old topics but in this case were I never solved it I am gonna say thank you. I have the codecs to play it on comp, they work very well with VLC, but wanted to convert so it would work on Xbox. I eventually figured it out, a lot of trouble but whenever I need it I can get it to work. Thank you and I would lock but I can't on new forums, Punk will do it later though I'm sure ;P."},{"postId":6540,"topicId":545,"posterId":153,"postTime":1283287140,"postText":"Bumping topics is allowed in this section."},{"postId":6568,"topicId":545,"posterId":4,"postTime":1283300404,"postText":">> Install K-Lite codec pack, because I'm 100% sure that your using something like DivX.  \n\nI hate all codecs except K-Lite. i used it for sony vegas 9 on my comp before i formatted, and it worked perfectly, and let me make stupid youtube videos =D\n\nBut i upgraded to sony vegas 10, unfortunately had to switch codecs since k-lite wasn't doing its magic.\n\nStill, very good codec, i'm glad someone else here uses it."},{"postId":6665,"topicId":545,"posterId":13,"postTime":1283483907,"postText":"@Ben Thanks I didn't know, I never read the rule posts for any section XD. Btw what is the time limit on normal topics that you can post after the last post before it is considered bumping or reviving dead?\n\n@Kry I think I intstalled that a while ago for like one anime I downloaded that was a weird codec and it didn't need it anyway lol. Between VLC, standard DivX pack, and what already comes on my OS I haven't needed any extra codecs, then again I don't do any fancy video editing besides encoding and adding/changing subtitles to vids."},{"postId":6910,"topicId":545,"posterId":222,"postTime":1283734896,"postText":"@cake\n\nLol, I love everyone thinks I'm a nub, great to see you know as well!"}]}