{"topicId":901,"forumId":19,"topicTitle":"Server Staff Possition Open!","topicTime":1285974182,"topicViews":182,"topicReplies":11,"topicStatus":1,"topicFirstPosterName":"DarK_St3alth","topicFirstPosterColor":"","topicLastPosterName":"DarK_St3alth","topicLastPosterColor":"","topicLastPostTime":1286155400,"posts":[{"postId":8617,"topicId":901,"posterId":222,"postTime":1285974182,"postText":"  Wanted   to be a  moderator  on a server?  Want the chance too?  You came to the right place!\nI'm doing a staff clean, a spot for 1 person is now open...\n  \n  Please follow the guide below if you would like it. It doesn't have to look nice, but decent spelling would be great!  \n \n[*:29ib6wqs]What are your ties to NNJG? How long have you been around? Do you wear the clan tag?[/*:m:29ib6wqs]\n[*:29ib6wqs]Are you older then 13?  I don't care if you aren't , you can even pm me this..[/*:m:29ib6wqs]\n[*:29ib6wqs]How experienced are you with moderating?  Don't care  how much...[/*:m:29ib6wqs]\n[*:29ib6wqs]Can you provide recommendations - would someone like you as mod? [/*:m:29ib6wqs]\n[*:29ib6wqs]What are the server's rules?[/*:m:29ib6wqs]\n[*:29ib6wqs]What would you do if a guest was disrespecting a fellow moderator?[/*:m:29ib6wqs]\n[*:29ib6wqs]What would you do if a guest was disrespecting a NNJG member?[/*:m:29ib6wqs]\n[*:29ib6wqs]What's your time zone? What times do you regularly go on? What country are you from?[/*:m:29ib6wqs]\n[*:29ib6wqs]Who owns the server? ( Doesn't matter  - but do you know?)[/*:m:29ib6wqs]\n[*:29ib6wqs] Have you received punishment from an admin? If so, for what? [/*:m:29ib6wqs][/list:u:29ib6wqs]\n\n  An example:  \n>> \n1. I'm a member of staff for NNJG. I wear the clan tag on the right. =)\n2. Yes, I am.\n3. I've moderated on several forums and I'm the administator of an NNJG server. I used to have my own servers.\n4. Yes, via steam PM.\n5. <Server Rules here> they mean: <explanation here>\n6. <Answer Here>\n7. <Answer Here>\n8. My time zone is GMT-7, After school (4:00pm) & weekends, Canada\n9. <Secret Answer Here>\n10. Yea, Gash banned me for 5 mins for some reason on Tactical...\n \n \nI have a team of 4 mods. Hope you can be one of them! \n~  DarK_St  3  alth "},{"postId":8618,"topicId":901,"posterId":95,"postTime":1285975519,"postText":"1. I am a vip on ttt and i have been playing here for at least six months.\n2. I AM 13\n3. I'm vip on a server, other than that none.\n4. Probably\n5. No racism, respect players, Don't spam, stuff along those lines.\n6. gag/mute them and if they rejoined to avoid it re gag/mute them.\n7. Same thing.\n8. Eastern. I'm on whenever I''nm not at my grandmother's house or at school. So pretty much all day. AMERICA.\n7. You, Dark St3alth.\n8. Mostly when i get banned from a server NOT NNJG on purpose."},{"postId":8620,"topicId":901,"posterId":101,"postTime":1285977191,"postText":"* What are your ties to NNJG? How long have you been around? Do you wear the clan tag? Im a member, im your master (lol), ive been playing on the servers since Shadow's Jail, I sometimes wear the tags.\n    * Are you older then 13? I don't care if you aren't, you can even pm me this.. Yes\n    * How experienced are you with moderating? Don't care how much... I am good at moderating\n    * Can you provide recommendations - would someone like you as mod? Yes\n    * What are the server's rules? The D.U.M.B system\n    * What would you do if a guest was disrespecting a fellow moderator? Tell them to stop or else\n    * What would you do if a guest was disrespecting a NNJG member? Stop or else\n    * What's your time zone? What times do you regularly go on? What country are you from? EST, nearly whenever I am home, USA\n    * Who owns the server? (Doesn't matter - but do you know?) Trick question i think, Dark Stealth is the one who does most of the files and whatnot, but Im pretty sure just does FTP but does not pay for it\n    * Have you received punishment from an admin? If so, for what? No more than a 5 minute ban on TF2 because me punked and gash were having a admin fight"},{"postId":8624,"topicId":901,"posterId":48,"postTime":1285978416,"postText":"1. I'm a mod on TTT, and on Flood. I joined sometime in the middle of May. I generally wear the clan tag on the left.\n2. Yes, I'm 15 at the moment.\n3. Been an admin on Flood since mid June, not quite sure when i got mod on TTT. I'm experienced with both ULX and ASSMod.\n4. If prior recommendations count, you can check my staff app for floodmin in the approved section of the boards. If not, upon request I could get more, or you could just PM other NNJG members and ask if they think I am a good mod.\n5. Disrespecting admins will get you banned! Don't argue with them! - Basically means people should respect admins, and not try to argue against their judgement.\n Universally applies, everyone abides to these rules. - Even the admins should follow the rules.\n Macros, bots, scripts, hacks, and sound playing systems (HLDJ) or anything else, will get you banned! - Don't use any scripts or software, just play the game and enjoy it.\n Don't like something on this server? Admin being a pain in the ass? Report it @ nonerdsjustgeeks.com - Mainly just for feedback, and to say if an admin is doing a good job or not.\n6. Depending on the severity of the person's words, either go straight to a gag or a mute, or else warn them; and then gag or mute them if it continued.\n7. The same as with question 6, I believe anyone in the clan should really be treated equally, as they're all part of the community.\n8. My time zone is GMT -5, currently -4 due to daylight savings time. Any time after school (3:30ish), and weekends. Ontario, Canada.\n9. Don't you own it? Unless the old deathrun server was converted to this, in which case Gash would be the one who owns it.\n10. Not that I can think of... on our servers anyways. Maybe a kick once or twice for accidental rtv."},{"postId":8628,"topicId":901,"posterId":4,"postTime":1285980257,"postText":"1. I've been with NNJG since late 2009. I don't wear the tag (undercover biznatch).\n2. Yes.\n3. I've been moderating servers ever since my brother hosted an MMO back in 2005\n4. 3 people recommended me for moderator in early 2010. 25 for Admin in February. More than 50 by now would recommend me for CS:S, I'm sure.\n5. D.U.M.B.\n6. I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 30 minutes.\n7. I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 15 minutes.\n8. Mountain, I'm on my computer pretty much from 4:00pm every day to 11:00pm on weekdays, on weekends it's usually more unless i have other plans.\n9. St3alth_Dark\n10. Ben permabanned me from all NNJG servers one time because i insulted his iPhone.\n\nExtra: I'll be making an advertisement for the server soon :3"},{"postId":8638,"topicId":901,"posterId":26,"postTime":1285991389,"postText":">> 1. I've been with NNJG since late 2009. I don't wear the tag (undercover biznatch).\n2. Yes.\n3. I've been moderating servers ever since my brother hosted an MMO back in 2005\n4. 3 people recommended me for moderator in early 2010. 25 for Admin in February. More than 50 by now would recommend me for CS:S, I'm sure.\n5. D.U.M.B.\n6.  I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 30 minutes.\n7. I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 15 minutes. \n8. Mountain, I'm on my computer pretty much from 4:00pm every day to 11:00pm on weekdays, on weekends it's usually more unless i have other plans.\n9. St3alth_Dark\n10. Ben permabanned me from all NNJG servers one time because i insulted his iPhone.\n\nExtra: I'll be making an advertisement for the server soon :3 \n\nThis is etchy, I'd rather just ban either cases for 30 minutes, Since personally admin disrespect is equivalent to trolling/harassment. Just to a person of higher power, And even if they are higher that doesn't mean its harsher again'st the rules.\n\nAnyways aren't you a global admin? :\\"},{"postId":8639,"topicId":901,"posterId":4,"postTime":1285992501,"postText":">> >> 1. I've been with NNJG since late 2009. I don't wear the tag (undercover biznatch).\n2. Yes.\n3. I've been moderating servers ever since my brother hosted an MMO back in 2005\n4. 3 people recommended me for moderator in early 2010. 25 for Admin in February. More than 50 by now would recommend me for CS:S, I'm sure.\n5. D.U.M.B.\n6.  I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 30 minutes.\n7. I would give them a fair warning and tell them to read the rules. If it continued, i would ban him/her for 15 minutes. \n8. Mountain, I'm on my computer pretty much from 4:00pm every day to 11:00pm on weekdays, on weekends it's usually more unless i have other plans.\n9. St3alth_Dark\n10. Ben permabanned me from all NNJG servers one time because i insulted his iPhone.\n\nExtra: I'll be making an advertisement for the server soon :3 \n\nThis is etchy, I'd rather just ban either cases for 30 minutes, Since personally admin disrespect is equivalent to trolling/harassment. Just to a person of higher power, And even if they are higher that doesn't mean its harsher again'st the rules.\n\nAnyways aren't you a global admin? :\\ \n\nyes, global super admin. but not on this"},{"postId":8653,"topicId":901,"posterId":222,"postTime":1286032160,"postText":">> 9. St3alth_Dark \n\nLol?"},{"postId":8674,"topicId":901,"posterId":112,"postTime":1286059559,"postText":"-What are your ties to NNJG? How long have you been around? Do you wear the clan tag?\nAdmin on 4 servers. 3-4 months (lul).Yes\n-Are you older then 13? I don't care if you aren't, you can even pm me this..\nI'm 15.\n-How experienced are you with moderating? Don't care how much...\nI've been admin on 5 servers. :D\n-Can you provide recommendations - would someone like you as mod? \nI think I could, how many would I need?\n-What are the server's rules?\n\nDon't hack\nDon't disrepect\nDon't QQ, post something on the website.\n-What would you do if a guest was disrespecting a fellow moderator?\nMute/gag.\n-What would you do if a guest was disrespecting a NNJG member?\nMute/gag.\n-What's your time zone? What times do you regularly go on? What country are you from?\nCan't think of timezone right now ;-; Brainfart.. I'm on mostly all day every day. U.S.A\n-Who owns the server? (Doesn't matter - but do you know?)\nI think Dum was right on that :3\n-Have you received punishment from an admin? If so, for what?\nAccidentaly rtving :3"},{"postId":8679,"topicId":901,"posterId":271,"postTime":1286061180,"postText":"# IRL friends with the server admin. I play on the Gmod and CSS servers regularly. I have been playing Gmod 1 month, CSS 2 weeks, and I wear the NNJG tag.\n# Yes I am - whats the point of this Q if you don't care?\n# I was a forum mod on several role playing websites, and I managed and kept clean several large clans. (RIP)\n# Yourself - We know eatchother IRL\n# A variety of things along the lines of \"Don't hack, don't be racist or discriminatory. No Grief-ing or team killing. Treating everybody equally\" That kinda stuff - In essence It means, \"Don't be a retard you sod, and just cause your a mod doesn't mean you'll get away with things.\"\n# Give 1 warning - If the player persists, I would kick. If (s)he rejoins, continues doing it, 1 more warning then Banno! for 24 hours.\n# GMT -7 AKA mountain time west. 4:00-5:00 weekdays, about 4 hours a day on weekends. I am from Canada\n# I beleive you said that Gash does. He has assigned you ownership mainly cause he was too lazy (no offense, I am too) and you've shown your pwnage awesome script powers.\n# No punishment - although I was on this British TTT server once, and there was a tea party and I was kicked for not serving tea to the mods.... that was weird."},{"postId":8700,"topicId":901,"posterId":222,"postTime":1286150718,"postText":"Ok so I'm going to decide today, in about 1-2 hours...\n\nPlus a staff meeting over steam will take place shortly afterward..."},{"postId":8703,"topicId":901,"posterId":222,"postTime":1286155400,"postText":"   Ok here is the final decision..    \n  _____________________  \nI'd like to thank my current team, you've been great and will stay how you are - trustworthy in a high ranked position...\n \n[*:3n56tw4t]F@rr0w[/*:m:3n56tw4t]\n[*:3n56tw4t]D@rK N1ght[/*:m:3n56tw4t]\n[*:3n56tw4t]Dom-el-1337-o[/*:m:3n56tw4t][/list:u:3n56tw4t]\n\n I'd like to thank everyone who put in an application, they were all great - but I can't take you all though, one day maybe! \n\nThe   two   people I'm going to take are... \n  [insert dramatic music here]  \n\nLink and Deth.\n\n [clapping here] \n\nThe reason I picked them were a VERY key thing I look for. Defuse, instead of fuse - they defuse arguments instead of continuing them. They both act calmly and maturely, and they seem trust worthy enough to act when needed. I just need your steamIDs to welcome you to the team.\n\n  All Tactical staff members, please contact me about a very short staff meeting, we have a few things to discuss...  \n\n /lock? "}]}