{"topicId":4810,"forumId":1,"topicTitle":"[12/11/2011] Game Night [DONE]","topicTime":1320602537,"topicViews":248,"topicReplies":25,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Domineeto","topicLastPosterColor":"","topicLastPostTime":1320877583,"posts":[{"postId":37289,"topicId":4810,"posterId":82,"postTime":1320602537,"postText":"Game nights are back! 3 completely new games up for voting this week! \n http://i.imgur.com/IzJuN.png  \n\nToribash is an innovative fighting game based on the physics sandbox model where YOU design the moves. Toribash is Addictive! Try Wushu, Sumo, Kick Boxing, Sambo, Swords, Judo and more. Create fighting movies and post them on YouTube. Watch other players fight. Chat with them. Defeat them! I haven't played this in a few years, and completely forgot it had multiplayer.\n\nOfficial Website \nGameplay \nDownload \n\n http://i.imgur.com/VIVp6.png  \n\nOpenClonk is a free multiplayer action game where you control clonks, small but witty and nimble humanoid beings. The game is mainly about mining, settling and fast-paced melees. OpenClonk is also not just a game but also a versatile 2D game engine that offers countless possibilites to make own mods. I had downloaded it months ago, just remembered it had multiplayer today, installed and had a blast with all the fun included scenarios to play!\n\nOfficial Website \nGameplay \nDownload \n\n http://i.imgur.com/IXE3Y.png  \n\nNeverdaunt is a dream like world of floating Islands and falling stars where nearly anything can happen. 8Bit refers to the era of computers with eight bit processors. N8* parodies the graphics style these computers were capable of and 8Bit also refers to N8* being a kind of Neverdaunt lite. \nN8* is an online massively multiplayer virtual sandbox, A place to play, make friends, be creative and competitive. Very complicated for new players, I suggest having the wiki ready.\n\nOfficial Website \nGameplay \nDownload "},{"postId":37291,"topicId":4810,"posterId":634,"postTime":1320602696,"postText":"Tough choice this time around, they all look fun, but Clonk takes the cake for me, it only beat N8 for me because I want an easy to learn game."},{"postId":37299,"topicId":4810,"posterId":1035,"postTime":1320604325,"postText":"Well, I picked N8 just because i wanna go around yelling (In a judge dredd costume) \"I AM THE LAW!\" Other than that, I would've picked Clonk."},{"postId":37316,"topicId":4810,"posterId":1094,"postTime":1320614617,"postText":"Clonk and N8 both look interesting.  N8 is probably my choice since the whole sandbox aspect is very appealing.  Might be hard to convince people to do it since there really isn't a \"goal\" to accomplish.  People might run out of ideas and get bored fast D:\nBut I want it."},{"postId":37319,"topicId":4810,"posterId":373,"postTime":1320615363,"postText":"I vote for N8, but plan on trying out Toribash cause it looks pretty cool bro"},{"postId":37322,"topicId":4810,"posterId":243,"postTime":1320615659,"postText":"Ive been practicing Toribash..\nI can now break my own wrist multiple times.\n\nI am also very dissapointed that people dont vote for it ;-;"},{"postId":37341,"topicId":4810,"posterId":1035,"postTime":1320620340,"postText":"I have played Toribash, Its harder than a lot of things, Like my penis (wait what). Any how Its not really for newcomers its not very welcoming either."},{"postId":37343,"topicId":4810,"posterId":84,"postTime":1320620991,"postText":"I voted Toribash because raff was sad more people didn't vote for it."},{"postId":37354,"topicId":4810,"posterId":1097,"postTime":1320623328,"postText":"TORIBASH LOOKS SO COOL\n\nEdit: It's harder than it looks"},{"postId":37376,"topicId":4810,"posterId":82,"postTime":1320630894,"postText":">> TORIBASH LOOKS SO COOL\n\nEdit: It's harder than it looks \nI was good a few years back, I remember doing a frontflip and kicking the opponents head off, I don't know how the hell I did it, it was probably one of the tutorials because I skipped them this time around, I would say Open Clonk is the easiest to get into and the most fun :)"},{"postId":37386,"topicId":4810,"posterId":375,"postTime":1320636398,"postText":"Is Toribash for PC? Because I had it on the Wii. It was a whole lot of fun and I would enjoy playing it again... However ( Sorry Funny ) my vote is for N8 because it's an open world sandbox game that sounds new and fun."},{"postId":37387,"topicId":4810,"posterId":101,"postTime":1320636658,"postText":"Toribash.\n\nClonk = ANOTHER FUCKING MINING GAME\nN8 seems just kind of generic."},{"postId":37391,"topicId":4810,"posterId":735,"postTime":1320641686,"postText":"Toribash. Incredibly fun game with different types of fighting."},{"postId":37404,"topicId":4810,"posterId":243,"postTime":1320671916,"postText":">>  my vote is for N8 because it's an open world sandbox game that sounds new and fun. \n\nThis game is actually not very new. Its been out for at least a year."},{"postId":37405,"topicId":4810,"posterId":82,"postTime":1320672079,"postText":">> \nClonk = ANOTHER FUCKING MINING GAME \nThe Clonk series has been around for over 5 years, it isn't the most popular (by far) but it is really great and underrated. The difference with Clonk is that there are many scenarios that can be chosen, not just survival. There are rocket pack races, grappling hook trials, sieges, and battle arenas, the focus in not on mining or building.\n\n>> \nThis game is actually not very new. Its been out for at least a year. \nOver a year :)"},{"postId":37418,"topicId":4810,"posterId":812,"postTime":1320696844,"postText":"N8 looks pretty cool, I'd like to see what we could all build there."},{"postId":37422,"topicId":4810,"posterId":373,"postTime":1320699125,"postText":"I'd like to change my vote to toribash, but I can't. So I'll say it here"},{"postId":37424,"topicId":4810,"posterId":142,"postTime":1320700441,"postText":"I'd say toribash or N8\nToribash because you can go around liek a noob and break yo self\n\nN8 Looks pretty funny and almost liek a roleplay with the many costumes or w/e :D\nAs well as make team battles/forts and alot of other stuff o3o"},{"postId":37443,"topicId":4810,"posterId":517,"postTime":1320705656,"postText":"I picked Toribash and im not going to touch it untill game night, so i will be easy pickings :P"},{"postId":37445,"topicId":4810,"posterId":101,"postTime":1320706567,"postText":"I tried Toribash out. How the fuck do I play it."},{"postId":37446,"topicId":4810,"posterId":373,"postTime":1320706729,"postText":"Click the balls on your ragdoll-like person's arms, legs and there should be a description near the bottom of the screen. \n\nContracting, something else, extending etc.  Mix and match to find out how to kill shit with your barehands"},{"postId":37447,"topicId":4810,"posterId":735,"postTime":1320706854,"postText":"You can contract, extend, hold, and relax almost all parts of your body. Click on hands to grab on to other objects or another person (Be careful you can also grab on to your self)"},{"postId":37448,"topicId":4810,"posterId":373,"postTime":1320706918,"postText":"That was a much better explanation, thanks"},{"postId":37488,"topicId":4810,"posterId":142,"postTime":1320716567,"postText":"or smash yo keyboard trying to learn how to play it and die everytime"},{"postId":37507,"topicId":4810,"posterId":735,"postTime":1320760334,"postText":"Toribash does take a while to get used to and understand it, so I think n8 is a better choice."},{"postId":37585,"topicId":4810,"posterId":82,"postTime":1320877583,"postText":" http://i.imgur.com/IXE3Y.png  \n Will be played November 12th 2011 at 7:00pm PST \nIt can be downloaded here \n "}]}