{"topicId":2798,"forumId":14,"topicTitle":"1 week ban for something that shouldve been a slap/warning.","topicTime":1306098876,"topicViews":138,"topicReplies":9,"topicStatus":1,"topicFirstPosterName":"tweekie","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1306117399,"posts":[{"postId":22454,"topicId":2798,"posterId":801,"postTime":1306098876,"postText":"Your In-Game name:TweeKie Kaiser\nYour Steam ID:STEAM_0:0:39625896\nReason:hug/line of fire/freekill\nLength of Ban/Date and Time of Unban:1 week bann\\ banned around 3 days ago\nWhat server were you playing?:NNJG jail server\nWho banned you?:Quack\nWhy should we unban you?:when you do an accidental freekill, isnt it a slap/warning, i got banned and he didnt even get me time to explain, how and why i shot him, and he just banned me right away. my brother and my friend chuck was next to me (we have 3 computers) and they was complaining to him and the admin \"quack\" said its done forget about it. i suspect that that is an unfair ban, since i didnt get a warning, and i got banned right away for a whole week."},{"postId":22456,"topicId":2798,"posterId":112,"postTime":1306099888,"postText":"How do you accidentally freekill?"},{"postId":22457,"topicId":2798,"posterId":801,"postTime":1306100149,"postText":">> How do you accidentally freekill? \nthe guy that knifed me, ran into him, and was hugging him, and thats the only way i killed both of them"},{"postId":22458,"topicId":2798,"posterId":695,"postTime":1306100323,"postText":"Well... me, Bird Flu, Balenti was there. tweekie come and play like first 3 round as prisoner. on the next round he switch to guard. Tweekie give order, but one prisoner try to rebel. and tweekie open fire. but the prisoner that tweekie try to kill is running around near a group of prisoners. obviously crossfire happened. 4 died. quack, 2 prisoners, and me ( but i died in solitary cuz i try to rebel. at the same time )\n\nQuack should just give a warning or slap him on the next round. Instead, Quack banned him for 1 week."},{"postId":22493,"topicId":2798,"posterId":801,"postTime":1306113446,"postText":"i know right? thats just cruel. it just doesnt seem fair, other people freekill and dont even get slapped, there is a rebel and he died, then 1 week ban.... thats just wrong...."},{"postId":22500,"topicId":2798,"posterId":112,"postTime":1306113856,"postText":">> i know right? thats just cruel. it just doesnt seem fair, other people freekill and dont even get slapped, there is a rebel and he died, then 1 week ban.... thats just wrong.... \n\n\nChuck said you killed four people? In crossfire?\nL2aim maybe? Don't shoot after him as he passes other prisoners?\nYou caused this yourself.\n\nAnd you monster, considering you clearly can't read (as proved by your staff app and this post.) Don't post in unban requests you aren't directly involved in."},{"postId":22526,"topicId":2798,"posterId":801,"postTime":1306116669,"postText":"he didnt post the unbann, i did, cause im the one who is banned, its just he was with me...\nAND. yes, i know i did shoot other prisinors on accident, because there were alot of people revolting, so i tried to kill them. so i shouldve got a slap, and a warning. not a 1 week ban. i didnt go shoot them willy nilly for no reason."},{"postId":22528,"topicId":2798,"posterId":115,"postTime":1306116725,"postText":"You killed 4 prisoners up against a walk, following orders. I know they all didnt do anything because I was right there and I was one of the ones you killed. It was blatant rdm and is staying.\n\nAnd don't try to bullshit me about crossfire. It happened in a span of 30 seconds or so. We weren't right next to each other either."},{"postId":22531,"topicId":2798,"posterId":801,"postTime":1306117193,"postText":">> You killed 4 prisoners up against a walk, following orders. I know they all didnt do anything because I was right there and I was one of the ones you killed. It was blatant rdm and is staying.\n\nAnd don't try to bullshit me about crossfire. It happened in a span of 30 seconds or so. We weren't right next to each other either. \nchuck was there, he Saw them rebelling, and 30 seconds? i had 2 people run out of the bathroom door and 1 ran back in, so i shot them, and yes that was bad for me to do so, BUT! he did revolt, and i did kill him. i didnt shoot for no reason! i shouldve got a slap! not a 1 week ban."},{"postId":22532,"topicId":2798,"posterId":115,"postTime":1306117399,"postText":"I didnt ban you for killing a rebelling prisoner, I banned you for killing 3 innocent prisoners before killing the rebelling prisoner. \n\nEven if he did run up to the wall where everyone else was, that doesnt make it right to shoot wtecklessly into the line of prisoners."}]}