{"topicId":4692,"forumId":12,"topicTitle":"What's your finest hour?","topicTime":1319780894,"topicViews":110,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"Stratos","topicFirstPosterColor":"","topicLastPosterName":"MarioDJW","topicLastPosterColor":"990000","topicLastPostTime":1320289971,"posts":[{"postId":36617,"topicId":4692,"posterId":1016,"postTime":1319780894,"postText":"What is your \"finest hour\" in Jail Break. I've had quiet a few, one was on Mars using wits. It was trivia day with five guards and 10 prisoners, I hid in a cell and I answered every question correctly picking off names I saw in chat. It wasn't till there was about 3 people left on the wall did they notice \"hey there is only two people here\" in which I quickly stated I was in the top vent and to come get me, prior to this I had opened it during some rebelling and chaos. Two guards went in the vent to die in the vacuum of space, one guard found me but I killed him with my knife, while he dropped his USP. While this is happening the trivia is now to the last person and they have the prisoner help find me. My fellow prisoner finds me and traps me in the cell and the guards quickly make their way to my cell. I pull out the USP and have a small gun fight killing the one guard and me with 10 HP left. As the last guard is about to pull his gun out, the traitorous prisoner turned on the guard ending the round. \n\nNow I dont know if this counts as Spam, but it would be nice to hear other player's epic moments."},{"postId":36622,"topicId":4692,"posterId":373,"postTime":1319788792,"postText":"Since we have a \"Epic Traitor Round of all time\" thread in the TTT section I doubt this will be scrapped/thrown into the spam box"},{"postId":36628,"topicId":4692,"posterId":1140,"postTime":1319821599,"postText":"Hmm, I would have to say when I was a CP, all the prisoners had broken into the armory, and it was just me and my Deagle. Killed about 15 or so and won the round. :)"},{"postId":36653,"topicId":4692,"posterId":735,"postTime":1319857340,"postText":"hellz\nTrivia day\nGuard Types the question\nknifes him\nGoes back to wall\nNot Caught LOLOLOLOLOL\nUse gun and kill the afk guard in the tower\nall hell breaks loose\nKilled all other 5 guards"},{"postId":36997,"topicId":4692,"posterId":1169,"postTime":1320284760,"postText":"I have two, both on the mars map.\n\nThe first one was when my LR was a \"Break The Glass Day\" and everyone broke the glass, and all prisoners got dragged into it and died. I loled.\n\nThe second one was when I hid in my cell while the guards were playing Simon Says with all the other prisoners, ran around them without being caught, jumped up the boxes to the armoury, and killed all 6 guards myself without running out of ammo. It was pretty fancy."},{"postId":37002,"topicId":4692,"posterId":1174,"postTime":1320285904,"postText":"Lr was Twilight Day\nGuards were team Jacob\nPrisoners were team Edward\nWe talked like Tweens the rest of the round."},{"postId":37010,"topicId":4692,"posterId":1016,"postTime":1320288821,"postText":">> Lr was Twilight Day\nGuards were team Jacob\nPrisoners were team Edward\nWe talked like Tweens the rest of the round. \n\nI think I would have typed kill in console for that very reason"},{"postId":37011,"topicId":4692,"posterId":372,"postTime":1320289971,"postText":"I love anytime that I am alone and going behind guards backs.  Can't really think of any specific instances because there have been a lot of them."}]}