{"topicId":2496,"forumId":3,"topicTitle":"Aww, i didn't get 3 of em :(","topicTime":1304032335,"topicViews":147,"topicReplies":10,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1304113583,"posts":[{"postId":19914,"topicId":2496,"posterId":79,"postTime":1304032335,"postText":"Just a pic a me owning in TTT, sadly i didn't get to kill 3 people.\n\nhttp://cloud.steampowered.com/ugc/576669726736849696/64185F59E00E7C47ECAB20016AC79E9BE66E02E2/\n\nIf only my traitor buddies did worse :)"},{"postId":19921,"topicId":2496,"posterId":521,"postTime":1304033917,"postText":"Bro\ntheres a TTT lolz screenshot thread for this"},{"postId":19922,"topicId":2496,"posterId":79,"postTime":1304034190,"postText":"omg, really. o wait. This is in the TTT thread. where TTT related stuff can be posted."},{"postId":19930,"topicId":2496,"posterId":612,"postTime":1304035296,"postText":">> omg, really. o wait. This is in the TTT thread. where TTT related stuff can be posted. \ntroll."},{"postId":19936,"topicId":2496,"posterId":272,"postTime":1304036556,"postText":"Crisis, post these in the TTT LOLZ thread.\n\nhttp://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=3&t=1981"},{"postId":19953,"topicId":2496,"posterId":79,"postTime":1304039232,"postText":"I dont wanna :P. Open post people read more often, lolz thread i feel like people just ignore half the time. (I know i do)\n\nAlso, if Corey wants to keep being a prick can someone stop him from posting stupid ass comments? You don't like me i get it, but get off thinking your all high and mighty and stop posting troll comments on other peoples threads. If you don't like me, don't read my threads. Getting tired of your prick comments both in game and now on the forums. Or maybe i should make prick comments on all your threads too. Oh wait, that would mean you get to say troll again. Please just keep prick comments to yourself or put them in your diary. Either one of those works. If i have to keep hearing this shit, im gonna just mute you in game as well as make a post to remove your forum access. I don't know how no one has stopped you thus far from posting these comments but I have had enough of it."},{"postId":19963,"topicId":2496,"posterId":634,"postTime":1304041465,"postText":"This whole Corey/crisis conflict is getting out of hand. You both need to calm yourselves and get a grip. no one is being a troll."},{"postId":19971,"topicId":2496,"posterId":389,"postTime":1304046499,"postText":"WOW seriously.... theres so much hate going around....\n\nCan you guys stop thinking everything is offensive.... seriously it pisses me off.\nex. I was trying to join a new clan for another game and i wrote this on there forums. \"Lets see if you guy can pass the 1 month challenge.\" and the leader gets pissed off.\n\nI really do hope you guys aren't like that dick, the first thing you guys would do is think \"OMG. THIS BASTARD OFFENDED ME. LETS MAKE A COMMOTION OR INSULT HIM OR SOMETHING!!!\"\n\nCorey that wasn't really trolling, from my view point. He was just being sarcastic or something.\n\nAlso \n>> This whole Corey/crisis conflict is getting out of hand. You both need to calm yourselves and get a grip. no one is being a troll. \n\nI agree with Destar... this conflict between the two of you is getting out of hand. Either the two of you guys resolve it yourselfs or even just ignore each other (me and that leader guy are ignoring each other :D) would be good enough. If theres gonna be too much conflict, instead of the 2 involved, there might be more and punishments will take place. \n\nNote: I'll be bak on tmr night :D I'm serious about punishments kinda."},{"postId":19972,"topicId":2496,"posterId":79,"postTime":1304047026,"postText":"Im actually quite calm and left everything to the abuse thread i made and since it went nowhere i dropped it all. But 2 examples of what he's been doing.\n\n1) In this thread his calls me a troll because i make a comment how i posted a TTT comment in TTT thread.\n2) Soon as i log on, i hear talking bout prop killing and someone asking if it's allowed. I answered his question since it was directed towards anyone and Corey's first response to me saying anything about it is. \"Oh god, here comes the rule book.\" \n\nAm i taking this too far? I think not, i stopped talking after asking the thread to be locked and the next day he starts all this bs again. Soon as i get proper evidence of his abuse/RDM it will go up without a second thought. And again, if he posts something random one more time that is even close to trolling/flaming. I will post another thread about it. Im sick of everyone thinking i started this when all I did was report someone for doing something not allowed. Destar thinks this went out of hand cause (more then likely) he's Coreys friend. Have done nothing to deserve all this bs. Pharaoh even heard him say \"oh god, here comes the rule book\" and did nothing about it. No that comment isn't a compliment not when you say it in a degrading manner like he did.\n\nAgain, if he continues this bullshit, I will again request something be done to him, but next time i will talk DIRECTLY to Gash and Ben about it and forget using the forums to make a post about it."},{"postId":19973,"topicId":2496,"posterId":612,"postTime":1304047726,"postText":">> Im actually quite calm and left everything to the abuse thread i made and since it went nowhere i dropped it all. But 2 examples of what he's been doing.\n\n1) In this thread his calls me a troll because i make a comment how i posted a TTT comment in TTT thread.\n2)  Soon as i log on, i hear talking bout prop killing and someone asking if it's allowed. I answered his question since it was directed towards anyone and Corey's first response to me saying anything about it is. \"Oh god, here comes the rule book.\"  \n\n Am i taking this too far?  I think not, i stopped talking after asking the thread to be locked and the next day he starts all this bs again.  Soon as i get proper evidence of his abuse/RDM it will go up without a second thought . And again, if he posts something random one more time that is even close to trolling/flaming. I will post another thread about it. Im sick of everyone thinking i started this when all I did was report someone for doing something not allowed.  Destar thinks this went out of hand cause (more then likely) he's Coreys friend. Have done nothing to deserve all this bs.   Pharaoh even heard him say \"oh god, here comes the rule book\" and did nothing about it.  No that comment isn't a compliment not when you say it in a degrading manner like he did.\n\nAgain, if he continues this bullshit, I will again request something be done to him, but next time i will talk DIRECTLY to Gash and Ben about it and forget using the forums to make a post about it. \n\n\n you just joined and we were discussing something that happened before you got in. and you started listing off rules when we were haveing the debate \n\n\n\nAlso, the comment i said \"troll.\" on, yeah, that is trolling. yet you call me  a troll.  GROW UP.\n basically looking for anyreason to ban me?   taking it to far \n\n execpt shoot me because you have a very tiny opening making it a barely legal rdm. also. Destar isnt \"on my side or anything, you just keep being arrogant like you know everything. you dont.  \n\n because you had no idea what was going on. butt out sometimes. \n\ncrisis. what dont you get\nyou are wrong."},{"postId":20049,"topicId":2496,"posterId":101,"postTime":1304113583,"postText":"Locked.\n\nCrisis, follow the rules, don't argue since you are ignorant."}]}