{"topicId":2169,"forumId":26,"topicTitle":"Hiya","topicTime":1300665085,"topicViews":120,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Jake Venture","topicFirstPosterColor":"","topicLastPosterName":"Evil-Dalek","topicLastPosterColor":"","topicLastPostTime":1301452097,"posts":[{"postId":17586,"topicId":2169,"posterId":611,"postTime":1300665085,"postText":"I was originally DeathWing, however due to name changes I am: Jake Venture.\n\n\nI playz Minecraft, Gmod, Css, TF2, HL2DM :)\n______________________________________________________________________________\nAnd I has question: What does it take to become a mod... I've played on the Jail server since January and I've Recently gotten into TTT and will join the Minecraft server :3"},{"postId":17976,"topicId":2169,"posterId":292,"postTime":1301288537,"postText":"To get a moderator position on any server, you simply need to have been playing NNJG for at least a month, have 25 forum posts, and have 10 recommendations from other players on that server. Then you go to the Staff Applications part and follow the template to make an application. You should screenshot the recommendations and put those in there too.\n\nGood luck and welcome to the forums! :)"},{"postId":17988,"topicId":2169,"posterId":611,"postTime":1301319091,"postText":"Thanks Nutter"},{"postId":18083,"topicId":2169,"posterId":356,"postTime":1301451563,"postText":"25 posts!? DANGIT, Bird Flu said I only needed 15... -.-"},{"postId":18084,"topicId":2169,"posterId":356,"postTime":1301451635,"postText":"Oh yeah, Welcome To NNJG!!!! =D"},{"postId":18085,"topicId":2169,"posterId":101,"postTime":1301451748,"postText":">> To get a moderator position on any server, you simply need to have been playing NNJG for at least a month, have  15  forum posts, and have 10 recommendations from other players on that server. Then you go to the Staff Applications part and follow the template to make an application. You should screenshot the recommendations and put those in there too.\n\nGood luck and welcome to the forums! :) \n\n\nIt is 15."},{"postId":18087,"topicId":2169,"posterId":356,"postTime":1301452097,"postText":"Oh it is? YAY, thanks for letting me know."}]}