{"topicId":377,"forumId":1,"topicTitle":"New Mic","topicTime":1277470109,"topicViews":145,"topicReplies":13,"topicStatus":0,"topicFirstPosterName":"Weezer209","topicFirstPosterColor":"","topicLastPosterName":"[NNJG] Cake","topicLastPosterColor":"","topicLastPostTime":1278645883,"posts":[{"postId":3651,"topicId":377,"posterId":58,"postTime":1277470109,"postText":"Well guys, it's about that time to get a new mic. My current one works all right but really poor quality and is snapped in two. Any one have any suggestions? Price range isn't an issue at this point because I just need suggestions, if it's too expensive I just won't buy it. Thanks for the help"},{"postId":3652,"topicId":377,"posterId":13,"postTime":1277473908,"postText":">> \nWell guys, it's about that time to get a new mic. My current one works all right but really poor quality and is snapped in two. Any one have any suggestions? Price range isn't an issue at this point because I just need suggestions, if it's too expensive I just won't buy it. Thanks for the help\n \nHonestly I was surprised that you can get a decent/good mic for pretty cheap. I think it is fair to say you can get a good mic for $20-$40. Very important tip, you will have the choice between usb and other type (I forget technical name but the one that splits in two plugs, one goes to regular headphone jack and other to usually pink mic plug), go for the second. Usb mics are sometimes slightly better quality and other advantages I have never seen in gaming setting, but the other type simply works wherever, instantly, whereas usb have to have drivers or shit installed. Seems stupid I know but in practice, big deal. When you are gonna use it say... idk at a friends house or somewhere besides home computer, it will often not work without setup disks or whatev. As far as brands? Logitech is usually functional, cheap, and reliable option."},{"postId":3679,"topicId":377,"posterId":48,"postTime":1277523402,"postText":"Do you mean just a mic, or a headset?\n\nBecause if you want a headset, Turtle Beach makes some nice ones, and you can use them with your xbox as well...\nThe x11's are only 60 bucks, and are an updated version of the x1's which I have; which I find are pretty good.\nThey also have yeah, the pink and green split like Cake said.\n\nhttp://www.turtlebeach.com/products/xbox-gaming-headsets/ear-force-x11.aspx\n\nI recommend checking them out, and maybe some of the other models if you're willing to pay more.\nI think they also make a 30 dollar pair, but I don't know how good they are.\n\nBut if you just want a mic.... i really have no clue :S :/"},{"postId":3698,"topicId":377,"posterId":13,"postTime":1277567980,"postText":"Oh yeah oops I automatically assumed you meant headset. Well you want a headset, using mic while gaming sucks lol. I just gave suggestions for cheaper ones cause thats all I buy. Dog chews them up or I blow out pretty often so whats the point in my case. But if you are looking to spend a little, go with Deth's :)"},{"postId":3708,"topicId":377,"posterId":58,"postTime":1277587206,"postText":"Yea, I meant headset lol, I would never use a desk mic...they suck hard for gaming."},{"postId":3715,"topicId":377,"posterId":13,"postTime":1277599139,"postText":">> \nYea, I meant headset lol, I would never use a desk mic...they suck hard for gaming.\n \nLol I have seen a few people on server with it, you  can usually tell by the hard time they have trying to use it, yeah it sucks big time XD. So logitech is my suggestion for lower price range but still good qual, Deth got some awesome higher end stuff. Right now I'm using a real cheap Sentry one that surprisingly has held out for the longest time, about time to replace only cause chewed wires. My fav pair was Alienware headset, a beast thing, overpriced but beauty and bragging worth every penny. Besides sounding great, fav thing had to be that it connected to AlienFx, so it had lighting scheme like comp :)."},{"postId":3782,"topicId":377,"posterId":48,"postTime":1277688592,"postText":"Well 60 bucks isn't that high end... i mean yeah you can get cheaper ones, but if you need a new one for on the computer,\nand you want to be able to hear footsteps and have an advantage on call of duty on your xbox...\nTurtle Beaches are exactly what you're looking for :D\n\nBut really, if you even rotate the volume adjustment for game volume to like 1 3rd while playing cod, \nyou can hear footsteps from like... half a mile away.\nAnd because it's in both your ears, and you can hear footsteps better, it enhances the realistic-ness of the game too :D\n(and yes, i made that word up -_-\" )"},{"postId":3786,"topicId":377,"posterId":13,"postTime":1277690572,"postText":">> \nWell 60 bucks isn't that high end... i mean yeah you can get cheaper ones, but if you need a new one for on the computer,\nand you want to be able to hear footsteps and have an advantage on call of duty on your xbox...\nTurtle Beaches are exactly what you're looking for :D\n\nBut really, if you even rotate the volume adjustment for game volume to like 1 3rd while playing cod, \nyou can hear footsteps from like... half a mile away.\nAnd because it's in both your ears, and you can hear footsteps better, it enhances the realistic-ness of the game too :D\n(and yes, i made that word up -_-\" )\n \n$60 is high end when you have to replace them every 2 weeks more or less lol. But if you don't have a destructive puppy or don't abuse them with blaring music, $60 is good for a good set. Lucky for me TTT is pretty much the most battle intensive I go on the PC so don't really have to go for a hardcore set :)"},{"postId":3790,"topicId":377,"posterId":48,"postTime":1277691566,"postText":"I've had mine since Christmas, and i use it every day.\n\nI don't have a dog though, so that may be part of it,\nbut on max computer volume, and max itunes volume, and max headset volume.... my headset sounds like speakers;\nand i left it like that for a few minutes and didn't blow them or anything :D\n\nIdk, for the quality of the headset I have, 60 bucks doesn't seem like much."},{"postId":3812,"topicId":377,"posterId":13,"postTime":1277719464,"postText":">> \nI've had mine since Christmas, and i use it every day.\n\nI don't have a dog though, so that may be part of it,\nbut on max computer volume, and max itunes volume, and max headset volume.... my headset sounds like speakers;\nand i left it like that for a few minutes and didn't blow them or anything :D\n\nIdk, for the quality of the headset I have, 60 bucks doesn't seem like much.\n \nLucky :)\n\nI haven't blown out any of my headsets yet cause I tend to use regular headphones or play music on Xbox so I can use surround sound :), but dog has chewed through at least 4 comp headsets, and chewed through like 3-4 Xbox headsets (I haven't bothered to replace those anymore). Oh and for note, all these he chewed, we have only had him for like 5 months. \n\nI would invest in a good set if I knew it wouldn't be a waste Lol"},{"postId":3822,"topicId":377,"posterId":153,"postTime":1277737613,"postText":"http://www.logitech.com/en-us/webcam_communications/internet_headsets_phones/devices/5848\nThats a good one"},{"postId":3825,"topicId":377,"posterId":58,"postTime":1277738805,"postText":"Damn Ben, that headset is smexy. I will prolly save up for something like that."},{"postId":3987,"topicId":377,"posterId":12,"postTime":1278203902,"postText":"Have to say that a desktop mic works fine for me :D"},{"postId":4049,"topicId":377,"posterId":13,"postTime":1278645883,"postText":"Mine is out again, just regular wear and tear, this one hade a good run. Guess I'm shopping for another next time I am out."}]}