{"topicId":2857,"forumId":30,"topicTitle":"New Jailbreak Points System","topicTime":1306688298,"topicViews":92,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"Jasdahlk","topicFirstPosterColor":"","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1307003641,"posts":[{"postId":22939,"topicId":2857,"posterId":573,"postTime":1306688298,"postText":"Hey guys, I've been brainstorming with a friend some ways to make the Jailbreak server a little more interesting, and one of the ideas we came up with was a new point system. This would give the players more things to do, more incentive to play properly, as well as give the players some goals other than simply killing the other team as soon as possible.\n Map Points: \nIf possible, (since I don't know much about modding for Gmod) we could implement some object for giving points to players when they reach or trigger it.\nThis could include giving prisoners points for escaping, opening an escape path for other prisoners to escape, guards killing prisoners, but only inside a shooting range, prisoners surviving the shooting range, etc.\n Prisoner Points: \nPrisoners can earn points by killing guards,\nsuccessfully escaping,\nsurviving a shooting range,\nreleasing other prisoners, etc.\n Guard Points: \nGuards can earn points by executing prisoners (inside a shooting range or with an execution chamber),\nby moving prisoners periodically into other areas of a prison (lunch room, cells, gym, etc.),\ncatching an escaped prisoner and returning them to the prison (would require some kind of handcuff weapon to prevent prisoners from running away again), etc.\n\nI realize that these kinds of changes would require some serious mapping and modding. And while I don't know much about modding, I am more than willing to design a map or two to implement this kind of point system. Heck, I could also learn more about modding and try some of this stuff myself.\nFeel free to post comments and suggestions. I'd like to talk to Gash about this over Steam some time."},{"postId":22954,"topicId":2857,"posterId":115,"postTime":1306696592,"postText":"To be honest, I fail to see much of a need for the points anyways. There are some masks and some lame trails. the only thing that actually affects the gameplay is the low grav,  so thats the only thing worthy of buying. Health upgrades are broken, as well."},{"postId":23065,"topicId":2857,"posterId":573,"postTime":1306873068,"postText":"True, I suppose there's not much for players to actually spend points on.\nWe could remove the disguiser from the random-spawn list and make it a shop item... tweak it a bit to balance it.\nI was just trying to think of ways to get players to play Jail correctly. As of now, either we all play Simon Says or Last Reaction until the prisoners are all dead, or all the prisoners revolt and kill all the guards. That gets a little boring after a while."},{"postId":23183,"topicId":2857,"posterId":373,"postTime":1307003641,"postText":"That's because the only games that can be played are a select amount, with only one type of LR;  Pool Day "}]}