{"topicId":4276,"forumId":22,"topicTitle":"Chat Bind Limit","topicTime":1316658840,"topicViews":76,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Playerhata27","topicFirstPosterColor":"009900","topicLastPosterName":"Human Aimbot","topicLastPosterColor":"009900","topicLastPostTime":1316725414,"posts":[{"postId":34041,"topicId":4276,"posterId":812,"postTime":1316658840,"postText":"Most of the times we  rely on calling out the traitor using some sort of chat bind,  pretty much as a last resort. It's often where players who are confronted with a Traitor will just spam their bind in chat to have that Traitor in their last words, hence being KOS. Lately I feel this is an overused method and should receive some sort of nerf.\n\nIn my opinion, I think there should be a limit of 3 chat binds every 2.5 seconds, or something along those lines. \n\nPlease give your opinion!\n\nEdit: Aslo, if you're going to vote, please give your opinion for that specific vote."},{"postId":34042,"topicId":4276,"posterId":634,"postTime":1316659022,"postText":"I agree, last words kill more traitors than anything else as of now. But the traitor win rate is pretty balanced right now so I don't know if limiting last words would be a balance as much as an overkill.\n\nI don't know how limiting the binds would work. I think you would have to either leave it alone or completely remove the suit_zoom function in TTT."},{"postId":34060,"topicId":4276,"posterId":812,"postTime":1316711832,"postText":">> I agree, last words kill more traitors than anything else as of now. But the traitor win rate is pretty balanced right now so I don't know if limiting last words would be a balance as much as an overkill.\n\nI don't know how limiting the binds would work. I think you would have to either leave it alone or completely remove the suit_zoom function in TTT. \nWell for one I think they should be limited for the fact it's easy to just spam them. And second, the fact that people will sometimes just use the bind function as a last resort is kind of cheap imo. I would say in a full game having 5 traitors, 2-3 will be called out in last words most of the time.\n\nOr something that I just remembered was a Server who had Last Words, but only when you ID'd their body. Maybe that would be better? With that implemented, the Traitor would still be called out, but it would be necessary for the person ID'ing the body to recognize and make apparent."},{"postId":34062,"topicId":4276,"posterId":612,"postTime":1316713073,"postText":"I've learned not to make suggestions of change in this community. Be careful. \n\nI do support this notion."},{"postId":34071,"topicId":4276,"posterId":634,"postTime":1316724287,"postText":"That would be fair. Instead of having the last words as public, you would have to ID the body to see their last words. I would completely support that."},{"postId":34074,"topicId":4276,"posterId":735,"postTime":1316725414,"postText":">>  you would have to ID the body to see their last words.. \nI agree with this, but, What about once someone IDs it it is pasted in chat? I don't think many players will use tab."}]}