{"topicId":3274,"forumId":14,"topicTitle":"Accused of Aimbotting. Wasn't:(","topicTime":1311226114,"topicViews":195,"topicReplies":9,"topicStatus":1,"topicFirstPosterName":"FootChar","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1311392433,"posts":[{"postId":25959,"topicId":3274,"posterId":969,"postTime":1311226114,"postText":" Your In-Game name:  Football Charlie\n Your Steam ID:  STEAM_0:0:13550638\n Reason:  I was banned for allegedly using aimbot.\n Length of Ban/Date and time of Unban:  Permabanned\n What server were you playing?: TTT\n Who banned you?:  Balenti\n Why should we unban you?:  Because I wasn't using an aimbot :(\n\nTo elaborate, I was primarily using a deagle on a map and got a few headshots. I can't even say all my shots hit their mark or even all my kills were headshots, often I couldn't line it up and just went for bodyshots, and even right before I was banned I was gunned down by a guy I just couldn't hit. Frankly, I was surprised I was even noted at all for my accuracy. That said, right before my ban I had 2 rounds of traitor in a row where I got at least 2 deagle headshots in each, although the latter which it was 2 guys standing still staring at a corpse. I don't want to get it confused. I did have a couple good rounds and I don't want this to come off as something stupid like bragging or anything but I just wasn't aimbotting. I was banned for having 2 good rounds.\n\nI used to play this server a few years back, and back then I was known as either Soda Popinski or Sir Popinski. Hopefully at least someone from back them still remembers me (only person I recognized was Gash). I used to play without incident all the time, I would really hate to be banned from there due to a false accusation."},{"postId":25961,"topicId":3274,"posterId":373,"postTime":1311231620,"postText":"From what I was seeing while speccing you it looked a lot like aimbotting. Quack was on but I don't think he saw any of it."},{"postId":25963,"topicId":3274,"posterId":115,"postTime":1311262948,"postText":"I was also spectating you, and the \"few headshots\" you made were very quick and did look snapped on. As Balenti called it \"snap and cap\".\n\nBut of course, it's very hard to tell, so I may very well be wrong. I'll let Balenti be the final judge on this."},{"postId":25964,"topicId":3274,"posterId":969,"postTime":1311266534,"postText":"Well I can take this as a compliment I guess but you're putting me in a very awkward position here. My word against 2 admins who say I was using aimbot.\n\nLet me just say I sunk a lot of hours into TF2, a lot of it playing with a demoman without using stickybombs. Which meant I would have to hit people directly with a grenade launcher. If you can learn to lead a fast moving character like a scout and peg him with a slow-moving projectile like a grenade, watching a guy in Gmod slowly try to strafe around you, lining up their head is easy. Those were the few people I engaged head on, but as I said most were standing still. As for this \"snap and cap\" my mouse sensitivity isn't that high. I know you guys didn't see me looking one frame somewhere then instantly locked on someone's head. I was just manually scrolling to their head. Granted I know enough that there are aimbots that don't instantly \"jump\" to a target, but...well...hard to argue against that. Did my movements not look natural? Did I move over to another guy and then instantly track all of his movements?\n\nBut now that I know you guys were speccing me I can bring this up, as maybe you saw this. Do you know who gave me the most trouble in getting headshots? Those people wearing a floodlight on their head. It does an annoyingly good job at hiding where exactly their head is. Most of the time I would fire a couple shots at the base of the lamp, not get a headshots and start emptying my clip in bodyshots. If I was using an aimbot, something like an obscured head wouldn't even matter.\n\nFinally. Look at my Steam profile. Look at the gameslist. Look at it. All of it. Do you think I would be stupid enough to risk my account getting VAC-banned? I mean you don't know me but no, hell no.\n\nPlease guys. I'm just a guy who can aim. Not an aimbotter. Would be pretty terrible to end up banned from my favorite TTT server from a few years back just because I can peg a few heads."},{"postId":25966,"topicId":3274,"posterId":237,"postTime":1311274151,"postText":"and this guy wasn't like the other aimbotter who went on an RDM massacre. I think he brings up a valid point with the VAC-ban risk."},{"postId":25978,"topicId":3274,"posterId":112,"postTime":1311287340,"postText":">> and this guy wasn't like the other aimbotter who went on an RDM massacre. I think he brings up a valid point with the VAC-ban risk. \n\nWhen you get VAC'd from Gmod it ONLY stops you from playing Garrysmod.\n http://www.garrysmod.com/2010/10/22/vac-is-enabled/ \nLast bullet point.\n\nThats not an argument at all.\n\nAnd I'm pretty sure the TTT server isn't more than two years old."},{"postId":25979,"topicId":3274,"posterId":969,"postTime":1311289763,"postText":"Ahh well. Getting vac-banned only affects Garry's Mod. Didn't know that.\n\nAlso about two years ago sounds about right. I basically showed up right around the time you guys started getting goonswarmed if you remember that. Was pretty terrible when they were on.\n\nI said all I could about not using aimbot already, just waiting for a verdict now."},{"postId":25982,"topicId":3274,"posterId":373,"postTime":1311299918,"postText":"Sorry for the late reply, every time I tried to send this my internet fucked up.\n\nI'll say unban him. Gonna wait for Gash to say the word and lock this.\n\nIf it turns out you WERE using an aimbot or show any more signs of aimbotting you will be banned permanently.\nThis is your first and only warning"},{"postId":25984,"topicId":3274,"posterId":969,"postTime":1311301810,"postText":">> Sorry for the late reply, every time I tried to send this my internet fucked up.\n\nI'll say unban him. Gonna wait for Gash to say the word and lock this.\n\nIf it turns out you WERE using an aimbot or show any more signs of aimbotting you will be banned permanently.\nThis is your first and only warning \nThanks for the vote for reversing the ban.\n\nThat said, you're warning me not to shoot people in the head as much? I'm not going to stop aiming for people's heads and pulling off as many headshots as I can. Not trying to offend or flame but that's pretty ridiculous thing to ask. \n\nIf any admin here truly believes I am aimbotting, please, PLEASE record a demo. Besides the obvious of I think a video would clear my name, I'm curious as to what you guys are seeing when you spec me. I'm guessing what you see and what I see isn't 1:1."},{"postId":26086,"topicId":3274,"posterId":2,"postTime":1311392433,"postText":"Unbanned."}]}