{"topicId":1843,"forumId":12,"topicTitle":"need of applications","topicTime":1297200629,"topicViews":124,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"jesus","topicFirstPosterColor":"","topicLastPosterName":"jesus","topicLastPosterColor":"","topicLastPostTime":1297291747,"posts":[{"postId":15497,"topicId":1843,"posterId":371,"postTime":1297200629,"postText":"i think that in order to get vip there should be an application thats approved by at least 2 admins in order to become a vip whithout donating, but to become vip from donating they need to donte 5-10 dollars along with at least 1 admin a proving it. maybe even put a minimum of play time on time on the server."},{"postId":15498,"topicId":1843,"posterId":2,"postTime":1297200875,"postText":">> i think that in order to get vip there should be an application thats approved by at least 2 admins in order to become a vip whithout donating, but to become vip from donating they need to donte 5-10 dollars along with at least 1 admin a proving it. maybe even put a minimum of play time on time on the server. \nYou can only obtain VIP by donating."},{"postId":15500,"topicId":1843,"posterId":371,"postTime":1297202080,"postText":"i know that but im suggesting that you need some sort off application and approval so there aren't 8 year olds donating for power"},{"postId":15503,"topicId":1843,"posterId":101,"postTime":1297204104,"postText":"No."},{"postId":15510,"topicId":1843,"posterId":389,"postTime":1297207365,"postText":"Phew, 8 year olds.  Good thing I turned 9 awhile back.\n\nAnd so this doesnt be considered as spam by Dum.\n\nThere is really no need to make an application to being a VIP because age shouldn't really matter if they were able to give the cash. Minimum play time?? What is the point in that? (If you say something about not knowing rules, answer in this following after bracket) Well if VIP breaks the rules or abuses their power, they most are gonna be de-vip'd? and suspended? \n\nThe best reason for no applications and just taking whoever in for VIP is NNJG earns money. Its like that one time a guy bought VIP, and within 5 hours the day he got it, he lost his VIP due to abuse.\n\nEdit: Delete this, if you guys are scared of your secret plan being leaked."},{"postId":15535,"topicId":1843,"posterId":366,"postTime":1297233197,"postText":"I don't get this, we are all mad at the VIP system or, just the people who get VIP, but nothing is ever done about this subject.\n\nThere's no real reason to complain about this, nobody's going to do anything about it ever."},{"postId":15560,"topicId":1843,"posterId":372,"postTime":1297289560,"postText":"What I take from this is that he wants less of the mini mod VIP's and more people that know their stuff that can actually improve the server more than 3 dollars will.  A good player that can also improve the server by regulating it could make all of the difference.   Not someone who just pays to get it, and really has no real accountibilty other than no more VIP and out 3 dollars, which is very insignificant to many people.  I think I'm rambling now but yeah, no paying for Mod powers."},{"postId":15561,"topicId":1843,"posterId":371,"postTime":1297291747,"postText":"thats exactly what im saying, it shouldn't be so easy to get vip so that only people that actually know the rules and players will try to get it."}]}