{"topicId":2486,"forumId":14,"topicTitle":"My unban request","topicTime":1303955419,"topicViews":132,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"Pinkerton","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1303965110,"posts":[{"postId":19851,"topicId":2486,"posterId":716,"postTime":1303955419,"postText":" Your In-Game name:  Gorilla\n Your Steam ID:  STEAM_0:0:26352620\n Reason:  Hmm...Well...I was banned for being an immature little brat. I was a minge and all I would do was whine and complain. I was also rdming a lot back on the TTT server. Sometimes I would kill a traitor with proof and sometimes without proof. When it was without proof I just did it because I thought they were acting \"suspicious\" for some reason. Then sometimes I would pick up a jihad and toss it onto someone else getting many people killed. Most of all I disrespected the members. I was an ass and I was extremely immature. I don't know...I'm just stupid acting sometimes.\n Length of Ban/Date and time of Unban:  I was Perma Banned. Whenever I try to go on page it never loads for me so I don't know date.\n What server were you playing?:  TTT\n Who banned you?:  I do believe it was Ben.\n Why should we unban you?: \n   Well, I'm perma banned so the odds of me getting unbanned are slim to none. I believe that the reasons     I     think I should be unbanned are worthy to me. I think I've grown up a lot from the days when I was immature and a minge. I just rdmed and wreaked havoc on the server without thinking of the consequences. I was rude, crude, and despicable. That has changed now. The reason why I want to come back to NNJG is because I have learned my ways and I've grown up quite a bit. Also, NNJG was one of my first real Gmod communities. I enjoyed the members and the Admins were great! I loved the TTT server and the custom weapons that the brilliant minds of NNJG came up with. Other servers, they just don't cut it for me. There is something unique about NNJG. It gives you that sensation of a real home and makes you feel welcomed there. The games were fun and people that played them were fun as well. When I was being a dick, I wasn't thinking of some of my friends that I had made there and left behind. I screwed myself over and made it so that one of the better TTT servers was out of my grasp.\n   This request is my Swan Song. If I get accepted back, then great! If I don't...well...I guess I'll have to pay the price. I was a little shit and I got so many warnings and chances. I took all of that for granted. I've matured now guys and I think you should trust me. I just want to thank the admins for reading this and going out of their way just to read someone beg forgiveness from a server that has perma banned him. So thanks."},{"postId":19854,"topicId":2486,"posterId":79,"postTime":1303955829,"postText":"Personal opinion from me: If he says all this and went through that type of explanation of what he did and is seriously asking to come back as a second chance. I would like to say give him a final chance since he went through all this effort. But at the same time, he was banned for being a troll/RDMer and it's not easy to change that over maybe 1 year at the max. If given another chance I'd say at the first site of him/her going back to trolling or RDM, go back to perma ban with no hopes of being able to reconcile his actions."},{"postId":19856,"topicId":2486,"posterId":716,"postTime":1303955968,"postText":">> Personal opinion from me: If he says all this and went through that type of explanation of what he did and is seriously asking to come back as a second chance. I would like to say give him a final chance since he went through all this effort. But at the same time, he was banned for being a troll/RDMer and it's not easy to change that over maybe 1 year at the max. If given another chance I'd say at the first site of him/her going back to trolling or RDM, go back to perma ban with no hopes of being able to reconcile his actions. \n\nI would enjoy that idea. Kind of like a probation period to prove that I have changed."},{"postId":19860,"topicId":2486,"posterId":54,"postTime":1303957265,"postText":"No, you were banned for threatening to hack someone or some shit like that, I dunno\n\nBut in all honesty, I say yes. You seem like you mature, plus, everyone deserves a second chance. I myself have had a second chance, and look where I am now. If you seem to be a minge again; you'll get banned again and this time for GOOD. That's just what I think."},{"postId":19863,"topicId":2486,"posterId":716,"postTime":1303957411,"postText":">> No, you were banned for threatening to hack someone or some shit like that, I dunno\n\nBut in all honesty, I say yes. You seem like you mature, plus, everyone deserves a second chance. I myself have had a second chance, and look where I am now. If you seem to be a minge again; you'll get banned again and this time for GOOD. That's just what I think. \n\nOh yeah. It was linkman or someone. I can't remember his name. I only did it because he rdmed me and I was a minge. Now that I think about it...maybe it was punked who banned me. Is he still here?"},{"postId":19870,"topicId":2486,"posterId":6,"postTime":1303960222,"postText":">> >> No, you were banned for threatening to hack someone or some shit like that, I dunno\n\nBut in all honesty, I say yes. You seem like you mature, plus, everyone deserves a second chance. I myself have had a second chance, and look where I am now. If you seem to be a minge again; you'll get banned again and this time for GOOD. That's just what I think. \n\nOh yeah. It was linkman or someone. I can't remember his name. I only did it because he rdmed me and I was a minge. Now that I think about it...maybe it was punked who banned me. Is he still here? \nYeah, I'm here. I think I was the one who banned you, If i did, it was because I was instructed by Ben to do so. You threatened to hack and rdm Link. But it seems you are very serious to change.\n\n\nI also agree with the unban/probation. Up to someone else though."},{"postId":19872,"topicId":2486,"posterId":716,"postTime":1303960354,"postText":"It seems that a lot of people agree with the unbanning and probation thing. So, who has the final decision to unban me?"},{"postId":19877,"topicId":2486,"posterId":2,"postTime":1303965110,"postText":"Unbanned."}]}