{"topicId":2464,"forumId":122,"topicTitle":"Dr. Corey W. Rogerson, abuse/ladder blocking","topicTime":1303787631,"topicViews":352,"topicReplies":21,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"Kobooold","topicLastPosterColor":"","topicLastPostTime":1304036425,"posts":[{"postId":19658,"topicId":2464,"posterId":79,"postTime":1303787631,"postText":"Name: Dr. Corey W. Rogerson\nSteamID: STEAM_0:0:24225449\nNo admins on, few VIP including him\nReason: He was blocking a ladder entire pre-round and didn't let anyone through, so on start of round i killed him for STILL blocking the ladder so people could get through and not get jihaded at start of round. He's a VIP and knows better then to door/ladder block. The map was TrappyCottage, so u HAVE to go down ladder to get out of starter area. Right after i kill him, he starts up a kick vote even though he knows what he did was against the rules and wrong. Many people were talking over mic saying get out of the way, and random other chit chat. Post is for VIP abuse as well as blocking an area where u have no choice but to go through to get out of starter area."},{"postId":19659,"topicId":2464,"posterId":4,"postTime":1303788360,"postText":"You need valid proof. (screenshot/video)"},{"postId":19660,"topicId":2464,"posterId":79,"postTime":1303788481,"postText":"Dunno how u can prove someone was ladder blocking and then kicks u right after u kill him for it.... Cause yea, you really cant. Ladder Blocking then kicking after i kill him, only can go by word of mouth on those subjects."},{"postId":19663,"topicId":2464,"posterId":605,"postTime":1303791534,"postText":"I know it is only my word here, but I too have had problems with this guy. Mostly with getting outside of certain maps using hands, and staying there.\nI figured meh, he claims he would kill himself if hes the last one left... so I never put an effort against him... but if hes going to votekick for being shot while blocking, I will be keeping an eye open, and demo recording/screens during his next excursion against the rules.\n\nAlso, Crisis, I suggest when you notice someone doing something serious, next round, asap, start demo recording... if something does happen, you have proof... if not, you can erase the demo and try again later."},{"postId":19678,"topicId":2464,"posterId":521,"postTime":1303813480,"postText":"Its fine pre-round, and you CAN kill for it. I admit ive crowbarred a few people once or twice that've stayed there too long.\n\nShift-F2 to open up demo recorder thing."},{"postId":19699,"topicId":2464,"posterId":693,"postTime":1303836922,"postText":"He also rdms a lot.\nAnd he's just a plain massive troll.\nI'll upload screenshots if you'd like.\n\nEDIT, heres an example of Correy rdming every player on the map.\nhttp://img600.imageshack.us/i/gmsouthpark0000.jpg/\n\nIn addition he and Kilroy should both be banned for massive trolling."},{"postId":19702,"topicId":2464,"posterId":389,"postTime":1303838700,"postText":"Then here appears Ungrateful who i havent seen in action in awhile.\n\nBack on topic\n\nPeople are prop blocking (this include blocking the door/stairs/ladders and such with a player body) is a killable offense. If the player does not move after being warned, you can immediately kill him unless theres a reason he cant move.\n\nIt was wrong for him to start a votekick, so if he either reads this or someone could msg him. Tell him hes not allowed to votekick someone based on his own mistake. \n\nAs for the ban request and rdming such... I have nothing to say since I dont even rmb what playing TTT feels like anymore. So thats my little opinion about this topic. I think we should add in a few rules or change up the rules for TTT cause it feels like everyone is breaking the rules.\n\nExamples would be.\n\nPoint Farming, \"I'll kill you if you dont go in the traitor tester\" where thats not a killable offense, and much more."},{"postId":19750,"topicId":2464,"posterId":612,"postTime":1303872518,"postText":"Defense. Although i hae rdmed by accident before, then killed myself as it should be done according tto nnjg rules.\n\nanyways. \n1. crysis i was on the ladder preround, not gonna lie. then as soon as the round started i wnet down the ladder and stood there OFF THE LADDER. then you shot me with a deag.\n>> \n MZP wrote \nIts fine pre-round, and you CAN kill for it. I admit ive crowbarred a few people once or twice that've stayed there too long.\n\nShift-F2 to open up demo recorder thing. \nnot sure if this is right but if so then i wasnt in the wrong.\n________________________________________________________\n\n2. to the SS of Gm_southpark. Killler  & kilroy were in a gun fight. i heard kilroys mac 10 first so i shot him cuz killer was out of ammo and reloading. then i saw that kilroy was inno, so i killed killer. perfectly legit. not sure why they were gunnning eachother down, but i apologized anyway. \n\nno proof of this but hey, kilroy would back me up.\n\n>> \n Ungrateful wrote \nAnd he's just a plain massive troll. \ni was trolling but it wasnt anything \"massive\" that map, Ceasar was taking forever to trait and i kinda knew it was him. and i called him \"bad\" a few times and  then he was playing along. so really? i dont see how that is trolling.\n\nMaybe i troll sometimes. but who doesnt from time to time. and usually its not offensive to anyone.\nits usually:\n\"SO I HEARD FRUM DIS WUN GAI THAT KILROY .... \"\n\"ITS PROABALLY JOSTER, HE HAS  A CONE FOR A HEAD\"\n\"u jelly brew?\"\n\" ARE you MAD? SAD? GLADBAG?\"\n\ni'd be happy to talk to gash about it. and to udane.\ni exploited the maps. this is the only reasonable post here. so slay me. black list me for a day. wont do it again. pologies.\n\ncrysis killed me because he doesnt like me and he had barely a grain to go on. and found his opening and killed me.\ni cant slay, so i kicked him for hatecriming me."},{"postId":19752,"topicId":2464,"posterId":79,"postTime":1303883484,"postText":"Another 2 things, unless someone is massive rdm. \n1) You CANT slay/kick midround without just cause. (lots of rdm/trolling/hacking/ghosting)\n2) You were middle of ladder when i killed you, so don't bullshit people.\n3) Blocking not allowed pre-round on maps where u HAVE to go 1 way and a door/ladder only way.\n4) I don't HATE anyone and i dont discriminate against anyone.\n5) Saying you troll isn't helping your case.\n6) Lots of people are complaining about you in this thread. So it's obvious that you do this often.\n7) Not supposed to slay unless its 2 rdm's, same with kicking."},{"postId":19765,"topicId":2464,"posterId":112,"postTime":1303904538,"postText":"Was Cory a traitor while on the ladder?"},{"postId":19767,"topicId":2464,"posterId":612,"postTime":1303906866,"postText":">> Another 2 things, unless someone is massive rdm. \n1) You CANT slay/kick midround without just cause. (lots of rdm/trolling/hacking/ghosting)\n2) You were middle of ladder when i killed you, so don't bullshit people.\n3) Blocking not allowed pre-round on maps where u HAVE to go 1 way and a door/ladder only way.\n4) I don't HATE anyone and i dont discriminate against anyone.\n5) Saying you troll isn't helping your case.\n6) Lots of people are complaining about you in this thread. So it's obvious that you do this often.\n7) Not supposed to slay unless its 2 rdm's, same with kicking. \n\n\n1. okay. maybe kicking you mid round wasnt the proper thing. apologies.\n2. bullshit. you even said \"if you are going to block the ladder  preround  im going to kill you\"\n3. read my earlier post\n4. whatever negative to me either way/\n5. honesty is helping my case though right?\n6. 3 isnt that much, only credable one is udane, which i proved (i guess?) in my last post\n7. have you ever played on the server? 1 rdm= slay 2= kick and since i couldnt slay i kicked you. because i wasnt in the middle. i was off. argue if you want. but i was off and there was a person right next to me"},{"postId":19768,"topicId":2464,"posterId":612,"postTime":1303906968,"postText":">> Was Cory a traitor while on the ladder? \nno, preround. and i said \"this would be an epic jihad and it was very late pre round. i got on to the ladder at about 10 sec. \nbefore the round started, and hung out there going up and down for about9 seconds. was off the ladder and i hear BAM one deaged\ni just happened to be the first one onto it. it took a while for the fireplace to move and then theres the whole \"everyone go in at once thing\"\nwhich somehow i happened to be close to the front if not first. \n\nand also to crisis. you posted this for \"abuse/ ladder bloicking\" but yet you are falling back onto rdm charges and trolling.\n seems to me that you are kind of finding anything to hold against me here."},{"postId":19770,"topicId":2464,"posterId":112,"postTime":1303913439,"postText":"Well if you weren't a traitor how did you know he wasn't? (mid-round)\nYou shouldn't kick somebody for killing you unless you know it was rdm. You had no way of knowing if he was T."},{"postId":19775,"topicId":2464,"posterId":612,"postTime":1303920901,"postText":"Detective, he shot me at .1 seconds into the round."},{"postId":19778,"topicId":2464,"posterId":79,"postTime":1303925101,"postText":"Just a note Corey, i can almost guarantee 10x more people on the server know my name for good playing/skillful detective work, played on the server way longer then you have and you need to learn the rules better. 1 rdm isn't a slay. To be slayed you need 2 rdm's in one round and a lot of people have more credability then you think. You think they have none cause the only people you trust are your friends and Mark/Gash. So trust 3 people while i trust most of the server since they don't act like dicks to me. Credability is earned with trust, of which you gained none. You donated and because of that, you think your all high and mighty. While as for me, I act high and mighty because i follow the rules for the most part, even if once and awhile i do end up with low karma, its 90% the time that i shot someone shooting me, or they ran in front of traitor when I was shooting them.\n\nYou asked me if I play on the server a lot and question my knowledge of the rules. I used to be admin/mod so i needed to know the rules like the back of my hand. As of now, this thread has turned more into a trolling thread then anything else and is practically dead. No judgment is gonna be passed on either side. So someone just lock this thread so it doesn't end up with more flaming/trolling. After so long I can't keep this in a respectable manner."},{"postId":19780,"topicId":2464,"posterId":389,"postTime":1303926865,"postText":"Few things.\n\n1. What Crisis said about im pretty sure slay is 2 kills unless first one was indeed intentional from the very beginning.\n\n2. I have heard different things about each of you in the past, but thats already way behind us.\n\n3. PLEASE DO NOT KICK PPL EARLY/MID/LATE ROUND UNLESS YOUR ABSOULUTELY SURE THEY ARE DOING SOMETHING WRONG.\nEx. I'm still hating on that guy named *cough* Deer God *cough*.... (you guys can kick him :D hes such a fucking troll), but unless theres an actual good reason, please refrain from such actions."},{"postId":19784,"topicId":2464,"posterId":612,"postTime":1303929741,"postText":">> To be slayed you need 2 rdm's in one round  \n\nthis is what is in the motd, which is official rules but ive seen on numerous occasions it only being one.\n\n>> So someone just lock this thread so it doesn't end up with more flaming/trolling.  \n\ntheres been no trolling so far, so dont lock it till we come to a resolution.\n\n>> Credability is earned with trust, of which you gained none. \n\nyou rdmed me and i rage kicked you. also this is a ban request, what are you talking about?\n\n>> a lot of people have more credability then you think. You think they have none cause the only people you trust are your friends and Mark/Gash \nwhat are you on about here?\n\n>>  i can almost guarantee 10x more people on the server know my name for good playing/skillful detective work, played on the server way longer then you have and you need to learn the rules better. \n\nso that makes you right.\n\nplease stay on topic here."},{"postId":19785,"topicId":2464,"posterId":612,"postTime":1303929910,"postText":"im done fighting here. honestly its a stupid reeason to ban request me. if the admins think i was wrong ban me for a day. if not then awesome\n\nit wont happen again either way. lesson learned.\n\n\nif an admin was  to steam message me go ahead, you can post the chat log on here too. ive nothing to hide."},{"postId":19786,"topicId":2464,"posterId":2,"postTime":1303933540,"postText":"Just to clarify, it says two innocent kills as innocent will result in a slay. Not two RDMs. Even one RDM can result in an instant permanent ban, depending on the occasion/reason. The two teamkills is just to prevent arguing if someone kills two or more innocents. It doesn't matter if they had a reason or not. No-RDM is Rule #1. It's not allowed, at all."},{"postId":19806,"topicId":2464,"posterId":115,"postTime":1303944024,"postText":"To be honest, I only see one screenshot showing proof, and a hell of a lot of bitching. Stop. \n\nUnless someone has some more proof to show, stay out of this. Don't post at all if you're just going to attempt to ban him with sheer words, or attempting to argue the one piece of proof you guys have gotten. We have enough info here, no need to debate any more."},{"postId":19844,"topicId":2464,"posterId":112,"postTime":1303953608,"postText":">> Crisis quit your bitchin on ttt all i hear from you is how you dont like gash and complain about the admins/mods/vips abusing \n\nlets go back to how you lost your moderation powers \n\nThat is completely out of line for numerous reasons.\n1 He didn't lose it from abusing\n2 You weren't there. Don't pretend you know what happened.\n3 Don't post in ban requests that aren't yours."},{"postId":19935,"topicId":2464,"posterId":272,"postTime":1304036425,"postText":"This should have been locked a while ago. I'll do it."}]}