{"topicId":4198,"forumId":3,"topicTitle":"Not enough proof, locked. ","topicTime":1316284456,"topicViews":147,"topicReplies":12,"topicStatus":0,"topicFirstPosterName":"CoreyW.Rogerson","topicFirstPosterColor":"","topicLastPosterName":"CoreyW.Rogerson","topicLastPosterColor":"","topicLastPostTime":1316540093,"posts":[{"postId":33419,"topicId":4198,"posterId":612,"postTime":1316284456,"postText":"Im tired of trying to \"moderate\" the server, I put in way too much effort . It's like I go through the motions and post a ban request just to have it denied. If any mod/ admin had been there all of the players I posted a ban request for would've been banned. It's ridiculous. Most admins barely go on TTT forreal. It's sickening. I don't see how the multiple screen shots are sufficient. /rage.\n\n[edit: post revised, sounded assholeish]"},{"postId":33420,"topicId":4198,"posterId":612,"postTime":1316284968,"postText":"I guess what I'm trying to get at is how can you admins tell what happened. Like on \"bubba black\" he blatantly rdmed \"five\" but some how it's not bannable. Im just gonna record everything again. Screw it."},{"postId":33422,"topicId":4198,"posterId":812,"postTime":1316285070,"postText":"I mean I don't think ONE suspected RDM, or ONE suspected attempted RDM is worth a ban. These would warrant, at the most, slays if a staff member is on, not a ban.\n\nRather, you're going to have to gather numerous pieces of evidence and PROVE to us that they are breaking the rules. Ask the person why he killed player X or why he shot him. \n\nIn the end, if the person really is RDM'ing/Trolling, they'll give you AMPLE opportunities to gather a lot of proof and at that point is when you post a ban request if you feel necessary.\n\nEdit: And sadly you're going to have to accept the fact that some people will get away with the shit they do and the only thing you can do about it is just stay vigilant, lol quote from Harry Potter."},{"postId":33423,"topicId":4198,"posterId":612,"postTime":1316285418,"postText":"As much as I agree with this, I don't agree totally. Gash has stated numerous time that \" one blatant rdm is a permanent ban\"\nWhich is what I usually report. Why do I have any reason to lie? The would be contradictory. Here I am trying to \"moderate\" the sever as much as I can with what little action I can take and it just gets denied, over and over. It just seems to me that the admins take a quick look at a screenshot and say \"meh he only killed one guy, I believe him and not Corey\" which is loosely translated of course( it's the best way I can think to but it in words) I've never lied on these forums, why lie in a ban request? There's strict \"no lying\" rules that if you break them you yourself gets banned, not to mention your reputation turns to shit. I just feel like the admins don't believe in the players. That's all"},{"postId":33425,"topicId":4198,"posterId":812,"postTime":1316285600,"postText":"Dude if were that easy, do you understand how simple it would be to have ANYONE banned?\n\nAgain, you have to PROVE they RDM'd. The best is usually asking them why they killed them and hopefully they type some real bullshit answer, or over their mic give some shitty excuse.\n\nIt's harder to gain evidence on the people who you know break the rules, but do it subtly, then the people who break the rules and make it obvious."},{"postId":33426,"topicId":4198,"posterId":612,"postTime":1316285858,"postText":"i understand that, but again. with the reputation that many of us TTT players have built, why would i lie against some new person that just joined? I'm not saying dont review the evidence, but trust the people who play on a regular basis. Admittedly some of my ban requests have been weak evidence wise, but RDM nonetheless. i mean its not like i post on VERY little evidence.i just feel like my effort goes to waste when i report a rule breaker."},{"postId":33427,"topicId":4198,"posterId":812,"postTime":1316286244,"postText":">> i understand that, but again. with the reputation that many of us TTT players have built, why would i lie against some new person that just joined? I'm not saying dont review the evidence, but trust the people who play on a regular basis. Admittedly some of my ban requests have been weak evidence wise, but RDM nonetheless. i mean its not like i post on VERY little evidence.i just feel like my effort goes to waste when i report a rule breaker. \nDude then why not ask the person why they did that act, and if they are wrong,  allow them to corner them self in? Because sometimes we're wrong. Sometimes it looks like an RDM but it was not. Damage logs are a good source but are not the only one, and sadly they don't account every part/action of the game. That's when it's your job to retrieve the rest of situation and present it in a clear that that PROVES they have clearly broken a rule. It's not that they don't trust you but it's a system trying to be fair to both people.\n\nAnd in all honesty, if you do feel you're right, give the evidence directly to Gash or another admin and see their response."},{"postId":33439,"topicId":4198,"posterId":612,"postTime":1316293556,"postText":"I always ask, sometimes they dont respond, sometimes they respond over voice chat. Im just saying, i feel as though its taken lightly and not as an actualy punishment. if they same exact situation took place and they were directly involved, the accused would've been punished."},{"postId":33443,"topicId":4198,"posterId":79,"postTime":1316298966,"postText":"The problem with proof is very simple. One rdm every few rounds is what it will look like if they only kill 1 at a time to blatantly rdm. Most of the time they can reply by saying, \"he T baited me\" or \"he shot first\" or \"he was next to a unid'd body\". Any of these responses will normally get a player out of a ban, not to mention that any rdm from Inno to Traitor = excusable since their is no way you can prove without video. Overall the only way to prove what they did is wrong is through a video, but at the same time. Anyone else who did something wrong that round HAS to be punished as well otherwise the main player can get away with it.\n\nIn short, videos = best evidence verse someone and most ban requests would just be a slay if admin was on, hence no ban. In my opinion though, if the ban would only be a slay and no admin is on, maybe make it instead of denied, a 1 hour ban. That way even if its not a long ban, it seems like something is done about it.\n\nOverall, can a admin please review this entire post and make comments. This won't get anywhere if it's just Corey, Player and I posting back to back in response with each other."},{"postId":33459,"topicId":4198,"posterId":612,"postTime":1316315174,"postText":"To crisis, I really appreciate you posting here due to the fact that you are a frequent ban requester. And I liked the tone also, just saying I feel like you and I are starting to move in the right direction finally. \n\nAnyway. As much as I wish I could record all the time, I can't. I tried before, the lag was terrible. I'll be looking for tweaks I can use to tone down the pull from my processor. But you're right it's the only way.."},{"postId":33518,"topicId":4198,"posterId":634,"postTime":1316372718,"postText":"I don't think people should be banned for slayable offenses except in the case of repeated offenses. I don't see it often but sometimes the reasons for banning people are sketchy and the evidence is sketchier. To address the statement about reputation, if you ask any admin if they value one members word over another they will probably say no but that is usually a lie. From what I've seen the more trusted you are with making legitamite ban requests the more likely your sketchy bans will pass. To conclude my collection of opinions on the current status of ban requests I'll just stick with Player's reference to Harry Potter and say be vigilant, if you don't catch the rule-breakers the first time, they're bound to slip up again.\n\nAlso on a side note there really is no reason for a staff to post on this. If they wanted to to help explain their reasoning better, that would be their choice but all I see from this thread is a question as to why some people were not banned, when the reason that they were not is in the title of the thread."},{"postId":33523,"topicId":4198,"posterId":79,"postTime":1316376387,"postText":"I think another thing would just be more people making ban requests too. Not to be mean at all, but it seems as if 95% of the ban requests are from either Corey, Player, Or I, Because of this some players will see this as \"don't do stupid things when they are on\" but then with other players that complain non-stop they do nothing about it. (again, no offense to anyone) Proof can be gotten if we all start caring a little more about people breaking the rules. Yes, some rules that are broken are minor, but repeating the broken rule over and over becomes a major problem. People rdm one person a round at times and it's not a ban able or even slay able offense.\n\nBack on track, proof is also sadly based on a person to person point of view. What one admin may say is just a minor issue, another could say is a major issue.\n\nIn response to Destar. \"if you ask any admin if they value one members word over another\". This statement in particular, if ANY admin values one players word over another, they SHOULD NOT BE ADMIN. If a admin is showing bias towards one player, they should either renounce their position or be stripped of that position. A admin MUST at ALL times be unbiased towards situations even if it causes a loss of steam friends. THESE ARE STEAM FRIENDS, NOT REAL LIFE FRIENDS, you DONT need to keep them. So i will ask that any biased actions be reported as admin abuse as well.\n\nTL;DR\nAdmins should be renounced of position if biased. (Start banning/slaying friends if they do something against the rules. Biased actions CANT be tolerated on case to case basis)\nMore players should help get proof. (Group together to post on ban requests, 2 people seeing something is always better then one)\nBetter viewpoints of what each rule is about. (Updated rule list and Updated examples)\n\nAgain, none of this is meant to troll/flame/hurt anyone. You just have to understand that small actions like this will make a much better community."},{"postId":33842,"topicId":4198,"posterId":612,"postTime":1316540093,"postText":"I made so many ban requests last week that I changed my steam overlay to link for my ban criteria. Including a template. I can almost script a ban request. It's ridiculous."}]}