{"topicId":1732,"forumId":14,"topicTitle":"Banned for hacking","topicTime":1295825475,"topicViews":114,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"girl","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1295827675,"posts":[{"postId":14711,"topicId":1732,"posterId":499,"postTime":1295825475,"postText":" Your In-Game name:  fraulein schlampe\n\n Your Steam ID:  STEAM_0:1:20789337\n\n Reason:  6:17 PM - fraulein schlampe: wtf i got banned\n6:17 PM - fraulein schlampe: wow.\n6:17 PM - random guy who was on the server: Yeah, admin's being a fag.\n6:18 PM - fraulein schlampe: was mr. gash the admin\n6:18 PM - random guy who was on the server: Yeah.\n6:18 PM - random guy who was on the server: Apparently\n6:18 PM - random guy who was on the server: he says you were hacking\n6:19 PM - fraulein schlampe: ...\n6:19 PM - fraulein schlampe: ROFL\n6:19 PM - fraulein schlampe: AHAHAHA\n6:19 PM - fraulein schlampe: REALLY?\n\n Length of Ban:  I have no idea. Permanent?\n\n What server were you playing?:  Trouble in Terrorist Town.\n\n Who banned you?:  Mr. Gash\n\n Why should we unban you?:  When I play TTT, I have a process. This process has an amazing track record. However, at the time of killing Mr. Gash, my process was complete. Someone died, right? The body was not identified right away. I turned because I heard gunshots, and I saw Mr. Gash, who was hurt, holding a rifle. The guy in front of him did not have any weapon out. The guy who found the body just left the room I was in, headed in the direction that Mr. Gash was going to. And, there we go. I knew he was the traitor. I opened fire upon him, and he shot back. He killed me. \n\nDarn! Well, I guess it's just the game.\n\nLater, he got identified as the traitor and I was like \"I knew it!\" in my mind. He asked me why I shot at him, and I said some witty reply. He then banned me later. \n\nThis is a picture of the logs.\n\n http://i56.tinypic.com/4g16jd.jpg "},{"postId":14715,"topicId":1732,"posterId":389,"postTime":1295827167,"postText":"You were banned for trolling according to the reason from the ban I saw."},{"postId":14716,"topicId":1732,"posterId":2,"postTime":1295827675,"postText":"Faphack + RDM Attempt. It was a 60 minute ban. Ban requests are only valid if over one day (1440 minutes)."}]}