{"topicId":4110,"forumId":24,"topicTitle":"Remembering 9/11/01","topicTime":1315790119,"topicViews":80,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"cappiman","topicFirstPosterColor":"","topicLastPosterName":"Human Aimbot","topicLastPosterColor":"009900","topicLastPostTime":1315795997,"posts":[{"postId":33041,"topicId":4110,"posterId":754,"postTime":1315790119,"postText":"First off I would like to say that this isn't a fourm topic to be funny, this is a serious post. Please do not spam on this one. As we all know today is the 10th anniversary of 9/11/01. We, as a nation, were affected by it. Now I have four questions for all of you:\n\n1. Do you wish that we, as a nation, were united like we were back in 2001\n2. How has 9/11/01 affected you?\n3. What do you remember when 9/11/01? if not then answer number 4\n4. Were you around when 9/11/01 happened?\n\nmy response for my questions that I asked.\n\n1. Yes I do wish that we were united like we were back in 2001\n2. 9/11/01 has affected me indirectly because I had a teacher who's husband was in 9/11/01 and hearing his side of the story has made me be touched by those who died and survived in the incident\n3. What I remember that happend in 9/11/01 is that I was currently home schooled and we were planning on a trip to go to the twin towers on 9/11/01 but was cancelled due to a flight being over booked and I thank God that I didn't go. Also I was eating fish sticks and tater tots with Ketchup and one of our neighbors and a close friend of the family said to turn on the TV something seirous is happening.\n4. (see above)\n\nThanks guys for being serious about this and God bless our Policemen and women, and our firefighters."},{"postId":33046,"topicId":4110,"posterId":142,"postTime":1315790646,"postText":"And for those not living in the US, AT LEAST pray for those who lost someone, US and other side and every side."},{"postId":33048,"topicId":4110,"posterId":634,"postTime":1315791194,"postText":"I was too young to remember most of it, or grasp what really happened. But I remember seeing the newspaper headlines with a huge picture of the towers on fire the next day."},{"postId":33052,"topicId":4110,"posterId":517,"postTime":1315792757,"postText":"God bless 9/11/01"},{"postId":33053,"topicId":4110,"posterId":6,"postTime":1315793442,"postText":"1. Yes, I wish we were united like that again.\n2. 9/11/01 affected me greatly. It pained me to see the sight of the buildings on fire, and knowing all of the lives that were lost that day. I will truly never forget. The bravery of Flight 93 to stop the hijackers, is something that inspires me.\n3. I was really young, but I still remember it vividly. I was watching some TV in the living room when my mom rushed in and changed the channel. The sight of the first building on fire was horrible, but seeing the second plane hit, was even worse. It's one of those things I will NEVER forget, ever.\n4. Of course.\n\n9/11/01, Never forget. Many innocent lives were lost that day. R.I.P. to all of the innocent souls that were killed on that awful day."},{"postId":33054,"topicId":4110,"posterId":634,"postTime":1315794711,"postText":"Watching the history channel today and seeing more of what really happened in the city makes me really respect the NYC Fire Fighters and Police Department, they are all heroes in my book and of course the passengers of Flight 93 that took action."},{"postId":33060,"topicId":4110,"posterId":735,"postTime":1315795997,"postText":"1. We are still united, but not in the sense of sadness and looking out for one another. More in the sense of we are just living here.\n2. I realized later that everyone and everything is vulnerable. Also, that the strength of religious extremism can overpower someone to do something that is against the morals of the religion.e.x: A radical Islamist killing innocent lives.\n3. I was 4 and my mom picked me up from preschool because of it."}]}