{"topicId":4270,"forumId":3,"topicTitle":"upcoming map (minor idea input)","topicTime":1316595158,"topicViews":319,"topicReplies":29,"topicStatus":0,"topicFirstPosterName":"Udane","topicFirstPosterColor":"009900","topicLastPosterName":"Wheatley Is C-Gull","topicLastPosterColor":"","topicLastPostTime":1319584281,"posts":[{"postId":33968,"topicId":4270,"posterId":605,"postTime":1316595158,"postText":"Ok, so, gash convinced me to work on ttt_catastrophe as my next map. (using realistic textures/lighting before there are any questions about that)\n\nDuring the map, a random catastrophe will occur around the 7 minute mark. \nThus far, these includes; \nFlood, which will block doors when the water gets a certain height on them, forcing people to get out using the windows/drown\nLightning, which forces a thunderstorm to rage, striking lightning at one of the preset areas randomly, killing anyone fairly close to it\nEarthquake, which is nothing more then random occurences of shaking the players screen (mostly to hinder aim)\nUFO, which spawns a U.F.O. in the sky, circling the map, pulling up anything underneath it, then dropping the items/players randomly... this effect goes through buildings.\n\nExtra possible ideas include;\nZombie invasion, which spawns mostly posion zombies around the map (may not make the cut out of fear of those without hl2)\nPropane leak, which allows some buildings to randomly combust and set ablaze on the inside (may not make the cut, as it would be pretty random compared to the lightning, which has obv preset areas)\n\nBasically, im fishing for input/any other ideas about possible catastrophes. Easier ones would be added in easily, while clever ones would make the map stand out more. :o"},{"postId":33969,"topicId":4270,"posterId":373,"postTime":1316595407,"postText":"Cthulhu, Cthulhu awakens to wreak havoc on the innocents/traitors by turning them insane, killing them, and by all means devouring their souls/physical bodies. Cthulhu spawns somewhere\nin the map in his glorious tentacly-form to bring about the Apocalypse."},{"postId":33970,"topicId":4270,"posterId":605,"postTime":1316595824,"postText":"Talked with balenti more about his idea, this is what it turned into, and is highly likely to appear\n\n\"3:58 AM - Udane: so, you want me to make a custom model, give it an input that follows players, have them psychologically effect players, and the eat them? :o\n3:58 AM - Balenti: Not all in that order but yes\n3:59 AM - Udane: i can do something similar, which spawns a dark creature, that will fly around you similar to how the cube flies around the rifle in confused peice 2, and while doing so, slowly deals damage to you\n3:59 AM - Udane: if you get close to it\n4:00 AM - Balenti: I was hoping for tentacle-murder, but mk.  Could it atleast give you some form of fucked up vision while close to it?\n4:00 AM - Udane: i could make it force you to jerk your screan randomly\n4:00 AM - Balenti: yes! :o\""},{"postId":33971,"topicId":4270,"posterId":252,"postTime":1316601386,"postText":"How about a asteroid/comet impact?"},{"postId":33972,"topicId":4270,"posterId":243,"postTime":1316608115,"postText":"Can I has dragon?\n\n\nOr we could have some lucky events, like.. weapons and ammo fall from teh sky, or everyone randomly gets a rocket jump :P"},{"postId":33973,"topicId":4270,"posterId":605,"postTime":1316610559,"postText":"to radio;\nentirely doable, but it falls under the line of the lightning strike... it would hit one of the preset areas to deal damage... one requires no additional rendering minus a quick flash of light and the other requires a large prop be rendered in the sky, along with an explosion upon its impact, and if i wanna be fancy, said model being broken into peices and layed about on the ground... \nkinda like the idea now that im thinking of making it fancy... maybe even make said area radioactive or something, ima file this one as a possibility\n\nto funnyraff;\ndragons would require new models, i/os stuck to each apendage along with moving objects, not to mention a player sensor, 20 or so i/o checkers to see if any other i/os are firing at each moment an i/o fires,... if i were to make a dragon feesable in a map, the map itself will focus on the dragon alone... though i could make a prop dragon fly by in the sky, and scorch preset large directional areas... \ni think ima stick with the ufo, too similar\n\nP.S. funnyraff;\nweapons and ammo falling from the sky? EVERYONE GETS A ROCKET JUMP?\nhow are these catastrophes? :O! these make people happy, not fear for their life.\n(im tempted to make the opposite of the catastrophe map at one point though)"},{"postId":33975,"topicId":4270,"posterId":364,"postTime":1316611527,"postText":"How about at random, one of the tratior is given a chain gun, flamthrower, or some other rape weapon that at the sound let you know trubles comming."},{"postId":33992,"topicId":4270,"posterId":101,"postTime":1316633555,"postText":"7 minutes = 7 minutes IN and not 7 minutes LEFT, right?\n\nSince the lightning storm would piss me off if it was insta-kill and 7 minutes left."},{"postId":33999,"topicId":4270,"posterId":4,"postTime":1316637009,"postText":"There's enough overrated zombie shit everywhere, propane/other :D"},{"postId":34018,"topicId":4270,"posterId":464,"postTime":1316646007,"postText":" http://images.cheezburger.com/completestore/2010/8/3/ee407420-1bb8-4810-bcf7-1e74deef810d.jpg "},{"postId":34025,"topicId":4270,"posterId":1094,"postTime":1316647898,"postText":"I personally like the idea of a full-fledged zombie invasion, but the propane leak sounds really fun too.  Should there be sources of the propane,  such as tanks?  Or will buildings just burst into flames?  The Cthulu idea sounds really cool, just complicated to make work. I'm sure you can do it, but it'll be hard to explain to people too.  Not putting it down, just thinking out loud.\n\nThe main thing I like about a large-scale zombie invasion is just the panic that it would cause.  It would make people start shooting wildly trying to kill zombies, the massive gunfire and hostiles everywhere would cause more fear and confusion among innos and a good opportunity for traitors.\n\nJust my opinion.  I couldn't really come up with anything unique, and I like the paths you are taking already, Udane. Good luck, look forward to the finished map!"},{"postId":34034,"topicId":4270,"posterId":272,"postTime":1316655654,"postText":"THUNDERSTOOOOOOOOOOOOOOOOOOOORM :D\nOntopic: Electricity failure, doors (if electronic) become useless/other electronical stuff"},{"postId":34035,"topicId":4270,"posterId":605,"postTime":1316656483,"postText":">> How about at random, one of the tratior is given a chain gun, flamthrower, or some other rape weapon that at the sound let you know trubles comming. \nI COULD make a mounted controlable chain gun, but i can not make a gun that you can actually pick up as an item... im a mapper not a coder :O!\nSecondly, this suggestion is not a catastrophe, though i may place in a chain gun/psychics flame thrower in a future map :o\n\nto dum;\nCorrect, it would be around the time of 3 minutes left, though i may make it a minute later, still not 100% sure.\n\n>> The main thing I like about a large-scale zombie invasion is just the panic that it would cause.  It would make people start shooting wildly trying to kill zombies, the massive gunfire and hostiles everywhere would cause more fear and confusion among innos and a good opportunity for traitors. \nIs exactly the reason behind me considering it :O!\n\nto kryziod;\nHonestly, i cant think of any ttt maps with more then 4 zombies in it :o I'm talking an invasion of at the least of 40 zombies, of which when dead, spawns more, till the round ends.\n\nThank you all for your input, polls will still be open for a couple of days, and you can always change your vote if you so desire ;p\n\nOn a more direct note about the map, the map itself is going to be comprised of only css textures/props, mostly be liniear and kinda blocky, so as to focus on the catastrophes instead of the map itself. Lighting is mostly gonna be dark and stormy, in some cases forcing you to use your flashlight.\nI'm not going to just punch out this map quickly, i'm working on it bit by bit :o"},{"postId":34047,"topicId":4270,"posterId":6,"postTime":1316663181,"postText":"Hurricane or Tornado plox"},{"postId":34048,"topicId":4270,"posterId":272,"postTime":1316665037,"postText":">> Hurricane or Tornado plox \nThis."},{"postId":34052,"topicId":4270,"posterId":605,"postTime":1316676833,"postText":">> Hurricane or Tornado plox \nThis will actually be something new for me to learn doing; but if its within my grasp, i shall do it :O!"},{"postId":34054,"topicId":4270,"posterId":1094,"postTime":1316679589,"postText":"You should have a house with ragdoll legs with red shoes on coming out from underneath it if you make it tornado.  If that's even possible of course.  I am excite for the future though :D"},{"postId":34061,"topicId":4270,"posterId":364,"postTime":1316713063,"postText":"How about a large Gash is opened in the sky / sky box, anyone who uses mic or types in chat is hit by a Large hand holding a Hammer?"},{"postId":34066,"topicId":4270,"posterId":612,"postTime":1316714945,"postText":"How about a fissure?\nOr a sinkhole\nOr a plane crash( not a technical catastrophe, but I wouldn't want it to happen irl)\nMaybe a wild man eating plant starts growing in random spot and random times. \nGiant bees. \nOne super OP zombie\nBlizzard ( freeze to death if you can't find heat sources)\nI can't think of any thing else"},{"postId":34079,"topicId":4270,"posterId":153,"postTime":1316730594,"postText":"Propane leak!\nAnd, could you make one building collapse per round? Building caves in and kills everyone in it :D"},{"postId":34095,"topicId":4270,"posterId":605,"postTime":1316743472,"postText":">> How about a large Gash is opened in the sky / sky box, anyone who uses mic or types in chat is hit by a Large hand holding a Hammer? \nThis requires a point_servercommand, which for some reason beyond my understand, ttt really hates ;~;\n(the one registering mic commands is currently impossible though)\n\n>> Ben\":2ba7umkt]And, could you make one building collapse per round? Building caves in and kills everyone in it :D \nNone of the building would really be high enough for this to be really effective. But if i were to do this, id lump it in with earthquake.\n\n>> How about a fissure?\nOr a sinkhole\nOr a plane crash( not a technical catastrophe, but I wouldn't want it to happen irl)\nMaybe a wild man eating plant starts growing in random spot and random times. \nGiant bees. \nOne super OP zombie\nBlizzard ( freeze to death if you can't find heat sources)\nI can't think of any thing else \n\nif i were to do fissure or sinkhole, they would be combined with earthquake\nplane crash is excedingly similar to meteor, with a meteor being easier :o\nWild plant would be possible if i find a model of such a thing ;p\nI'ma skip the gaint bees, as they would fit along the lines of a man eating plant in techinicality wise\nOne super OP zombie would only cause a small disturbance in one area, I'd rather go with 4 or 5 :o\nand lastly, i love the blizzard idea, freezing anyone who is outside of a building very slowly"},{"postId":34096,"topicId":4270,"posterId":243,"postTime":1316743939,"postText":"Cool moving parts in the skybox, teleporter to skybox. :D?"},{"postId":34116,"topicId":4270,"posterId":634,"postTime":1316746776,"postText":"Gravitational fluxuations. Make It so If this event occurs loud alarms sound for 10 seconds and after that, gravity is reversed and pulls everyone into the air that is outside and then releases them to fall to their death. You could also hold onto stuff with hands to save yourself."},{"postId":34124,"topicId":4270,"posterId":605,"postTime":1316753721,"postText":">> Gravitational fluxuations. Make It so If this event occurs loud alarms sound for 10 seconds and after that, gravity is reversed and pulls everyone into the air that is outside and then releases them to fall to their death. You could also hold onto stuff with hands to save yourself. \n\na tornado is already looking like its going to make the map lag, by cause of prop movement, but a complete map version of a tornado is just out of the question"},{"postId":34607,"topicId":4270,"posterId":1112,"postTime":1317436062,"postText":"You can make it with the 7 minutes in have certain areas become like no man's lands like in Berlin Wall, where you get killed if you enter certain areas and must take a detour. Also, place warning posts when it happens so you don't get surprise butt secks from a chaingun."},{"postId":35838,"topicId":4270,"posterId":1087,"postTime":1319087481,"postText":"Why not have like a Robot coem in and shoot lazers around teh map....Like an Evil Iron Giant Oh! And its weak point is to shoot a lil boy e cluchtes in his hand!"},{"postId":35850,"topicId":4270,"posterId":605,"postTime":1319094760,"postText":"since we brought this back up, might as well note, im hitting some engine errors atm, hence why tri_elements was created instead."},{"postId":36208,"topicId":4270,"posterId":1087,"postTime":1319422365,"postText":">> since we brought this back up, might as well note, im hitting some engine errors atm, hence why tri_elements was created instead. \n\nAperentley Tri_elements didnt show love to you either."},{"postId":36225,"topicId":4270,"posterId":605,"postTime":1319436072,"postText":"engine error=taxing the game engine too much and crashing, not properly acting in the intended action of triggers, and/or bugs that cant be squished yet with my knowledge of inputs/outputs.\n\ntri_elements=1 bug that was squished quick, 1 graphical glitch caused by a sub folder not properly packing the textures into the map properly."},{"postId":36357,"topicId":4270,"posterId":1087,"postTime":1319584281,"postText":">> engine error=taxing the game engine too much and crashing, not properly acting in the intended action of triggers, and/or bugs that cant be squished yet with my knowledge of inputs/outputs.\n\ntri_elements=1 bug that was squished quick, 1 graphical glitch caused by a sub folder not properly packing the textures into the map properly. \n\nMe= Not good with source so to me Checkerboard might as well be Engine problems XD"}]}