{"topicId":4214,"forumId":22,"topicTitle":"Admins blocking their own unbans","topicTime":1316385498,"topicViews":246,"topicReplies":27,"topicStatus":1,"topicFirstPosterName":"Chemixer","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1316580005,"posts":[{"postId":33549,"topicId":4214,"posterId":1098,"postTime":1316385498,"postText":"It seems to me like a  huge  conflict of interests for admins deciding on the outcome of an unban request when they themselves banned the person. An admin can easily ban someone for a time longer than necessary or ban because they do not like someone and then deny the request to be unbanned because they don't want to look weak or because they simply don't like the person and don't want them back on the server."},{"postId":33551,"topicId":4214,"posterId":634,"postTime":1316385785,"postText":"Perhaps if people would actually read this, there would be fewer misunderstandings.\nhttp://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=14&t=1946"},{"postId":33589,"topicId":4214,"posterId":115,"postTime":1316395366,"postText":"Admins are made admins because they're trustworthy and know what they're doing.\n\nUnban requests are usually if it was a misunderstanding. If the admin is not corrupt, then they will listen to what they have to say (which they do) and deal with it from there."},{"postId":33685,"topicId":4214,"posterId":1098,"postTime":1316455570,"postText":"That only works if admins are aren't corrupt. It would be much easier to let a different admin take care of an unban requests to avoid the chance of an admin not doing their job properly. Why take such an unnecessary risk? It wouldn't be difficult to have a different admin decide whether or not an unban request is accepted or denied."},{"postId":33687,"topicId":4214,"posterId":79,"postTime":1316456952,"postText":">> Admins are made admins because they're trustworthy and know what they're doing.\n\nUnban requests are usually if it was a misunderstanding. If the admin is not corrupt, then they will listen to what they have to say (which they do) and deal with it from there. \n\nTrustworthy to who though Quack. THAT is the problem. They aren't trustworthy to the normal players but to the other admins and to Gash. This is the problem with the situation, corruption is not something that can be determined by other admins, but by the player basis as a whole."},{"postId":33692,"topicId":4214,"posterId":1098,"postTime":1316459395,"postText":"for once i must agree with crisis, he is absolutely right"},{"postId":33699,"topicId":4214,"posterId":634,"postTime":1316465994,"postText":">> for once i must agree with crisis, he is absolutely right \nIs chemixer your steam name as well?\n\nAnd to both of you I'd like to say, No shit they're trustworthy to Gash, he owns the server. What kind of stupid statement is that? Why would any admin not be trustworthy to Gash, unless they were looking for a demotion?"},{"postId":33725,"topicId":4214,"posterId":1098,"postTime":1316475547,"postText":"Destar, you are clearly missing the point. The purpose of the post is to improve the server by recommending a way of preventing a single admin full control over the banning/unbanning process. With the way things are now it is too easy for corrupt admins to ban people for any reason they choose and than keep them banned. If a different admin is responsible for the unban request then if a player were wrongfully banned he/she will have a chance to become unbanned rather than be ignored by an admin that banned for an inappropriate reason."},{"postId":33741,"topicId":4214,"posterId":115,"postTime":1316479612,"postText":">> >> Admins are made admins because they're trustworthy and know what they're doing.\n\nUnban requests are usually if it was a misunderstanding. If the admin is not corrupt, then they will listen to what they have to say (which they do) and deal with it from there. \n\nTrustworthy to who though Quack. THAT is the problem. They aren't trustworthy to the normal players but to the other admins and to Gash. This is the problem with the situation, corruption is not something that can be determined by other admins, but by the player basis as a whole. \nWell you have to remember it's not a democracy either. Admins are chosen to be fair, to be honest, and to NOT be corrupt. They're trustoworthy to NNJG and their job as admin. Admins can't trust players, to only be fair. For example, an admin won't just ban a player because another player said they broke a rule.  \n\nI honestly haven't seen a single admin who has been corrupt once. Players cry corruption when they dont get their way, and that's usually how it goes.\n\nAn admin's decision is usually a final decision. If you feel otherwise, maybe you should message a different admin to check out what you posted."},{"postId":33821,"topicId":4214,"posterId":1098,"postTime":1316531308,"postText":">> Admins are made admins because they're trustworthy and know what they're doing.\n\nUnban requests are usually if it was a misunderstanding. If the admin is not corrupt, then they will listen to what they have to say (which they do) and deal with it from there. \n\nThe problem is admins aren't always trustworthy. There should be a safeguard in place to prevent admins from doing whatever they want by having admins keep an eye on each other. The way things are right now an admin can easily get away with banning a player simply because they don't like them, especially if a player has a history of acting up. Quack, you yourself banned someone for no apparent reason recently. When asked why said player was banned the reason you gave was that you wanted to ban them awhile ago but didn't. Then all of a sudden decided to do it a week later. You have also banned people based on the word of another player, I can even name 2 occasions where it happened. To me that sounds like an odd reason to ban a player and is an indicator that safeguards should be put in place for potential future occurrences. If admins can't see the simple (and easily implemented) safeguards that can prevent such strange actions than I don't know how admins can been deemed trustworthy."},{"postId":33830,"topicId":4214,"posterId":612,"postTime":1316539140,"postText":"I kind of see what he is saying. I mean let the banning admin post in the unban req. But they shouldn't decide if that player should get unbanned or not. It is a conflict of interest."},{"postId":33848,"topicId":4214,"posterId":332,"postTime":1316542567,"postText":"I Totally agree with Chemixer. We are all human and no one is above corruption and bias, just like a police man is not involved in cases that involve him an admin shouldn't be involved in unban requests involving him/her. Simply put its a conflict is Interest."},{"postId":33854,"topicId":4214,"posterId":612,"postTime":1316545091,"postText":"Who is this kid? Admin can you fix the thread?\n\nAlso since this is most likely your second account they are likely and capable to ip ban you. So. You might want to change your posts. Because it's some one involved in this situation. It's doubtedly Sarver or rose or chemixer."},{"postId":33856,"topicId":4214,"posterId":115,"postTime":1316545554,"postText":">> An admin's decision is usually a final decision. If you feel otherwise, maybe you should message a different admin to check out what you posted. \nRead this.\n\nIs it a conflict of interest? How could other admins REALLY know whats going on if they weren't there for the ban? How can they properly decide on the situation?\n\nThey can't. They're not going to take your word over an admins. They either have to be there or the banned person has to have proof. Otherwise, you just have to have your fate in fairness of the admin.\n\nAlso, if this has to do with sarver, I banned him for being an alt account. I gave him a second chance, and gave him SPECIFIC directions on what he shouldn't do, and he broke them. Nothing more to it."},{"postId":33857,"topicId":4214,"posterId":612,"postTime":1316546056,"postText":">> >> An admin's decision is usually a final decision. If you feel otherwise, maybe you should message a different admin to check out what you posted. \nRead this.\n\nIs it a conflict of interest? How could other admins REALLY know whats going on if they weren't there for the ban? How can they properly decide on the situation?\n\nThey can't. They're not going to take your word over an admins. They either have to be there or the banned person has to have proof. Otherwise, you just have to have your fate in fairness of the admin. \n\nofftopic: Ban requests use this same philosophy?\n\n>> Also, if this has to do with sarver, I banned him for being an alt account. I gave him a second chance, and gave him SPECIFIC directions on what he shouldn't do, and he broke them. Nothing more to it. \n\nthis doesnt have alot to do with sarver. it has to do with chemixer. he was following crisis, and crisis was giving him three warnings before shooting. apparently that is the art trolling."},{"postId":33859,"topicId":4214,"posterId":115,"postTime":1316546352,"postText":">> >> >> An admin's decision is usually a final decision. If you feel otherwise, maybe you should message a different admin to check out what you posted. \nRead this.\n\nIs it a conflict of interest? How could other admins REALLY know whats going on if they weren't there for the ban? How can they properly decide on the situation?\n\nThey can't. They're not going to take your word over an admins. They either have to be there or the banned person has to have proof. Otherwise, you just have to have your fate in fairness of the admin.\n\nAlso, if this has to do with sarver, I banned him for being an alt account. I gave him a second chance, and gave him SPECIFIC directions on what he shouldn't do, and he broke them. Nothing more to it. \n\nofftopic: Ban requests use this same philosophy? \nNo. Admins word IS their proof (they dont need any). Ban requests are for when admins dont catch something or when no admins are on. They run a totally different philosophy. If you have enough proof, it gets accepted. I guess the same goes for unban requests (when they're not mistakes or mixups)."},{"postId":33861,"topicId":4214,"posterId":612,"postTime":1316546946,"postText":"Scenario:\nAdmin A keeps getting knifed, over and over again.\nplayer 1 knifes Admin A again because he thinks its funny\nAdmin A gets angry because its not fun to be clicked on and fall over dead\n[player ! doesnt realize this]\nNEXT ROUND\nPlayer one sees some one go into the traitor room, and accidentally calls out the wrong person which just so happens to be Admin A\nAdmin A IS a traitor but not the traitor that went into the traitor room\nPOST ROUND\nAdmin A asks Player 1 why he called him out\nPlayer 1 explains why and doesnt realize that he call out the wrong guy.\nAdmin A (who is still frustrated) bans Player 1 for 3 days:False Callout\nin reality, this warrants a slay but Admin A is not having the best of days\n\nMoral to this story: punishments are not standard in NNJG\n its mostly based off of how the admin is feeling at the time. so, sometimes, its a conflict of interest."},{"postId":33862,"topicId":4214,"posterId":115,"postTime":1316547183,"postText":"No, it's not. How the admin is feeling shouldn't/almost never affects their judgement or how they ban."},{"postId":33863,"topicId":4214,"posterId":612,"postTime":1316547485,"postText":"Ill say this, because it happened. I was playing with Admin A on gm_cliffhanger and i got goombad to like 36 hp. and i saw Admin A walk away after i got launched off of some ones head, SO HONESTLY thinking it was Admin A, i called him out. Admin A was a traitor, but not the person who goombad me. I got the wrong guy. banned for an hour instead of a slay. sure it was false callout. but it wasnt random, just an accident. i see people get slayed for false callout alot and because Admin A was angry because his T round was ruined i was banned instead of slayed.\n\nThey are not standard,you cannot argue that."},{"postId":33865,"topicId":4214,"posterId":115,"postTime":1316547918,"postText":"Oh dear, a ban for an hour! That's such an outrage! \n\nHow do you know he banned you for an hour because he was mad? You didnt give us the full story either. Maybe you had previous rdms or previous accidental/purpose false callouts within the time you were on. \n\nSee, if an admin is on, he doesnt just take 1 instance into consideration. They collect what you have done previously on the server, and decides from there what the punishment should be.\n\nI don't want to hear \"but i didnt rdm or do anything wrong before!\" because that's beside the point I'm trying to make."},{"postId":33871,"topicId":4214,"posterId":612,"postTime":1316548494,"postText":"Quit being sarcastic quack. when you lengthen the ban by ANY amount of time because of feelings, it nullifys your statement. slay> hourban"},{"postId":33872,"topicId":4214,"posterId":612,"postTime":1316548598,"postText":">> You didnt give us the full story either. Maybe you had previous rdms or previous accidental/purpose false callouts within the time you were on. \n \nso you are saying that if an admin bans you for a day for false call out, it was because you false called out AND rdmed and other things before?\n\nyou cant make a point out of opinion.\nwhat you are trying to argue is that admins are always right."},{"postId":33873,"topicId":4214,"posterId":1098,"postTime":1316548840,"postText":"This has nothing to do with my ban, I deserved it and accepted it. This has everything to do with Quack being a terrible admin who does not even follow his own ideas on how an admin should act. I feel that he will be more fair and act the way an admin should if there are people watching him and keeping him in check from going power crazy like he clearly has. I don't see why it is such a big deal for admins to keep an eye on each other. It is a very simple concept with powerful results."},{"postId":33876,"topicId":4214,"posterId":115,"postTime":1316550369,"postText":">> >> You didnt give us the full story either. Maybe you had previous rdms or previous accidental/purpose false callouts within the time you were on. \n \nso you are saying that if an admin bans you for a day for false call out, it was because you false called out AND rdmed and other things before?\n\nyou cant make a point out of opinion.\nwhat you are trying to argue is that admins are always right. \nNo, I'm saying if you continue breaking the rules, your ban will be lengthened. Simple as that and clear as day. And don't try and say \"SO WHAT YOU'RE SAYING/ARGUING IS\" because I state it clear enough, and everything you try and make it into is false.\n\n\n>> Quit being sarcastic quack. when you lengthen the ban by ANY amount of time because of feelings, it nullifys your statement. slay> hourban \nThe ban would be lengthened from a slay to an hour ban if it's something you continue to have been doing, and the admin sees that.\n\n>> This has nothing to do with my ban, I deserved it and accepted it. This has everything to do with Quack being a terrible admin who does not even follow his own ideas on how an admin should act. I feel that he will be more fair and act the way an admin should if there are people watching him and keeping him in check from going power crazy like he clearly has. I don't see why it is such a big deal for admins to keep an eye on each other. It is a very simple concept with powerful results. \nAdmins do keep each other in check. \n\nWe're all watched over by Gash and Ben + other admins.\n\nI think I'm as fair as can be. I dont let personal feelings get in the way of my job as administrator, I know the rules and ban accordingly, and I dont put up with bullshit like yours.\n\nAnd thanks for the personal attack. Appreciate it."},{"postId":33877,"topicId":4214,"posterId":1098,"postTime":1316551917,"postText":"Quack, no words can change your actions. In the case of Sarver's ban u still have not given a reason for banning him. With Billy_Larkin, u banned him because someone said he was an alt of Vercon without looking into it. Your actions show that you are a bad admin no matter what words you spew from your mouth. You are a perfect example of why safeguards should be put in place."},{"postId":33879,"topicId":4214,"posterId":735,"postTime":1316552579,"postText":"Can't only Gash and Ben unban?"},{"postId":33880,"topicId":4214,"posterId":115,"postTime":1316553132,"postText":">> Quack, no words can change your actions. In the case of Sarver's ban u still have not given a reason for banning him. With Billy_Larkin, u banned him because someone said he was an alt of Vercon without looking into it. Your actions show that you are a bad admin no matter what words you spew from your mouth. You are a perfect example of why safeguards should be put in place. \nFor sarver's ban, I gave a reason. It's his alt, and hes suppose to be banned. I gave him a chance and gave him reasons for him being rebanned, and he blew it. \n\nI did look into the vercon and billy larkin matter, actually quite a lot. Dont call me out on things you are only getting information from one side of the story.\n\nIf you think I'm such a terrible admin, then open a staff abuse report. \n\nYou're obviously upset over your friends being banned, and I understand that. But you complaining with bad reasoning definitely isnt helping your cause."},{"postId":33957,"topicId":4214,"posterId":2,"postTime":1316580005,"postText":">> Can't only Gash and Ben unban? \n\n(Posting just to answer his question)\n\nAdmins can only unban the people they banned, only Ben and I can unban anyone, and in some cases remove the ban."}]}