{"topicId":944,"forumId":1,"topicTitle":"Is Turning off the lights in Clue a Traitorous act?","topicTime":1287112355,"topicViews":131,"topicReplies":11,"topicStatus":1,"topicFirstPosterName":"antisocial21","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1287193029,"posts":[{"postId":9129,"topicId":944,"posterId":259,"postTime":1287112355,"postText":"Well there was a huge rdm fest today on Clue perpetrated by our dear Admins Sanya and Ben.  Those two said that turning off the lights is a killable offense while others disagreed.  Those who disagreed naturally got shot by Ben and others for turning off the lights.  Sanya one round rdmed Thunder and I.  I didn't do anything but Thunder turned off the lights and Sanya shot me and he later shot Thunder.  By the time Ben and Sanya had rdmed enough people, their karma was in the low 600s and were close to being karma banned, so they just left to avoid karma ban.  The way I see it, I was rdmed at least 5 times because turning off the lights is not a traitorous act since a traitor would not turn off the lights in front of everyone and risk being shot.  Hell, even Gash said you can't kill someone for turning off the lights.  Just curious what you guys thought about the whole matter, comment whether you see flipping the switches as a traitorous act or if you thought Ben and Sanya rdmed a shit load of people."},{"postId":9130,"topicId":944,"posterId":67,"postTime":1287112639,"postText":"I think..\na.) its not traitorous\nb.) its extremely fucking annoying though\nc.) although why would you want to turn them off if you're not the traitor aside from pissing everyone else off on purpose, in which case i'd probably shot you too"},{"postId":9133,"topicId":944,"posterId":259,"postTime":1287114077,"postText":"I did it just to test them and because I thought it was wrong for them to shoot people for turning off the lights.  Like 5 people at once gather around the lights and started turning them off and ben started shooting at everyone, he turned out to be innocent and soon left once his karma was dipping into the 500s.  It was not stated anywhere in the rules that you cannot turn off the lights nor do admins have the right to say turning off the lights is a killable offense and to begin shooting anyone who turned them off"},{"postId":9140,"topicId":944,"posterId":101,"postTime":1287116763,"postText":"I think it looks cooler when the lights are off :/ I hate people who say \"OMG, A COMMON MAP FUNCTION WHICH IS OPEN TO BE USED BY EVERYONE WHO GIVES THE MAP A TWIST AND ACTUALLY GIVES THE MAP A GOOD REASON TO COME BACK TO IT. KILL THE PERSON WHO TURNED IT ON\"\n\nWhat a joke people."},{"postId":9145,"topicId":944,"posterId":128,"postTime":1287159167,"postText":"Besides, allowing people to kill for that just gives traitors an excuse to get away with another kill."},{"postId":9146,"topicId":944,"posterId":4,"postTime":1287159960,"postText":">> Besides, allowing people to kill for that just gives traitors an excuse to get away with another kill. \n\nexactly.\ni agree that it can be very annoying, but still, i also think that the lights should have a limit of use.\nlike, for example, every time you flip the switch, you have to wait 30 seconds before flipping it again\nalthough, the map would have to be edited :/"},{"postId":9148,"topicId":944,"posterId":67,"postTime":1287162969,"postText":"if you were to impliment that, i think it should be able to be turned back on immidiately though, and then cant be turned back off for another 30sec"},{"postId":9155,"topicId":944,"posterId":153,"postTime":1287176546,"postText":"I killed 1 person. Also, the 2nd time, I was traitor and used it as an excuse for kills."},{"postId":9156,"topicId":944,"posterId":259,"postTime":1287176858,"postText":"Fine Ben, but you are exactly proving JoshJosh's point before"},{"postId":9157,"topicId":944,"posterId":82,"postTime":1287177333,"postText":"Clue should be updated to use the credit entity, and the buttons only traitors can see, so once you use the lights you use a credit and they stay off for the rest of the round."},{"postId":9159,"topicId":944,"posterId":101,"postTime":1287180836,"postText":">> Clue should be updated to use the credit entity, and the buttons only traitors can see, so once you use the lights you use a credit and they stay off for the rest of the round. \n\n1. People would probably be like \"WUTS THIS DO\" and lose a credit then go all :(\n2. People would instantly know where the traitor was\n3. Its a waste of a credit really."},{"postId":9177,"topicId":944,"posterId":2,"postTime":1287193029,"postText":" Killing someone for turning off the light will result in a  ban  \n\nEnd of discussion, I enforce this rule whenever possible."}]}