{"topicId":1504,"forumId":14,"topicTitle":"I'm not sure why I was banned.","topicTime":1293862357,"topicViews":154,"topicReplies":9,"topicStatus":1,"topicFirstPosterName":"Blackllama79","topicFirstPosterColor":"","topicLastPosterName":"popl43","topicLastPosterColor":"","topicLastPostTime":1294960445,"posts":[{"postId":13323,"topicId":1504,"posterId":408,"postTime":1293862357,"postText":"Your In-Game name: (=CG=) Blackllama -BDS-\nReason: I have no idea why I was banned.\nLength of Ban: How am I supposed to know?\nWhat server were you playing?: The JailRP server.\nWho banned you?: Again, I have no idea.\nWhy should we unban you?: Well, I have no idea why I was banned, I was not given any reason for being banned, just a period.  \n\nAdditional Information: Before I was kicked, I was warden and didn't do anything except kill a couple of people, 1. for moving when asked to freeze, and 2. for punching a guard.  I was not given a warning for anything or told to stop, nor was I asked why they were killed.  Was it a mistake?  Please help me.  C'mon guys and Garry, you know I wouldn't do anything."},{"postId":13328,"topicId":1504,"posterId":2,"postTime":1293868130,"postText":"Steamid"},{"postId":13330,"topicId":1504,"posterId":54,"postTime":1293870009,"postText":"STEAM_0:0:26690141 -- got it for him"},{"postId":13338,"topicId":1504,"posterId":408,"postTime":1293906462,"postText":"Sorry, I must've made a mistake copy and pasting the form.   I may actually have a demo that was recording for a while before I was kicked, let me see.... \n\nThere was no demo."},{"postId":13344,"topicId":1504,"posterId":408,"postTime":1293909750,"postText":"Ok, apparently I was banned by spaceball, or was it spaceman.  I'm not sure.  Anyways. I tried talking to him in steam chat and he answered my call, but his mic wasn't working, so I tried text chat, and he ignored me.  It was only a day ban, Im back in the game, but I still want to know why."},{"postId":13348,"topicId":1504,"posterId":404,"postTime":1293912541,"postText":"Why don't you ask spacewhatever if  he banned you for having your mic muted, since I already told you that's a very likely reason. (I'm blackllama's twin bro by the way.) Even if they were following your orders in the game, or so you say, it's kind of odd once you find out your mic was muted directly after you were banned. :P"},{"postId":13379,"topicId":1504,"posterId":408,"postTime":1293933890,"postText":"It wasn't muted after I was banned, It was after I took the dog out.  They were following my orders, and if they couldn't here me they would've said something.    Don't fucking post on the forums when you could talk to me in real life."},{"postId":14181,"topicId":1504,"posterId":249,"postTime":1294958870,"postText":"this has absolutely nothing to do with this post in particular, but the whole unban forum, i know some of the people on here knew what they did, but decided they would try and get lucky by saying \"i don't remember what i did\" and have an admin pity there situation and unban them, i know thats what i would do if id ever been banned."},{"postId":14184,"topicId":1504,"posterId":389,"postTime":1294960040,"postText":"You shouldnt be posting on old topics. This was about 2 weeks ago."},{"postId":14186,"topicId":1504,"posterId":249,"postTime":1294960445,"postText":"well its the newest topic relevant to my findings, and I'm surely not going to create a whole new topic."}]}