{"topicId":3887,"forumId":17,"topicTitle":"Shop Menu.....","topicTime":1314783849,"topicViews":162,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"remnants3","topicFirstPosterColor":"","topicLastPosterName":"remnants3","topicLastPosterColor":"","topicLastPostTime":1316633828,"posts":[{"postId":31528,"topicId":3887,"posterId":838,"postTime":1314783849,"postText":"  The Shop Menu  \nIt has been broken for me on JailBreak for months now! I bought a headcrab hat and a skull head.\nAfter that everytime I open the menu it is a blank dark grey box!\n\nThen on TTT I bought a skull head about 2 days ago, now I can only buy Gravity and Health upgrades as ALL OTHER TABS are gone as well!!\n\nOthers have this problem and it open occur's after buying something.\n\nPlease look into this.\nThanks.\nRemnants3."},{"postId":31559,"topicId":3887,"posterId":956,"postTime":1314824869,"postText":"Hp and Grav Are more important any wase just spend time getting those before and hats :l"},{"postId":31575,"topicId":3887,"posterId":798,"postTime":1314829256,"postText":"This has happened to me before, how long has it not been working (your shop)?"},{"postId":31582,"topicId":3887,"posterId":634,"postTime":1314830212,"postText":">> This has happened to me before, how long has it not been working (your shop)? >> months now! "},{"postId":31605,"topicId":3887,"posterId":605,"postTime":1314832941,"postText":"Ya, i've had the same happen in ttt from time to time\nhttp://steamcommunity.com/id/Udane/screenshot/577807044886742522?tab=public\nProblem is, when this occurs, i lost the ability to use my advanced disguiser ;~;"},{"postId":31629,"topicId":3887,"posterId":2,"postTime":1314845029,"postText":">> Ya, i've had the same happen in ttt from time to time\nhttp://steamcommunity.com/id/Udane/screenshot/577807044886742522?tab=public\nProblem is, when this occurs, i lost the ability to use my advanced disguiser ;~; \nRejoining should fix that. It seems to be a random bug.\n\nI'm not exactly sure what is causing the problem Remnants is having, though. Could you please screenshot it or post any errors you get in your console when this happens?"},{"postId":31728,"topicId":3887,"posterId":1016,"postTime":1314926139,"postText":"I know what you mean, I used to be able to access the shop, one day it glitched up on me and now i can't access it, thank goodness I was able to get all the grav upgrades before then. On TTT the shop works just fine, but jailbreak no. I did the whole reconnect to server, but it doesn't work, all I see is the info tab."},{"postId":31771,"topicId":3887,"posterId":801,"postTime":1314943768,"postText":"stratos, do you have a mac? apparently, because i have a mac. my shop doesn't work. :("},{"postId":33995,"topicId":3887,"posterId":838,"postTime":1316633828,"postText":"Udanes screen shot is exactly what I get!\nJailbreak = 100% the same as that.\nTTT = Only 1 tab, this also happened on jailbreak but eventually ended up with no tabs.\n\nObviously reconnecting wouldn't do anything after ages now, and i'm sure Udane reconnected before screening it.\nI believe that the server cant find out what ive already purchased or something like that because it only f''ed up after I bought items from it."}]}