{"topicId":1625,"forumId":19,"topicTitle":"SERVER DOWNTIME TO ADRESS ISSUES.","topicTime":1294800856,"topicViews":267,"topicReplies":17,"topicStatus":0,"topicFirstPosterName":"Pirate43","topicFirstPosterColor":"FF6600","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1294985963,"posts":[{"postId":14104,"topicId":1625,"posterId":456,"postTime":1294800856,"postText":"As you all know, the server will not stop crashing.\nI am taking a little bit of downtime to formally find an official fix for this issue.\n\nThis small amount of downtime will undoubtedly fix MANY things, and I will keep you all posted.\nFor now, please bear with me as i fix this horrible mess.\n\n NO  ALL ITEMS (NOT in your inventory) WILL BE LOST\n ALL CREATIONS AND HOMES WILL STILL BE THERE.  (sorry, map glitch turned out to be the culprit.)"},{"postId":14106,"topicId":1625,"posterId":464,"postTime":1294801404,"postText":"Specifically, we think the problem is a character placement glitch, as that's all we've found on the topic.\nIt's either that, or the lava waterfall and forest fire that was started up.\n\nIf you've been banned, don't take it personally. We're under some pretty heavy maintenance.\nYou'll be unbanned soon, we promise.\n\nIf you see that we're up, that you're not banned, and that no Mods are on, PLEASE log off.\nThen tell us you were able to get on, as it prolly shouldn't have happened.\n\nIf somebody IS on, we might be using you as a tester.\nTurn your render distance down to short, stay in sight, and don't do ANYTHING.\nEven breaking 1 dirt block, moving an inventory item, or un-chest-ing items, unless told to.\n\nThe fact is, we're still a new server, at around 8 days old.\nThanks for the patience while we patch this back up.\n\n--Tin. ;)"},{"postId":14107,"topicId":1625,"posterId":101,"postTime":1294802410,"postText":"I still want my 5 stacks of glass back :/"},{"postId":14108,"topicId":1625,"posterId":464,"postTime":1294803081,"postText":"If you guys can think of anything going wrong, we'd love to hear feedback.\n\n Error Details: \nServer is displaying Socket Error or Connection Lost- Timed Out messages.\n\n Symptoms of a crash: \nAfter the apparent crash-starter logs in, all others experience immediate lag. (No way to detect who the starter is.)\nDestroyed blocks respawn for around 30 seconds, nobody can type, then the player is booted with a Timed Out message.\nServer stays down for a good minute or two before restoring itself.\n\n\n Players who have crashed the server are: \nDomineeto, HumbleBrick, Brando, /possibly even me./\n(Not your fault, guys- you were just unlucky)\n\n Attempted fixes: \nResetting of playerdata, but restoring inventory. --Probably won't help, since the crash-starter changes.\n\n Future Attempts To Fix: \nTemporary removal of mobs\nTemporary player-caps\n\n Possible causes: \n\nPlayer position glitch (Working on this, seems like an easy fix. More info found here: http://www.minecraftforum.net/viewtopic.php?f=1013&t=97555\nServer overload (Probable. Fixed over time.)\nGlitched Map (RECOVERABLE! Don't worry. Unlikely)\nAdmins spawning items. (Worrying, and nigh impossible, but, there's a tiny chance.)\nA previously installed mod updated, and broke it. (Likely. Short time spent fixing it.)\n\n\nThanks for putting up with this. We're trying to fix it.\n\n--Tin ;)"},{"postId":14109,"topicId":1625,"posterId":464,"postTime":1294803174,"postText":"We got it back to you, Dum. \nWe'll give it back again, once this blows over."},{"postId":14111,"topicId":1625,"posterId":389,"postTime":1294804395,"postText":"Wooohoooo I got on for 10 secs :(\n\nI hope the problem doesnt lie within my river i made, I spent a good hour making it."},{"postId":14112,"topicId":1625,"posterId":464,"postTime":1294804893,"postText":"Update.\n\nWe thought HumbleBrick was the main problem, so we temp-banned him.\nWe got a biiit of backlash from that. \nDon't get offended, everyone's being looked at to see if they're the crash-starters.\n\nHowever, it then crashed immediately afterward.\nIt looks like we have multiple crash-starters. We're working on this.\n\nThe server could be down a while, guys.\nWe're not sure if this is a bandwidth problem, connection problem, or software problem.\n\nWe're working on it, and looking at a serious downtime.\n\n--Tin."},{"postId":14113,"topicId":1625,"posterId":464,"postTime":1294805320,"postText":"**Most recent status**\nWe're looking through the logs, and we're spending what would be our playing time tomorrow on the official MC forums asking for help.\n\nSo far, we know it's a pretty damn unique issue.\nPirate's computer is great, there are other servers running these same mod combos, and we aren't at a high player count.\nFinding a result for a specific user crashing a server, with the user changing, is hard.\n\nWho knows, maybe we'll get this to Notch himself, and our issue can make future releases stabler.\n\nPirate and I are off for the night. We're exhausted, what with this stupid piece of crap breaking.\n\nKryzoid might come on to address questions.\n\n--Tin."},{"postId":14120,"topicId":1625,"posterId":464,"postTime":1294815271,"postText":"WELP! Some of these errors I've seen are not good. Repairable, but definitely bad for the server.\n\nFor starters, do you guys see the MOTD? The message that comes up when you log in?\nThat's a common error.\n\nNext, the Backup Plugin is a bit borked. It's writing to the wrong filepath, which Pirate must've overlooked. This could explain some of your missing items.\nAlso, very common.\n\nWhile the server starts, there may be too many plugins, mods, and whatnot.\nNo errors on this, but I saw around 6 plugins.\n\nOn top of that, hey0 is retiring from Minecraft, and recommending a new servermod called Bukkit... which we can't access yet, but we're trying.\n\nWe have a MCForum post up here: http://www.minecraftforum.net/viewtopic.php?f=17&t=133482\nHopefully, we can get some support from there.\n\nI'm worth my salt in Java, but most of the errors it gives are gibberish to me.\nDepending on Pirate's opinion, and my ability to blanket-censor IPs, the logs could potentially be shared.\n\nI'm still reviewing the logs right now, and will be in the process of doing that for a while.\n\nKeep your cool, and it'll be up soon.\nP.S: Working on a signature tag 'cause you guys are being pretty patient.\n\n--Tin ;)"},{"postId":14121,"topicId":1625,"posterId":2,"postTime":1294817669,"postText":"Hopefully if I get minecraft the server will be up :P"},{"postId":14122,"topicId":1625,"posterId":456,"postTime":1294840133,"postText":"server should be up and running before, or during this weekend. that i'm sure of."},{"postId":14140,"topicId":1625,"posterId":464,"postTime":1294882340,"postText":"Hey, all.\n\nI've discussed with Pirate the possibility of him buying an external, entirely dedicated server.\nThis may fix the problem, if the problem is indeed a bandwidth overload.\nHowever, this might be a bit expensive to do.\n\nMeanwhile, a new look at the logs show nothing I didn't mention previously.\nPirate has said that most of the ones addressed here last time were not the cause of the crash, and are commonplace on any server.\n\nWe've tried every solution on the books that there is to be tried, and they just aren't working.\nGoogling the error, causes, and other tidbits in the logs isn't helping.\n\nIf you can get on the server, I would get on soon, and store all cobble, dirt, and building material.\n Carry your valuables with you. This means: Gems, ores, ingots, tools, glass, obsidian, etc. \nIt's unlikely, but the map could glitch even more than it has been. \nThe playerdata, or things in your inventory, will stay safe, no matter what. Things in chests are subject to risk.\n\nIn other news, the forum post for our server trouble is in my sig.\nNobody's responded yet, but we're all hoping that somebody does.\n\n  tl;dr: Progress made, no new developments, carry your valuables.   \n\n--Tin."},{"postId":14179,"topicId":1625,"posterId":456,"postTime":1294958693,"postText":"first post edited to reflect recent news.\n\nturns out, the map got glitched up. I found this out by trying to render the server map in a map viewer, and getting the same error that appears in the server itself.\n\nalso, with the new update, we will be starting a new map. I'm sure the majority of us can agree that the current map is kinda crappy, has no view, and isn't pretty.\n\nI am now going to run the server with access to select people on a whitelist. ONLY YOUR ITEMS IN YOUR INVENTORY WILL BE SPARED. IF YOU WANT TO KEEP YOUR ITEMS, PM ME ON FORUMS YOUR MINECRAFT ID, AND I WILL GIVE YOU ACCESS SO YOU CAN PUT YOUR VALUABLES IN YOUR INVENTORY SO YOU CAN USE THEM IN THE NEW MAP. CHESTS WILL NOT BE PRESERVED. Anticipated rerelease of Goldcraft 2.0 under the new update, run in a different server computer with the lag issue resolved, and no possibility of map glitchup ever again, will be friday night. \n\nThis weekend me, tinfoil, and kryzoid will all be building ourselves a new admin island. We anticipate a fully functional donation system with user ranks and priviledges, along with a networked warpation system using nether gates. Please bear with us, and know that if we are able to open up Goldcraft 2.0 sooner, we will."},{"postId":14182,"topicId":1625,"posterId":101,"postTime":1294959380,"postText":" http://images2.wikia.nocookie.net/__cb20070706034133/uncyclopedia/images/5/5c/TourettesGuy.jpg \n\n\nMY AWESOME HOUSE!!!!! D''=!!!!!"},{"postId":14183,"topicId":1625,"posterId":389,"postTime":1294959537,"postText":"Well, can you just give me 100 Wood Planks, 100 Cobblestone on the new server :D Thats all I basically need. :D"},{"postId":14188,"topicId":1625,"posterId":456,"postTime":1294961581,"postText":">>  http://images2.wikia.nocookie.net/__cb20070706034133/uncyclopedia/images/5/5c/TourettesGuy.jpg \n\n\nMY AWESOME HOUSE!!!!! D''=!!!!! \n\ni'm sorry, but if you want your diamonds, glass and whatnot to not be deleted i suggest you pm me on forums or steam so i can add you to whitelist and you put them in your inventory, otherwise they will be deleted.\n\n>> Well, can you just give me 100 Wood Planks, 100 Cobblestone on the new server :D Thats all I basically need. :D \nput what you want to keep in your inventory, nothing will be given, and everything NOT in your inventory will be lost."},{"postId":14190,"topicId":1625,"posterId":389,"postTime":1294962427,"postText":"I can't connect to the server :("},{"postId":14227,"topicId":1625,"posterId":4,"postTime":1294985963,"postText":"In between consistant bad news about the server and when it will be up again, i thought i'd share something a bit funny and cool with you guys.\n\nThis is what remains of Admin Island.\n\n http://i53.tinypic.com/2uen051.png \n\nThe Goldcraft Staff dun are got it good with tnt that they did"}]}