{"topicId":4878,"forumId":14,"topicTitle":"A chance or not?","topicTime":1321054584,"topicViews":66,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"FallenFlame","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1321237281,"posts":[{"postId":37725,"topicId":4878,"posterId":600,"postTime":1321054584,"postText":"Well I'm here again, no where to go, didn't feel like starting with a new community.\nAs you should all probably know, this is Flame. Hmmm my name I made when I couldn't log into the forums in past predicted that nearby future.\n\nI'll just ask for an unban, its completely reasonable to reject this. No hard feelings since I did ask to be perm banned when I left and I also probably blatantly rdmed several rounds to get that ban.\n\nSo I'm here to ask for a chance or not?\n\nWell then, thanks either way and have fun.\n\n*Edit*\n1) Which server: All probably? TTT is all i ever care about\n2) Your in-game name: Flame\n3) Your SteamID: No longer know\n4) When were you banned and for how long: Ban in August, forever\n5) Reason for ban: Read the above\n6) Who banned you: Quack\n7) Why should we unban you or shorten your ban period: Read the above\n\nAlright I just felt like I should do it properly, but apart from everything I had originally and this.\nIf I do receive this chance, I would like Quack to give his opinion on it before I get this chance. Since I do believe that I did the wrong thing and I prob shouldn't be forgiven.\n\n*End of Edit*\n\nFlame\nEx-member/admin/community member"},{"postId":37859,"topicId":4878,"posterId":115,"postTime":1321237281,"postText":"I'm not going to write a whole essay explaining why I should/shouldn't deny this. The timing on the ban is of course off, seeing as I banned you in what, march? That's a carried over ban. Sometime before the summer I know.\n\nAnyways, ill unban you. You probably shouldnt be forgiven. We all make mistakes though. Your punishment has been long enough. \n\nAccepted."}]}