{"topicId":1434,"forumId":36,"topicTitle":"That Guy's Application for Moderator","topicTime":1293518260,"topicViews":259,"topicReplies":10,"topicStatus":1,"topicFirstPosterName":"ʎnƃ ʇɐɥʇ","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1293681043,"posts":[{"postId":12829,"topicId":1434,"posterId":377,"postTime":1293518260,"postText":"1) What position are you applying for?    Moderator on the TTT server, I know Jail needs them more but ttt could use some too. \n2) How old are you? (if you prefer to say this in private, just ask): REDACTED\n\n3) Where do you live? (Country, time zone):  I live in the United States, Eastern Time Zone  \n4) Current In-Game Name:   ʎnƃ ʇɐɥʇ [ƃɾuu] If you can't see it it's [NNJG] That Guy, but upside down  \n5) Steam ID & Link to your Steam Community page:   http://steamcommunity.com/id/boriketheblackdragon I'm not exactly sure how to get my Steam Id but with that you should be able to find it I think \n6) Email Address:  REDACTED@REDACTED  \n7) How long have you been involved (frequent player, moderator, donator, admin) with [NNJG] or Shadow's TTT/Flood/Jail/ server:   I am a frequent player of TTT, about 80% of my Garry's Mod Play time has been to NNJG TTT and I'm on almost everyday.  I've been with NNJG TTT for a long time, I cant puyt an exact number on it so I'll give you this.  I remember when Gash was called Shadow for a while, remember the addition and removal of the Weapon Scanner, remember when the Jihad was removed from TTT, but NNJG brought it back, remember Roy the Ship, Remeber the contest Dum won when he was still normal player and he got Vip with red Name.  Hope this helps. \n8) What you can bring to the [NNJG] Team (Web/Graphic Design, Lua/other Coder, Moderation, Map Maker, ect.)    For a while now, I've been meaning to learn how to Code, since I want to code my Poison Cadaver myself, but mostly since I'm on the ttt all the time I can give Moderation.  School Days I'm usually on from 4-9, non-school days can be anywhere, I'm usually on my computer or desk and will be more than happy to deal with problem on ttt if someone messages me (Unless I'm really Busy which is rare)  \n9) Why do you want to be part of the [NNJG]Team?   NNJG is by far my Favorite Clan of Server's and I'd love to be a Bigger Part of it.  Also I feel that I see a lot of small occurrences of problems on ttt when im on, not big enough to bother Admins I know, but not small enough to Ignore.  I want to make ttt a funner place to play where people don't have to deal with rdmer's or trolls just cause there is no admins on \n10 ) Any GMOD/TF2/CSS experience:  Gmod and Tf2 yes, I'm usually on one or other, but will play some css from time to time.  I've been on Gmod for well over a year now and is well aware of the game ttt.  \n11) Have you ever owned a GMOD/TF2/CSS server?   No, I'm not good at actually making a server since im not a coder, but I can Moderate one \n12) Do you have a microphone? Do you frequently use it?  If it's not on the blitz, I always use my Mic so yes/yes \n13) Any other Comments or information you can provide:  I am aware that NNJG is currently not looking for ttt moderators, but If you have been looking at the forums, you can see people have been asking for some.  I have played NNJG TTT for a very long time, and is well aware of what is acceptable and what is not, what is slay-able and what is kill-able, and what is kick-able, and what is ban-able.  I've only been Karma Banned once after Kryzoid spawn C4 and I set it up for 10 minutes while some guy fail diffused with everybody watching.  The only rule I have a problem with is using hands to go where I'm probably not allowed to.  I really Hope you guys will accept me.  Thanks for taking the time to consider my application.   \nI got 11 recommendations just to be safe\n http://fc03.deviantart.net/fs70/i/2010/361/1/7/recomendations_for_ttt_moderat_by_boriketheblackdragon-d35txb7.jpg \nhttp://fc03.deviantart.net/fs70/i/2010/361/1/7/recomendations_for_ttt_moderat_by_boriketheblackdragon-d35txb7.jpg to be double sure.\nWell, that's it, Thank you for your time and best of luck to me I guess."},{"postId":12834,"topicId":1434,"posterId":54,"postTime":1293527550,"postText":"+support for sure\n\nGood player, follows the rules."},{"postId":12842,"topicId":1434,"posterId":112,"postTime":1293542628,"postText":"Two notes: To find your steamID go into any server and type status, find the line with your name.\nAnd \"Funner\" isn't a word. Trollface.jpeg"},{"postId":12849,"topicId":1434,"posterId":272,"postTime":1293561137,"postText":"His steamID is STEAM_0:1:20548627."},{"postId":12859,"topicId":1434,"posterId":377,"postTime":1293569212,"postText":"Found it, my steam ID is # 299 \"ʎnƃ ʇɐɥʇ [ƃɾuu]\" STEAM_0:1:20548627 09:17 108 0 active"},{"postId":12864,"topicId":1434,"posterId":101,"postTime":1293572905,"postText":"Since he forgot to put mine up does that still mean I keep a recommendation? ;D\n\n(Yes I did recommend him as well)"},{"postId":12868,"topicId":1434,"posterId":377,"postTime":1293573752,"postText":">> Since he forgot to put mine up does that still mean I keep a recommendation? ;D\n\n(Yes I did recommend him as well) \nI lost ur recomendation because someone told me the first day that f5 works in steam chat -_-\" so yours and 4 others were lost, i meant to have u re-recomend me but I got all recoendations i needed before u got on again"},{"postId":12913,"topicId":1434,"posterId":272,"postTime":1293614977,"postText":"+support, Good luck!"},{"postId":12923,"topicId":1434,"posterId":153,"postTime":1293632121,"postText":"I'll leave this one to Gash, but I say  yes ."},{"postId":12930,"topicId":1434,"posterId":4,"postTime":1293646963,"postText":"+support, extremely active and would be a great addition to the team"},{"postId":12995,"topicId":1434,"posterId":2,"postTime":1293681043,"postText":"4 Admins, 2 VIPs, a ton of regulars and Ben approves you,  plus  I always see you on the server. I'll say you're approved :) Welcome to the team."}]}