{"topicId":2142,"forumId":36,"topicTitle":"Mario's Jail admin application","topicTime":1300332189,"topicViews":198,"topicReplies":5,"topicStatus":1,"topicFirstPosterName":"MarioDJW","topicFirstPosterColor":"990000","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1300523779,"posts":[{"postId":17446,"topicId":2142,"posterId":372,"postTime":1300332189,"postText":"1) What position are you applying for? Administrator on the JailRP server\n\n2) How old are you? (if you prefer to say this in private, just ask): REDACTED\n\n3) Where do you live? (Country, time zone): US, Eastern\n\n4) Current In-Game Name: MairoDJW, \n\n5) Steam ID & Link to your Steam Community page: STEAM_0:0:21625962 , http://steamcommunity.com/id/mariodjw/\n\n6) Email Address: REDACTED@REDACTED\n\n7) How long have you been involved (frequent player, moderator, donator, admin) with [NNJG] or Shadow's TTT/Flood/Jail/ server: Since November 2010, Moderator of JailRP\n\n8) What you can bring to the [NNJG] Team (Web/Graphic Design, Lua/other Coder, Moderation, Map Maker, ect.)?: Administration in JailRP\n\n9) Why do you want to be part of the [NNJG]Team?: NNJG has a great servers with a good userbase, nice staff, and has welcomed me in.\n\n10 ) Any GMOD/TF2/CSS experience: Yes to all of them.\n\n11) Have you ever owned a GMOD/TF2/CSS server?: No\n\n12) Do you have a microphone? Do you frequently use it?: Yes, and about half of the time\n\n13) Any other Comments or information you can provide: I feel that many of the current Jail admins have moved on to TTT, and Jail could use an active administrator.  I still need a few recommendations and hope I might get the rest here.\n\n http://cloud.steampowered.com/ugc/540637121884874810/90E025367EAB94098BD5BC12245660B7DBD315EA/ \n\n http://i55.tinypic.com/2mh7gnq.jpg "},{"postId":17447,"topicId":2142,"posterId":2,"postTime":1300333786,"postText":"Personally I haven't seen him on the jail server --because I don't go on it-- but I still  support  this application because of the way he acts on the forums. He's friendly and seems like he would make a great addition to the Jail Administrative team."},{"postId":17449,"topicId":2142,"posterId":54,"postTime":1300335725,"postText":"I've seen you on the Jail server, you are polite and would make a great addition. I  support  this.\n\nGood luck, Mario :) (oh and you spelled your name wrong on the title xD)"},{"postId":17451,"topicId":2142,"posterId":372,"postTime":1300338459,"postText":"To Gash - I've only seen you on once.  It was when chat was broken, and you came in and typed on sentence and then left lol.\n\nTo Mark - Thanks for pointing that out, I would spell my name wrong."},{"postId":17484,"topicId":2142,"posterId":272,"postTime":1300478414,"postText":"I've been on Jail less than five times in total, but the times I was on, I have never seen Mario do a single thing wrong.\n +support "},{"postId":17515,"topicId":2142,"posterId":4,"postTime":1300523779,"postText":"Congratulations, you've been accepted for the position of Administrator on Jail!\n(Confirmed by Gash)"}]}