{"topicId":3648,"forumId":104,"topicTitle":"Saints Row 2","topicTime":1313464448,"topicViews":101,"topicReplies":4,"topicStatus":0,"topicFirstPosterName":"Quack","topicFirstPosterColor":"000099","topicLastPosterName":"Falcon","topicLastPosterColor":"","topicLastPostTime":1314670924,"posts":[{"postId":29548,"topicId":3648,"posterId":115,"postTime":1313464448,"postText":"Alright, so a few weeks ago I finally bought this (for some reason they were selling it for $5 at Gamestop). Played it over my friends house before, and it was pretty damn fun, so I figured I'd go buy it.\n\nJust some info on it, it is a third person shooter, it's graphics are definately on the better side. \n\nThis game  in a way  resembled Grand Theft Auto. With the whole free roam world, being in a gang, doing story missions, all that. It's more on the less serious side of gameplay, it's defininately a game I've had a few laughs playing. The models themselves are almost less realistic and more cartoonish, but mind you, it is still VERY realistic.\n\n http://xbox360media.ign.com/xbox360/image/article/851/851465/saints-row-2-20080212104500595_640w.jpg \n\nThe storyline wasn't half bad (I guess it also would've helped if I played the first Saints Row). I really don't want to spoil it, but you're the leader of the Saints, and you have been in a coma for a year. You spend most of your time doing missions retaking the city you're gang is in - Stillwater. You end up fighting rival gangs for the territory the Saints once had, and I thoroughly enjoyed every single mission, never once thinking \"ugh, I have to complete another stupid mission). You go from fighting asians, to fighting stoners, to fighting metalheads, to even fighting the cops in some missions.\n\n http://i214.photobucket.com/albums/cc88/emre-gs/01/732c320e.jpg \n\nThe best part I liked about it was the customization you get to do. Everything from customizing your cars, your guns, your clothes, and you're appearance, to customzing your gang and some more minor things.\n\nAnyways, I probably missed some things, but whatever."},{"postId":29634,"topicId":3648,"posterId":665,"postTime":1313540239,"postText":"I play this game with my friend Ronnie from school and we die laughing every time, from making pink golf carts with hydraulics or vehicle surfing on private jets, you can always laugh when you play this game."},{"postId":29685,"topicId":3648,"posterId":1001,"postTime":1313596418,"postText":"i honestly liked saints row 1 more then 2."},{"postId":30936,"topicId":3648,"posterId":693,"postTime":1314394785,"postText":"Saints Row 2 is easily one of my favorite games."},{"postId":31393,"topicId":3648,"posterId":956,"postTime":1314670924,"postText":"Saints Row 2 can be very enjoyable as long as you have a friend to play with and use cheats. :3"}]}