{"topicId":2632,"forumId":12,"topicTitle":"GHjail Copyright Please Read","topicTime":1304805667,"topicViews":97,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"n0valyfe","topicFirstPosterColor":"","topicLastPosterName":"n0valyfe","topicLastPosterColor":"","topicLastPostTime":1304847320,"posts":[{"postId":21106,"topicId":2632,"posterId":758,"postTime":1304805667,"postText":"Hello, I am the Co-Owner of an alternate community called GameHunters (GH). We have been thriving since 2008 with the success of this gamemode. A fellow community member stumbled across your server using our gamemode (GHjail). I understand that the owner of our community gave a fellow member of your community code snippets of some sort to help build a gamemode... however I would like to know where we stand with this gamemode. I am not a member of your community, I have signed up to ask about copyright and other things relating to the subject.\n\nFishcake created this gamemode back in summer 2008 (far as I know) and was used in our servers as a Jail RP. Since then it has died and has been passed around from person to person to revive it. I would like to ask that you place our name in the gamemode for help in development.\n\nIf you have any other question's on the subject please visit us at http://www.gamehunters.co.uk and contact me or Annonymousdonald on the website.\n\nThank's for your time,\nRegards n0valyfe and the GH community."},{"postId":21108,"topicId":2632,"posterId":2,"postTime":1304808007,"postText":"I've already contacted Anonymous Donald, and have said I will give credit to GameHunters in the next update. In fact it was a previous owner of GH that sent me the gamemode (Spike Wess).\nAnonymous Donald is the one who has given me permission to use code from the gamemode, that of which was given awhile ago. I've only used part of GHJail, the rest is GJail and other original code. As said before, credit will be given on the next update. \n\nThe thread listing all of my updates can be viewed here (Click) , and in the update that uses GHJail code, gives credit to Game Hunters, and also links to your website. I would also like to point out, the most noticeable thing that we used from GHJail, is the HUD. That will be removed eventually, and be replaced with an original HUD."},{"postId":21157,"topicId":2632,"posterId":758,"postTime":1304847320,"postText":">> I've already contacted Anonymous Donald, and have said I will give credit to GameHunters in the next update. In fact it was a previous owner of GH that sent me the gamemode (Spike Wess).\nAnonymous Donald is the one who has given me permission to use code from the gamemode, that of which was given awhile ago. I've only used part of GHJail, the rest is GJail and other original code. As said before, credit will be given on the next update. \n\nThe thread listing all of my updates can be viewed here (Click) , and in the update that uses GHJail code, gives credit to Game Hunters, and also links to your website. I would also like to point out, the most noticeable thing that we used from GHJail, is the HUD. That will be removed eventually, and be replaced with an original HUD. \n\nThankyou for informing me... it was never in Donald's right to give you permission to use GHjail code neither was it spikes but what's done is done. (spike was never an owner of GH), but thank's for putting us in for your next update, it really means a lot. If you need any help at all, along with your community members I'm happy to say GH is willing to help always.\n\nMany thanks, n0valyfe and The GameHunters Community"}]}