{"topicId":3765,"forumId":59,"topicTitle":"Matters to be considered while designing a website.","topicTime":1314181827,"topicViews":71,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"ethen53","topicFirstPosterColor":"","topicLastPosterName":"cappiman","topicLastPosterColor":"","topicLastPostTime":1314227109,"posts":[{"postId":30717,"topicId":3765,"posterId":1039,"postTime":1314181827,"postText":"There are numerous tools and techniques available today with which you can design a website.\nFor a person familiar with webpage coding, a simple HTML editor like a notepad is enough to perform the task. However, things have come far from HTML. Professional HTML editors like Adobe Dreamweaver CS3 are being used to design, code and develop websites, web pages and web applications. Dreamweaver provides you with helpful tools to enhance your web creation experience.\n \nYou don’t jump off and create a website once you have the tool. You need to have a plan for your website.\nThe first step in planning is to create a wireframe, which is a non-graphical representation of your site in the form of sketches. It gives the designer an idea on how to structure and design the website and what all features to include in the site. There are many factors which affect the rating of a website which a designer should keep in mind. A website should be search engine optimized (SEO), which means the keywords with which users search a particular topic should be present in the website as its content. This will increase the flow of traffic to your website, thereby increasing your income level.\n \nThere are numerous successful web design Los Angeles firms, and the major reason for their success is the passion and professional expertise with which they work for their clients. Some top firms in Los Angeles are ASP (affordableseopackages.com), Spinx Web design Company etc. They ensure that the sites they create are attractive, user-friendly and search engine optimized which directs more traffic into the site, thereby making it profitable. SEO approach requires a web design firm to fully understand their clients’ business and industry, thereby finding areas of opportunity which in turn helps them to successfully market the company using the top search engines."},{"postId":30722,"topicId":3765,"posterId":464,"postTime":1314196155,"postText":" http://angrywhitedude.com/wp-content/uploads2/2010/05/are-you-wizard.jpg "},{"postId":30730,"topicId":3765,"posterId":48,"postTime":1314207854,"postText":">> Are you a wizard? \n\nNo, he is not, however he may be a bot :P"},{"postId":30750,"topicId":3765,"posterId":754,"postTime":1314227109,"postText":"You should also add that it needs to be ADA compatible and W3C certified too. Just sayin'' :3"}]}