{"topicId":1547,"forumId":24,"topicTitle":"Lavich: Catalyst (this is why people don't like me :C . . .)","topicTime":1294112555,"topicViews":89,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Roan","topicFirstPosterColor":"","topicLastPosterName":"Roan","topicLastPosterColor":"","topicLastPostTime":1294408809,"posts":[{"postId":13553,"topicId":1547,"posterId":388,"postTime":1294112555,"postText":"Notice that this was written as an extra credit project so it's kind of not geared to an internet audience. Doesn't mean you won't understand it, but it's got a lot of foot notes and stuff like that because my teacher would be utterly confused if I didn't have those in there. They appear as unformatted numbers, just ignore them if you understand what's going. You will have to use a couple though . . .\n\nHere's MOST of the content from the email (not the actual paper), it's important so read it before you move on, if you're interested at all.\n\"So, in the future I want to make \"educational\" games.\nNot educational like, punch a guy by doing math (batman themed, no less). Child friendly or not, it's still not engaging nor actually educational to add up some random series of numbers between 1 and 14 to find out which lily-pad you have to make that stupid looking frog jump to next. In fact I'm pretty sure that method of teaching is on par with \"If you don't get it, do it again until you do\" education.\nI want to make games that teach the player something without being overbearing thematic junk that drills only half of the knowledge you need on the subject in hard while leaving you dry on the side.\nHere, I present to you my idea for an educational game that I think you, as my biology teacher, can get behind.\nBefore presenting that that though I did make a sort of guide as to what an educational game should be, and to an extent what it needs to accomplish, and that (I hope) will help you in understanding the reasoning behind the concepts and design of Catalyst.\"\n\nHere's the paper:\n Lavich: Catalyist \nWhat is this?\n    Catalyst is a spin-off game of a series called Lavich. Every proposed game in the series is intended to teach something to the player, and to improve upon (or at least attempt to capture the charm of) models from other videogames. The first game, a rhythm-RPG-danmaku-shooter1 simply named, though heavy with design and style, Lavich2, will teach the player about musical theory by syncing everything to the rhythm and melody, and balancing the game using the rules of musical theory (i.e. staccato notes = high damage, not as quickly spawned; rapido notes = low damage, quickly generated). Catalyst will teach the player about chemistry and physics in an engaging and interesting way3. It’s about a guy named Sam, a zombie more or less, but a zombie with sentience (unlike the zombies he has to deal with). He lives on one of many space stations orbiting a planet called Cyrius4. He’s been captured and is being used as a participant in a complicated series of tests for a “chemigun,” a weapon that fires chemicals in globby masses with the primary goal of such function being to fix, destroy, or simply interact with the environment. Of course, that’s just what the design docs made by the more peaceful scientists aboard the vessel, the only reason any prototype of the chemigun was ever produced was because of its possible uses on the battlefield6. Unfortunately, because of the often explosive nature of its elemental goop projectiles, no-one “living” is willing to test it. Sam volunteered to test it because he knew he (*probably*) wouldn’t die if he messed up once or twice, and because he could possibly use it to escape.\n    The first quarter of the game will consist of the player getting used to the chemigun, giving them a tactile physics experience of a basic series of 8 elements that I’m sure would be on their first quiz in a basic physics class. The next part of the game will throw in many more elements, a much easier to use chemigun interface7, and enemies that you’ll have to fight using your wits and knowledge of the elements. It won’t be as simple as acid + base = they die in a fiery explosion; you’ll have to plan out your caustic traps in advance. In the last half of the game, Sam escapes and reunites with his old friends, girl in tow. He plots with them, coming up with plans to destroy the science facility and anyone plotting to use the biological weapons8 created in there to gain an upper hand in the war9. The cool thing about this part of the game is that the difficulty (and learning!) ramps up, and the open ended nature of the levels becomes fully realized as you start augmenting Sam with scientific equipment, like boots that become saturated with whatever element you need (of course it has to be in a liquid state), that will help you do things like: fly from station to station by blowing yourself up (saturate boots with base, jump into a puddle of acid), create a defensive perimeter with C4 like charges that dispense bullet eating vapors on your command, replacing the phosphor in your body with sulfur so you gain mobility but lose some serious defensive prowess, and generally screw around for the heck of it because that’s how people learn, you know! The game also throws a curve ball at the players who only associated the names of the elements with their effects, instead of with their properties (and said effects), by taking away all of Sam’s elemental ammo and leaving him in a lab where you can only find a series of ‘fake’ elements with properties often close, and often vastly different from those of the real elements the player has been using and learning about. These elements will have realistic effects—though not technically possible with what the scientific community has access to today. These effects include: the creation of pools which will heal the player simply by standing above them and breathing in the vapors, and suits of armor created by covering yourself in 3 elements that result in a high density plastic substance (you could make footholds too!). I’d rather not spoil the end so that’s all I have to say on the subject.\n\nFoot notes:\n1.    A hybrid genre. Imagine a ton of multi-colored bullets flying all over the place, that’s a danmaku shooter. This is what a rhythm shooter, a game where all the bullets are synced to the music, looks like:\nhttp://www.youtube.com/watch?v=CaXAZRbJhcQ\nNow imagine, every time you get hit by a bullet, you don’t necessarily die, they do damage to you rather than just killing you and removing one of your lives; then imagine that if you win several encounters with enemies, you gain “experience,” and if you get enough, you “level up” and get new abilities, and better stats (you can take more damage before dying, you deal more damage). Those are the RPG elements.\n2.    Lavich is pseudo Latin for “The Dead.” If you believe that’s incorrect, good, because it is and you’ll find out why I say that it is correct when you play the game if it ever comes out.\n3.    Namely, by employing puzzle solving elements like blowing yourself up.\n4.    This is a little too complicated to explain right now. Cyrius is a small planet undetected by any astronomy equipment available to humanity’s major science fronts back when most of the human race was still on Earth. Humanity was confronted by an alien race we came to call Reapers. They eat the dead, but not in the same way we do. They have a religious (and deeply evolutionary5) reason for not eating anything they killed. Unfortunately, there isn’t a constant rate of innocent deaths among dominant races on other planets, so they have to incite wars and such among various races to get a steady food supply5+. They offered, to the humans with the resources necessary, passage for 10,000 people to “a planet of infinite wealth, and constant power”, at the price of a nuclear war that would kill off more than 2/3rds of Earth’s population so the reaper’s would have a surplus for next 200 years (preservation of food (feels disgusting to say that here) = perfected)\n5.    Reapers, unlike humans in their current evolutionary state, have open brains; specifically in regards to spiritual movement (imagine spirits/souls as some radiation like presence that they are naturally susceptible to cancer-like inception of thoughts from). When they kill something sentient intentionally and with the intent to eat it, there is a sentiment in the soul of the prey that makes reapers go mad upon consumption. (footnotes within footnotes within footnotes)\n6.    This company is fighting that company for control of resources blah blah blah.\n7.    The periodic table of elements, simplified and small at first but as you near the full table it will certainly make learning the elements and their basic properties easier for the distraction inclined.\n8.    Hint: they created the zombies in the first place, but that would be obvious long before the game tells you so it’s not much of a spoiler. However, they’ve got a lot more secrets in that facility . . .\n9.    Note: This game will tie in with the second Lavich game, Belli/Krieg. In this game, the player learns about politics. Namely, they learn how to build a government that people can trust, while destroying one that promotes war for profit. Why should you note this for that single detail mention in the second paragraph? Well, a war metagame10 starts in the middle and ends near the last quarter, however during it you can choose, when Sam shows up, whether to help him take down the facility, or let him do it on his own (what kind of jerk would do that? >:C). You can also, as one of the “I just want to win this war, no questions asked” paths you take to beat the game, you can do either of those things and take the secret bio weapons for yourself instead of letting Sam destroy them. Sam rebels against you for doing so, and you can claim he was a traitor to your cause and toss him in jail, OR throw him into deep space . . .  :O\n10.    A metagame is like a game within a game. For example, there are metagames, interactive puzzles and “minigames” in Professor Layton.\n\n\n(people hate me because I look really goddamn cocky and full of myself when I say this is an idea for a game in a series, especially one that hasn't even gotten a single title (because I haven't even started working on that one). It's sort of a \"As if that dumbass is ever going to accomplish anything on par with making a videogame of any sort, especially after all the stuff he's claimed he'd do and reclaimed within the next day.\")\n( . . . :( . . . )"},{"postId":13556,"topicId":1547,"posterId":54,"postTime":1294116028,"postText":"I will write this out, as you did shown\n\nToo long, did not read."},{"postId":13563,"topicId":1547,"posterId":82,"postTime":1294126566,"postText":"That is an awesome idea."},{"postId":13578,"topicId":1547,"posterId":389,"postTime":1294161308,"postText":"I read half of that shiz. Interesting, yet out of my understanding.\n\nThats one reason i never took science courses."},{"postId":13612,"topicId":1547,"posterId":84,"postTime":1294205998,"postText":"That game series sounds very interesting dude. I do hope that it goes well if you do decide to create it."},{"postId":13655,"topicId":1547,"posterId":67,"postTime":1294267820,"postText":"Would radioactivity of certain elements come into effect or no because of the fact that he is a zombie?\nUnstable elements / isotopes?"},{"postId":13793,"topicId":1547,"posterId":388,"postTime":1294408809,"postText":">> Would radioactivity of certain elements come into effect or no because of the fact that he is a zombie?\nUnstable elements / isotopes? \nOf course they would! Just not so much for the protagonist, seeing as cancer kin of doesn't matter when you're skin is burnt off every couple of minutes."}]}