{"topicId":2599,"forumId":22,"topicTitle":"Remove Advanced Disguiser","topicTime":1304550498,"topicViews":257,"topicReplies":22,"topicStatus":0,"topicFirstPosterName":"Joshua","topicFirstPosterColor":"","topicLastPosterName":"__Crisis","topicLastPosterColor":"","topicLastPostTime":1304886143,"posts":[{"postId":20786,"topicId":2599,"posterId":744,"postTime":1304550498,"postText":"Absolutely imbalanced for the obvious reasons. Removes the need to be stealthy. Renders last words entirely useless. Validates RDMing and makes false accusations entirely too easy. You can literally get an advanced disguiser and a teleporter, disguise, teleport infront of everyone, and get that person killed.\n\nThe only reasonable argument I can see in defense of this is the difficulty of procuring one, but if we extend this philosophy far enough, a button to instantly win costing 100,000 points would be justified because of how hard it would be to get. This obviously is not valid."},{"postId":20787,"topicId":2599,"posterId":521,"postTime":1304550688,"postText":"NO.\n\nNO NO NO NO NO.\n\n\nJust no. Just because you do not have it doesn't give you the right to complain about it.\n\nIts 1k points for a reason."},{"postId":20789,"topicId":2599,"posterId":112,"postTime":1304550778,"postText":">> NO.\n\nNO NO NO NO NO.\n\n\nJust no. Just because you do not have it doesn't give you the right to complain about it.\n\nIts 1k points for a reason. \n\n>> The only reasonable argument I can see in defense of this is the difficulty of procuring one, but if we extend this philosophy far enough, a button to instantly win costing 100,000 points would be justified because of how hard it would be to get. This obviously is not valid. \n\nYou didn't even read his post.\nOr dispute any of his reasoning."},{"postId":20790,"topicId":2599,"posterId":744,"postTime":1304550810,"postText":">> NO.\n\nNO NO NO NO NO.\n\n\nJust no. Just because you do not have it doesn't give you the right to complain about it.\n\nIts 1k points for a reason. \nHow is it possible to be so retarded? Did you even read my first post?\n\nI don't care how fun you think it is, it's bullshit. The fact it's also exclusive is equally bullshit and if it was some donator only crap I wouldn't even play on the server at all."},{"postId":20793,"topicId":2599,"posterId":272,"postTime":1304551648,"postText":"nope.avi"},{"postId":20796,"topicId":2599,"posterId":521,"postTime":1304552161,"postText":">> >> NO.\n\nNO NO NO NO NO.\n\n\nJust no. Just because you do not have it doesn't give you the right to complain about it.\n\nIts 1k points for a reason. \nHow is it possible to be so retarded? Did you even read my first post?\n\nI don't care how fun you think it is, it's bullshit. The fact it's also exclusive is equally bullshit and if it was some donator only crap I wouldn't even play on the server at all. \nIt is not exclusive, you get the points you get the item. People whine all the time about this, its completely fair for 1k points. If you don't like it, id suggest leaving."},{"postId":20797,"topicId":2599,"posterId":744,"postTime":1304552329,"postText":"Luckily only a few people use it, but it is entirely unbalanced and you know it -- the difference is you have it and fairness goes to the wayside of you having bloated killcounts at the end of your T rounds."},{"postId":20800,"topicId":2599,"posterId":521,"postTime":1304552453,"postText":">> Luckily only a few people use it, but it is entirely unbalanced and you know it -- the difference is you have it and fairness goes to the wayside of you having bloated killcounts at the end of your T rounds. \n\nThats the fucking point, traitors are outnumbered 1 to 4, they need shit like this. It is not unbalanced AT ALL."},{"postId":20801,"topicId":2599,"posterId":595,"postTime":1304552630,"postText":"Joshua : TL/DR... Jk.\nMZP : Bro did you read his post? \nBack to Joshua : It is 1:4 in traitors to innos, dont like the disguiser? There are tons of countermeasures. If last words are on someone it states \"Someone in disguise is a traitor!\""},{"postId":20808,"topicId":2599,"posterId":112,"postTime":1304553014,"postText":"Don't post unless you have something constructive to say.\nBlankquoting is against the forum rules Balenti. You should probally read them."},{"postId":20810,"topicId":2599,"posterId":115,"postTime":1304553160,"postText":"Nawp."},{"postId":20818,"topicId":2599,"posterId":373,"postTime":1304553842,"postText":"Tch.  You're saying it's OP because people that have it get a kill count of 5-7 right? Well, that's the reason they have the disguiser in the first place. They don't rdm, and they know how to play the game.  I think of the pointshop as a bit of a \"Rewards\" kind of thing for the community/players that have stuck with us long enough to obtain the Adv Disguiser! who are YOU to deny the players what they've earned?"},{"postId":20820,"topicId":2599,"posterId":521,"postTime":1304554033,"postText":">> Tch.  You're saying it's OP because people that have it get a kill count of 5-7 right? Well, that's the reason they have the disguiser in the first place. They don't rdm, and they know how to play the game.  I think of the pointshop as a bit of a \"Rewards\" kind of thing for the community/players that have stuck with us long enough to obtain the Adv Disguiser! who are YOU to deny the players what they've earned? \n\nMy point exactly. I earned my 1k points for that disguiser, and just because some whiner got on and complained about his opinion of it being \"OP\". Overpowered? Theres 1 traitor for every 4 people. Get out."},{"postId":20833,"topicId":2599,"posterId":744,"postTime":1304560135,"postText":"My friend and I were on last night and got 11 kills each without a single Traitor Buddy getting a kill. The advanced disguiser is not required for massive killstreaks.\n\n  I am not for the removal of the STANDARD DISGUISER, I am for the removal of the ADVANCED DISGUISER.  \n\nBeing able to remove your name and go about discretely while being an obvious bullet magnet if caught red handed is ENTIRELY different from being both undercover and, at the same time, framing another person.\n\nThere is no drawback to this upgrade. None what so ever. The cloaker eats at your health, and even then that's only for a partial transparency. The advanced disguiser lets you run a muck freely under another alias completely scotch free.  There is no downside , and even if there were, you would not be able to fairly contrast the two. The damage done by being able to commit any crime with only DNA and firearms able to slow you down cannot be correctly counterbalanced by any sort of downside.\n\nIt's unfair. It defeats almost all defenses the innocents have to get a leg up. There is no hard counter. You can't beat it unless you catch the person committing the act and kill him before he can get away and get another innocent killed."},{"postId":20836,"topicId":2599,"posterId":634,"postTime":1304561335,"postText":"The server doesn't need to adopt the the players, the players need to adopt to the server.instead of instantly kos'ing someone who teleports throw in \"but it could have been someone in an adv disguiser\" at the end of your sentence. Problem solved.                                  • edit: why not petition the addition of a detective item that checks disguises quickly and easily instead of the removal of an nnjg store item that Many people have dropped 1000 points on?"},{"postId":20840,"topicId":2599,"posterId":389,"postTime":1304561664,"postText":">> My friend and I were on last night and got 11 kills each without a single Traitor Buddy getting a kill. The advanced disguiser is not required for massive killstreaks.\n\n  I am not for the removal of the STANDARD DISGUISER, I am for the removal of the ADVANCED DISGUISER.  \n \n\nOkay firstly. Thats just impossible. Please use actually facts. If this is our server NNJG. We have a maximum of 22 players. of which full house there will be 5 traitors.\n\nSooo... yeah... that statement there is invalid.\n\n2. Your statement in red.... alright... all I have to say is... your a complete utter faggot. \nJust because some people have the advanced disguiser doesnt mean that everyone has it. Thus is easy to figure out whose the traitor. (This is beyond what my head can comprehend thus it might not make sense to his statement in red.)\n\nThen I just feel bad right now... i feel disrespected and i feel that i should be disrespectful.\n.................. ummmmm... Okay.....\n\n\nThe drawback to this upgrade is... sometimes there a people you cannot become and also only a few people have it (a few as in regulars should have it)\nPlease don't compare the advanced disguiser with the cloaker.... they both do completely opposite things, and cloaker is available to every player whether they inno / traitor / detective.\n-----------------------------------------------------------------------------------\n\nI still feel pissed off by his response... hmmm.. So dont give this bullshit. I bet if you had it, you wouldn't bother complaining about this right now. \n\nAm I right? 0.9 probability the answer is yes and 0.5 probabily is no. o wait wheres the other 0.5, o its for uncertain\n\nJust gonna say this now. If I ever see you in game. I'm gonna change my name to yours and kill people with it."},{"postId":20860,"topicId":2599,"posterId":521,"postTime":1304593074,"postText":"Yeah, im going to disguise as the OP and go on a HUGE rampage. This guy doesn't seem to get that there are 17 more innos than traitors when the servers full."},{"postId":20873,"topicId":2599,"posterId":364,"postTime":1304607401,"postText":">> Absolutely imbalanced for the obvious reasons. \n\nWell since every one is raging I guess I will offer up an argument. This will be long so feel free to skim.\n\nThe Advanced Disguiser is OP, in the regard that if used properly it can get a shit ton kills. But then again, that's true of any weapon.  Deagle, Mac10, TMP, Shotgun, Knife, and even teleporter. If you use your equipment right then getting more then one kill is insured. So, Lets start...\n\n>> Removes the need to be stealthy. \n\nMany people announce themselves as traitor all the time. Ok, it's pretty much joking around at the start of the round, but it helps take off suspicion. Calling your self out means you don't have to wait for perfect opportunities. Just load up you gun and kill everyone you see. As well It takes all suspicion off your traitor buddies... If everyone is looking for me, who had openly gunned down a detective. Then they wont notice if you take out someone when there busy looking for me. There is more than one tactic... like teamwork. I take one for the team all the time... but then again, I suck... so... ya.\n\n>> Renders last words entirely useless. Validates RDMing and makes false accusations entirely too easy. \n\nTo that I will counter with that last words already validates RDMing and makes false accusations entirely too easy. Here is my argument. 1 in 3 women WILL get breast cancer... A sad fact, but true. In this regard, you could say 1 in 3 women will get breast cancer from an abortion. With which it true considering 1 in 3 women will get Brest Cancer anyway... But using something that already gets people RDMed to clam that another thing within that situation is getting people killed is... Unethical.\n\nTons of people type someones name if they are with someone who they think is a traitor. \n- People will go afk, but put in the name of a person next to them in case that person kills them. = RDM\n- They put in the name of someone... but don't take if off when person leaves... or don't to it quickly. = RDM\n- Putting in the name of a traitor your with... but get killed by another traitor behind you. Getting the wrong traitor killed. = RDM\n\nLast words already get people RDMed. So to say that the teleporter is the reason, again I say, unethical.\n\n>> It's unfair. It defeats almost all defenses the innocents have to get a leg up. There is no hard counter. You can't beat it unless you catch the person committing the act and kill him before he can get away and get another innocent killed. \n\nI'd say your wrong there. Lets say someone yells out... Alive check when your undercover. They see the name of the person you are. So he is marked as alive, what good that dose you? But wait, where are you? You can't just yell out, \"I'm alive, look, I'm right here!\" because it has one BIG drawback... The fact that you can't talk as the other person... If you say something as Flame... its still going to show your name. which means all a person has to say is, \"Speak?\" and your as good as dead. The can even be sly about it, and ask you a question or enter in a conversation. Which means you can't cover yourself as someone who is known to talk alot and/or known to have a mic.\n\n>> The advanced disguiser is not required for massive killstreaks. \nHere you infer that the Advanced disguiser Will get you massive kills. You even go about telling us how.\n>>  You can literally get an advanced disguiser and a teleporter, disguise, teleport infront of everyone, and get that person killed.  \n\nOne, it costs a lot... Which means you pretty much know everyone who has it. And better yet, who's good with it. But rarely will the situation you talked about ever really work. One, if someone sees you teleporting... you can get easily killed... Hell of a risk. Second the pay off will rarely work. You have to count on the fact that the person you teleported as is far from the people your with and was alone at the time... Third... even then, it wont create \"Mass RDM\" The only way to really create mass RDM is to disguise yourself as a person and kill several people in front of 2 or 3 others... which means your going to have to run like hell to get away from a 2 or 3 person kill. This way they will gun down the person you disguised as, NO MATTER WHAT THEY ARE DOING. Why was that all in caps? The fucking MetaStick is why... That prop pushing shit stick proves more people inno then all the traitor kills combined.\n\nExample: I disguise as Flame and teleport in front of 3 or 4, maybe even 5ive people. They go looking for him, and find him! Pushing props with the MetaStick. AND THEY ALL JUST STOP. I have incited inter mobs added with some disguise work to seal the deal... and a metastick shits on the work... because they just look at an innocent doing the most innocent thing they could do... PLAYING WITH PROPS. Kill every person you see openly and be called out by BOTH detectives. And when you get cornered... take out a fucking MetaStick, and start pushing some props... CLEAN GETAWAY! YOU KNOW WHATS REALLY OP!? THE GOD DAME METASTICK!!! People know there is an advanced disguiser... if they see something that might be counter to what a traitor might act like when called out... they freeze up and let them pass, with suspicion. But they let them pass none-the-less.\n\nThis is why I think it's not all that over powered of a weapon... Plus the cloaker was made to have you loose health because anyone can use it. AFKs are easy traitor bait... if you didn't loose health... then you could just hide for as long as you want staking out the AFK until they are killed by a traitor. That and not everyone buys a locater. So you could end up prolonging the round if you find a nice place to hide in.\n\nHope this sums up are view of why people at NNJG feel that the Advanced Disguiser is not nearly OP as you say it is."},{"postId":20885,"topicId":2599,"posterId":377,"postTime":1304627097,"postText":"All the Upgrades do create an imbalance, that's the nature of upgrades, some people have certain raised abilities while others do not.  The Adv Disguiser Has plenty of weaknesses in it, YOU JUST GOTTA BE SMART ENOUGH TO EXPLOIT THEM.  Plus, not everyone who has Adv Disguiser will become Jesus in the Game, It requires intelligence to use, like Disguising as a guy who never talks or is MIA in a Pit rather than disguising as Detective and Going \"Herp Im Detective let me go Leeroy Jenkins on your ass is Grass DERP!!!!!\"\nPlus If the traitor is KOS you mark them as KILL on tab menu and u will see it through disguise so No OVERPOWER"},{"postId":20887,"topicId":2599,"posterId":521,"postTime":1304628042,"postText":">>  You can literally get an advanced disguiser and a teleporter, disguise, teleport infront of everyone, and get that person killed.  \n\nThis is the best idea ever. I will be sure to use it when OP is on. Heh."},{"postId":20891,"topicId":2599,"posterId":488,"postTime":1304630757,"postText":"I see what Joshua is saying, and he has a sound argument. He's saying that the advanced disguiser will cause innocent players to kill innocent players. I disagree with him, though. The innocents should still check to make sure that person isn't a traitor disguised as that person. That's why people will tell people to jump, crouch, or press their mic button down. To get confirmation that it isn't someone disguised."},{"postId":21079,"topicId":2599,"posterId":397,"postTime":1304772591,"postText":"i like how he stop defending can suggestions pages be locked or is it considered a spam page"},{"postId":21208,"topicId":2599,"posterId":79,"postTime":1304886143,"postText":"Id just like to point out 1 thing Yoshi. If someone gets called out for a reason i dont stop till there dead :). So your magneto stick is no match for my gun."}]}