{"topicId":2512,"forumId":122,"topicTitle":"Stating smooglez's case but not unban","topicTime":1304113355,"topicViews":63,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"SMOOGLY","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1304116886,"posts":[{"postId":20047,"topicId":2512,"posterId":397,"postTime":1304113355,"postText":"very important that everyone should know that im not wanting unban, i will take the punishment\nlets start with the first explanation of crisis and work my way through the rest.\nCrisis's quote \nHe said he was gonna rdm me several times.  He crowbarred me on several occasions  in which i killed him after he hit me twice. Few rounds he just started aimlessly shooting me, one of which he was detective and of course i killed him for doing so. (took me to 20 some hp when he was detective)\n\ni like your idea of one crobar incident with 2 hits, as several occasions then asking that guy to ban me on the spot. \nprobably not the best way to deal with a whiny little drama queen that complains all the time when things dont go his way. like croey incident and wanting ROSE to be slayed because she used logic, come on really.\n\n kobooold you are correct in stating ive done this before\n\nnow for the good part \nanother crisis quote\n\nTo be honest i think it should be perma.  Overall he is disrespecting everyone  and just shouting how no one would dare ban him for longer. He knows what he's doing is not allowed and does it anyway. He purposely said he was gonna rdm me a few rounds and even said that he would only get banned for 1-2 weeks. It seems he doesn't care about his attitude and will continue doing it when he gets back. Lot of people dislike him and he's already said many times that he's a troll. With the evidence provided the ban should be perma. If not perma, anything less then a few months of ban is way too lenient, even that is lenient in my opinion for how much disrespect and proof there is against him.\n\nwow really i mean clearly no one agrees with this\n1. the only person i disrespect is you so far\n2. you are the first person that wasn't a troll that i rdmed \n3. on countless accounts with out you around, i have support from norple and overclocking when 3 trols were on and no admins were on. of course i rdmed them so that the rest of the server could play peacefully. finally over came on and permabanned the leader and the others left\n4. through these accounts i have brought this community a better gaming experience while sacrificing my time riding innocent players of trolling. \n\ni dont want an unban but just stating my case so that i am rendering the completely irrational thinking of crisis.\nany further comments i would love to see so i can further state my case"},{"postId":20054,"topicId":2512,"posterId":2,"postTime":1304116886,"postText":"No one cares about the e-drama. Keep it to PMs."}]}