{"topicId":3823,"forumId":22,"topicTitle":"Ideas for traitor weapons!","topicTime":1314513675,"topicViews":229,"topicReplies":18,"topicStatus":0,"topicFirstPosterName":"XUnnamedX","topicFirstPosterColor":"","topicLastPosterName":"binlaninja","topicLastPosterColor":"","topicLastPostTime":1317529525,"posts":[{"postId":31102,"topicId":3823,"posterId":948,"postTime":1314513675,"postText":"1. The Iron Cleats. (As seen in the Muslim's something something server!)  Passive item, infinite use, no fall damage, goomba stomp insta kills!  Great for escapes and kills from above.\n\n2. The Scrambler. (As seen in my brain!) Active item, infinite? use, disrupts both voice chat and text chat either making it unheard to all or just static (maybe unheard to all but those who are nearby, nearby hear static?).  Either make it shoot a person and they cannont chat for 15 seconds, HOLD the button on a person so that your team mate can quietly kill them (Yay, it promotes teamwork!), or hold the button and all nearby communication is disabled.\n\n3. Wire. (Me.) Active item, 2 or 3 uses, silently kill (like with the knife) but only from behind.  Wire breaks after 2 or 3 uses.\n\n4. DNA Splitter. (Me.) Active item, ? uses, use on a body with DNA to add another person's DNA onto the body. (The killer's DNA does not disappear, the detective sees two icons.)\n\n5. Flashbang. (Me.) Active item, 1 use, throw a flashbang from CS:S, flashes anyone in the area, looks like an incendiary grenade and takes 1/2 the time to go off as an incendiary. (So it isn't OP)\n\n6. P228 Pistol. (Me.) Active item, The P228 pistol from CS:S, acts like a Deagle, but is more accurate and holds 12 rounds.\n\nTell me what you like or think should be changed in these ideas, and show me your own.  Thanks."},{"postId":31105,"topicId":3823,"posterId":101,"postTime":1314515562,"postText":"1. Good \"idea\"\n2. This has been recommended before, and I think we decided that it's not possible.\n3. Why not just use the knife?\n4. Great idea.\n5. Pointless IMO\n6. Pointless."},{"postId":31109,"topicId":3823,"posterId":735,"postTime":1314518377,"postText":"1. Good\n2. What dum said\n3. just another knife basically, no need\n4. I Would like that idea.\n5. Not worth it as a traitor weapon\n6. Just use the silenced pistol"},{"postId":31140,"topicId":3823,"posterId":948,"postTime":1314556013,"postText":"The thing about the wire is that you get multiple uses out of it.  So its harder to use, but its not a one time thing.  The flash would make it easy to flash a group of people and kill at least one or two of them. (Chances are high that they will shoot each other, as well.)  The P228 was just something that popped in my head.  The scrambler is impossible?  Thats sad.  And yes, I was very proud of my DNA Splitter idea!  Its just enough of a counter-DNA to be extremely helpful, since I'm sure that 50,000 people have suggested something that REMOVES DNA. (Very boring and OP.)  I'll try to think up some more ideas."},{"postId":31142,"topicId":3823,"posterId":735,"postTime":1314556744,"postText":">> The thing about the wire is that you get multiple uses out of it.  So its harder to use, but its not a one time thing.  \nI dont see how its harder to use, most knives are used from behind."},{"postId":31143,"topicId":3823,"posterId":292,"postTime":1314556914,"postText":">> I dont see how its harder to use, most knives are used from behind. \n\nThats not entirely true, I stab my victim in the face just as much as in the back."},{"postId":31151,"topicId":3823,"posterId":735,"postTime":1314558256,"postText":">> Thats not entirely true, I stab my victim in the face just as much as in the back. \nTrue, but it would just be another knife/betrayal and its overpowered."},{"postId":31153,"topicId":3823,"posterId":948,"postTime":1314558556,"postText":"Well, not only do you have to use it from behind (not the front, not even the side, you have to be right behind them...  Most of my knife kills are front or side.) but it isn't instant.  You have to be choking them for a couple seconds (Perhaps it deals 20 damage/second?) and are very vulnerable to anyone who happens to walk in at the wrong moment.  2 uses should probably be the limit."},{"postId":31154,"topicId":3823,"posterId":735,"postTime":1314558743,"postText":">> Well, not only do you have to use it from behind (not the front, not even the side, you have to be right behind them...  Most of my knife kills are front or side.) but it isn't instant.  You have to be choking them for a couple seconds (Perhaps it deals 20 damage/second?) and are very vulnerable to anyone who happens to walk in at the wrong moment.  2 uses should probably be the limit. \nToo difficult for that, crowbar can probably kill him/her faster"},{"postId":31156,"topicId":3823,"posterId":948,"postTime":1314558999,"postText":"Well, they can't do anything.  You're being choked out, you can only survive if someone kills the traitor who is killing you.  If no one happens to be nearby, its a great stealthy kill...  But anyways, lets get that DNA Splitter in the game!"},{"postId":31167,"topicId":3823,"posterId":634,"postTime":1314560669,"postText":"2 instant kill weapons is enough in my opinion.\n\nOther than that, I concur with Dum's original post,"},{"postId":31202,"topicId":3823,"posterId":605,"postTime":1314570446,"postText":">> 1. Good \"idea\"\n2. This has been recommended before, and I think we decided that it's not possible.\n3. Why not just use the knife?\n4. Great idea.\n5. Pointless IMO\n6. Pointless. \nGeneraly conveys my feelings... we dont need another instant kill weapons, and a smoke grenade does a good job instead of a flash bang if you know how to use it.\nAlso #2 would prob just end up only annoying people if it was possible.\n\nWhile we are on the subject\nA weapon that allows you to fake your own death, if someone checks your body, it shows that you died by suicide. 30-40 seconds later, you stand back up right where you your current ragdoll is at."},{"postId":31217,"topicId":3823,"posterId":1,"postTime":1314575205,"postText":"What about poison darts? I've seen those on other servers. It's not an instant kill.\n\nwhat about grenade launchers like a law? Would work like a jihad, but more silent."},{"postId":31238,"topicId":3823,"posterId":636,"postTime":1314582319,"postText":"I like 1,4, and 5"},{"postId":31273,"topicId":3823,"posterId":948,"postTime":1314593449,"postText":"Oh, how about bug bait you throw on bodies that turns them into zombies?  :D  Not super useful, but fun.  Throwing it on other players covers their screen and attracts the zombies."},{"postId":31309,"topicId":3823,"posterId":272,"postTime":1314654328,"postText":"The only one I like is 4."},{"postId":31674,"topicId":3823,"posterId":364,"postTime":1314891300,"postText":">> Oh, how about bug bait you throw on bodies that turns them into zombies?  :D  Not super useful, but fun.  Throwing it on other players covers their screen and attracts the zombies. \n\n^.^ Agreed"},{"postId":32083,"topicId":3823,"posterId":968,"postTime":1315158814,"postText":">> >> I dont see how its harder to use, most knives are used from behind. \n\nThats not entirely true, I stab my victim in the face just as much as in the back. \n\nI know what you mean... :| hes right he does it all the time"},{"postId":34674,"topicId":3823,"posterId":1097,"postTime":1317529525,"postText":"#2, I'm not advertise, but Slag has made this\nalso, I saw from that server that they have weapons that allow you to create fake body"}]}