{"topicId":2278,"forumId":59,"topicTitle":"hl2.exe","topicTime":1301793475,"topicViews":154,"topicReplies":7,"topicStatus":1,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"2swat","topicLastPosterColor":"","topicLastPostTime":1301865315,"posts":[{"postId":18308,"topicId":2278,"posterId":4,"postTime":1301793475,"postText":"When i try to run any game that uses hl2.exe, after Steam displays the window \"Preparing to launch <game>\" and disappears, my mouse cursor displays the loading thing, and then nothing new appears on my screen. But upon opening task manager, it shows that i'm running hl2.exe and Steam says i'm playing the game.\n\nIt's worked fine until today and i have not recently installed anything.\nHelp?\n\nI have already Verified Integrity, Defragmented Cache, deleted ClientRegistry.blob, Reinstalled Steam, Reinstalled Garry's Mod, Restarted Computer, Used Launch Options, Turned on Game Mode for Antivirus, Disabled Anti-virus, Virus Scan Computer, Ran CCleaner, System Restored, and other things. Still not working.\n\n50 TTT Points & 50 Puzzle Points if you can fix the problem."},{"postId":18312,"topicId":2278,"posterId":636,"postTime":1301795138,"postText":"this happend to me once a=but the problem went away after three days ill try and look up a fix for u.\n\nedit: I think i found it try this (Have you tried going into Steam Library>right click on selected game and go to properties>Local Files tab>Verify Integrity of game cache.)"},{"postId":18313,"topicId":2278,"posterId":636,"postTime":1301795460,"postText":"idk if thats right though."},{"postId":18314,"topicId":2278,"posterId":4,"postTime":1301796260,"postText":">> Have you tried going into Steam Library>right click on selected game and go to properties>Local Files tab> Verify Integrity of game cache .) \n>> I have already  Verified Integrity , Defragmented Cache, deleted ClientRegistry.blob, Reinstalled Steam, Reinstalled Garry's Mod, Restarted Computer, Used Launch Options, Turned on Game Mode for Antivirus, Disabled Anti-virus, Virus Scan Computer, Ran CCleaner, and other things. Still not working. "},{"postId":18317,"topicId":2278,"posterId":377,"postTime":1301796920,"postText":"Is Game Overlay not working?"},{"postId":18365,"topicId":2278,"posterId":586,"postTime":1301851782,"postText":"If game overlay is not open in task manager then thars your problem"},{"postId":18380,"topicId":2278,"posterId":4,"postTime":1301860322,"postText":"That...might just be the problem. Any idea how to fix it?\nSteam overlay is enabled under Steam Settings and under properties for all my games, but it isn't showing up in Task Manager :/"},{"postId":18382,"topicId":2278,"posterId":586,"postTime":1301865315,"postText":"Have you done anything to your system before you did everything? If you did, undo it, if you didn't, well idk."}]}