{"topicId":3348,"forumId":1,"topicTitle":"Project Reconstruction","topicTime":1311812480,"topicViews":744,"topicReplies":58,"topicStatus":0,"topicFirstPosterName":"SMOOGLY","topicFirstPosterColor":"","topicLastPosterName":"Sohisohi","topicLastPosterColor":"","topicLastPostTime":1314888167,"posts":[{"postId":26540,"topicId":3348,"posterId":397,"postTime":1311812480,"postText":"Our goal is to improve nnjg to its optimal potential. punk and my idea about the maps was just a start.\n\n\nSo i have been asking regulars about problems they see in the forums and servers. I then am talking to punk about them before i can post the topics to the public\n\n1: Anonymous wrote. \"I could be wronge and everything will be alright.... but I feel people would rather fight to win then make new friends... a lot of the old regs and new start up regs arn't getting along. Mostly because all the new regs thing the old ones are aimboting and the old ones thing that the new regs are a bunch of 13 year old pussy bitches.... I don't mind helping new players use hands and seting up ban requests on there behalf if they need help. Hell, today I did one for a new guy who got knifed my his traitor buddy. The only real reason I even got vip was to stop all the mic trolling. But, other than me, I don't really know many people who help out new players on fourms who don;t have accounts set up.\"\n\nwe do agree on some points like treatment to new regulars, is that they are new and instead of saying fail we should help them fix their mistakes on aim/tactics/figuring out who is traitor.  this would make them feel better about our community and want to come back and play some more.\n\n2: i would like a request that every staff/vip have a key bound to advertize going to our forums more especially if previous problem gets fixed our community will grow significantly.\n\n3.Anonymous wrote \"ok. as of right know there are around 10 or 11+ vips... and thats not counting regulars that have not gotten vip... But, there are only 22 slots... I'm sure you can see where the problem comes in. NNJG is very popular now... and as a result people are fighting for the slots... a good thing is that people with the fastest computers will almost always sneak in using that automatic start when there is a map change... I do it to... There simply is no room for the ever expanding NNJG TTT. So this is what I thing. More slots will improve reg and new player relations. The only problem is that we will be trading off hostility for chaos. more slots means more players. Lots of mic spam and most likely a bit more rdm... but thats expected with new people joining and not knowing all the rules. We would need new and larger maps. we (as in NNJG ttt) would need a complete overhaul of the mic system to avoid mic spam... because it will be a problem. I have been working on a few ideas that would improve the mic system if we got more slots. it would be perfect in controlling the mic spam.\"\n\nthats on gash and gash's decision alone what he want to do but it brings up good points. i have more ideas about this but will need to discuss about it more thoroughly.\n\n3: Anonymous wrote \"we need a new motd rules list with the unlisted rules on it\".\nindeed and we need to update this when gash comes back\n\nmore will come and ill update this regularly\n\n\nlove, smooglez"},{"postId":26541,"topicId":3348,"posterId":812,"postTime":1311812616,"postText":"I agree with more specific (Unlisted Rules) rules be added to the MOTD. To many times do I find myself explaining something to someone ill informed, it would be nice if the MOTD could be updated with an official list of all those specific rules."},{"postId":26544,"topicId":3348,"posterId":634,"postTime":1311814057,"postText":"I coulda sword you were going to name it Project TunneLight\nI really hope this goes over well. There are no malicious means behind this movement.\n\nAlso check this out.\n http://img269.imageshack.us/img269/6327/681311814024.png  \n\nP.S. You don't need to put me as anonymous."},{"postId":26548,"topicId":3348,"posterId":115,"postTime":1311814680,"postText":"How about we first:\n\nGet Jail up\nGet puzzle up (whenever the hell it comes up)\n\nThen we can deal with server problems in NNJG.\n\nAs for all the forum problems with NNJG, we are kind of discussing this in the staff section of the forum. As in, we are kind of working on it."},{"postId":26550,"topicId":3348,"posterId":397,"postTime":1311814899,"postText":"jail is still down? but yes these rules definitely apply to jail it would triple the forums population if more of them joined forums\n\npunk told me about that and this side of the discussion for the regulars to read and try and fix these key areas"},{"postId":26558,"topicId":3348,"posterId":142,"postTime":1311818341,"postText":"There could be a automated advertisment in chat, that fixes number 2."},{"postId":26560,"topicId":3348,"posterId":6,"postTime":1311819429,"postText":">> How about we first:\n\nGet Jail up\nGet puzzle up (whenever the hell it comes up)\n\nThen we can deal with server problems in NNJG.\n \nWhy wait? The quicker we start, and the more time we focus in improving, the more improvements shall be made. We can start with ttt, and then when those two come up, work on those as well. No need in waiting to start.\n\n\nThe point of games is to have fun, not argue all the time."},{"postId":26562,"topicId":3348,"posterId":397,"postTime":1311820280,"postText":"that is already there but i dont think its working we need something more visible"},{"postId":26563,"topicId":3348,"posterId":79,"postTime":1311820480,"postText":"Might as well comment. To fix some of the issues in TTT, maybe if Gash would let someone that can be trusted help work on the code for a few fixes. Such as the RTV not actually starting till after round over or even someone adding new maps to the server. Just a couple ideas that could help solve TTT issues. Maybe more admins/mods that have different hours of when they play too. Seems like most the mods/admins play at night, so what about the mid day issues."},{"postId":26570,"topicId":3348,"posterId":634,"postTime":1311821387,"postText":"None of us can control the status of Jail but Ben. We need to work on what we CAN work on. In a related comment to Crisis'' I think more community coders would be great and maybe more community mappers too. Maybe when/if Udane gets back he can give pointers on Hammer. And maybe Storm could help people with lua if they needed it. \nWe have resources. we need to make use of them.\n\nEDIT: We should get some nice videos showcasing the NNJG servers too."},{"postId":26571,"topicId":3348,"posterId":4,"postTime":1311821423,"postText":"Automatic VIP registration"},{"postId":26576,"topicId":3348,"posterId":243,"postTime":1311821721,"postText":" Less Kryz  I mean I <3 this plan.\nAnd yes, I would love to learn LUA.. and mapping, but the interwebs isnt as helpful as a real person.. :3\n  And just a reminder: Send me all the known maps that are on the TTT rotation.  "},{"postId":26578,"topicId":3348,"posterId":397,"postTime":1311822171,"postText":">> maybe if Gash would let someone that can be trusted help work on the code for a few fixes. \n\ni know you 2 dont get along but  leave the mild passive-aggressiveness comments.\n\nyou could have said \n\n>>  some coding problems can be fix if Gash can get some one to code it for him.  "},{"postId":26585,"topicId":3348,"posterId":112,"postTime":1311826129,"postText":"1 Seems like their own problem. We can't stop anybody from hating anybody else\n2 It already autoadverts it. If people want to sign up they'll look into it, otherwise I really don't feel like spamming them\n3 We have way more than 11 vips... The last thing we need is a slot increase.\nMore slots won't improve relations, and people will still have to wait to join."},{"postId":26587,"topicId":3348,"posterId":237,"postTime":1311826394,"postText":">>  Less Kryz  I mean I <3 this plan.\nAnd yes, I would love to learn LUA.. and mapping, but the interwebs isnt as helpful as a real person.. :3\n  And just a reminder: Send me all the known maps that are on the TTT rotation.   \n\nyeah dude, i'd learn luam too. ;D\nohwait..."},{"postId":26610,"topicId":3348,"posterId":612,"postTime":1311867051,"postText":"Sister server. That is all."},{"postId":26611,"topicId":3348,"posterId":397,"postTime":1311867840,"postText":">> \n3 We have way more than 11 vips... The last thing we need is a slot increase.\nMore slots won't improve relations, and people will still have to wait to join. \n\n:( you kind of slapped me in the face there buddy. if you would, explain more on your third comment more throughly.\n\n1.it becomes my problem when they do it on my post.\n2.kk still need to think of a better way then\n3.please explain why it would be bad to have more slots. i know people will still have to join but more people in server is still more people,"},{"postId":26612,"topicId":3348,"posterId":112,"postTime":1311868559,"postText":">> >> \n3 We have way more than 11 vips... The last thing we need is a slot increase.\nMore slots won't improve relations, and people will still have to wait to join. \n\n:( you kind of slapped me in the face there buddy. if you would, explain more on your third comment more throughly.\n\n1.it becomes my problem when they do it on my post.\n2.kk still need to think of a better way then\n3.please explain why it would be bad to have more slots. i know people will still have to join but more people in server is still more people, \n\nMore people= More chaos and more rdm.\nThere is no plus side."},{"postId":26620,"topicId":3348,"posterId":612,"postTime":1311878356,"postText":"Also more slot=more lag. This wouldn't help the reg at all. If u were gonna add more slots, the reduce the number on the sever, and add another one. Is gash or ben need help financially then they can talk to me. Gmod servers are cheaper than most games so I could help pay."},{"postId":26627,"topicId":3348,"posterId":812,"postTime":1311881541,"postText":"But I mean, two , or 4 extra slots won't kill us guys. NNJG TTT is one of the most popular TTT servers and with just a couple more slots it would help us expand, and also give us an extra T! But it is the admins decision on that, and Pharaoh does bring a good point, but I say regardless there will be RDM with any amount of players."},{"postId":26630,"topicId":3348,"posterId":634,"postTime":1311881769,"postText":"Make it 24, seriously.\nIt will still have a waiting list at peak times, but at least its divisible of 4(traitor:player ratio).\nAnd more players participating in TTT means more potential VIPs. Which means more monies. Which means better server.\n\n\noff topic: VIP should cost more or have to be renewed.\nsome examples.\nVIP costs 3$ a month\nor VIP costs 40$ for lifetime.\nWe need to find a way to suck more money out of players like me. (not a joke)"},{"postId":26631,"topicId":3348,"posterId":769,"postTime":1311881894,"postText":">> Make it 24, seriously.\nIt will still have a waiting list at peak times, but at least its divisible of 4(traitor:player ratio). Yes, this pleases me."},{"postId":26634,"topicId":3348,"posterId":634,"postTime":1311882352,"postText":"oh my god; Kryzoid's Avatar.\n http://i877.photobucket.com/albums/ab332/Destar_01/kryrecon.png?t=1311882655 "},{"postId":26639,"topicId":3348,"posterId":112,"postTime":1311885143,"postText":">> Make it 24, seriously.\nIt will still have a waiting list at peak times, but at least its divisible of 4(traitor:player ratio).\nAnd more players participating in TTT means more potential VIPs. Which means more monies. Which means better server.\n\n\noff topic: VIP should cost more or have to be renewed.\nsome examples.\nVIP costs 3$ a month\nor VIP costs 40$ for lifetime.\nWe need to find a way to suck more money out of players like me. (not a joke) \n\n2 more players won't increase vips. It will just make it harder for traitors to win.\nYou said more money = better server. \nWhats wrong with the current server?\n\nand Vip already is 10 dollars."},{"postId":26641,"topicId":3348,"posterId":634,"postTime":1311886280,"postText":">> \n2 more players won't increase vips. It will just make it harder for traitors to win. \nNo it will make it easier. there are 22 player caps now. \nThat means 5 traitors versus 17 innocents.\nWith 24 players it will be 6 traitors vs 18 innocents. which is MUCH easier.\n\n>> You said more money = better server. \nWhats wrong with the current server? \nJust because something is good doesn't mean it can't be better.\nHow many suggestions in the TTT suggestions thread actually become implemented? Almost none.\nWe need money to pay coders to create new improvements for our server. Either that or community coders.\n\n>> \nand Vip already is 10 dollars. \n More money is never a bad thing  and if you made different levels of VIP that would be a great idea and many people would aim for the highest tier of VIP.\n\n10$ = Regular VIP\n25$ = Upgraded VIP\n50$ = Advanced VIP\n100$+ = Server Investor\n\nEach tier would grant them more powers and influence over the decisions of the Server. i'm sure you would get some 25$ VIPs fairly often and maybe even some 50-100$ donations on rare occasions."},{"postId":26642,"topicId":3348,"posterId":142,"postTime":1311886902,"postText":"Like me lululul"},{"postId":26665,"topicId":3348,"posterId":397,"postTime":1311894282,"postText":">> >> \n2 more players won't increase vips. It will just make it harder for traitors to win. \nNo it will make it easier. there are 22 player caps now. \nThat means 5 traitors versus 17 innocents.\n With 24 players it will be 6 traitors vs 18 innocents. which is MUCH easier. \n\n>> You said more money = better server. \n Whats wrong with the current server?  \n Just because something is good doesn't mean it can't be better. \nHow many suggestions in the TTT suggestions thread actually become implemented? Almost none.\nWe need money to pay coders to create new improvements for our server. Either that or community coders.\n \n>> Our goal is to improve nnjg to its optimal potential. \n\n\n\n>> 10$ = Regular VIP\n25$ = Upgraded VIP\n50$ = Advanced VIP\n100$+ = Server Investor \nAdmins would definitely say no for the fact its unnecessary and its like buying admin but the person didnt earn the powers. clearly the people would abuse like hell"},{"postId":26667,"topicId":3348,"posterId":634,"postTime":1311894912,"postText":"So people abuse, lose there position and we get 10-100$ out of the deal? And the possibility of them paying for it again means even more money. Are you guys on crack? This would generate so much more money.\n\n>> \nAdmins would definitely say no for the fact its unnecessary and its like buying admin but the person didnt earn the powers. clearly the people would abuse like hell \nThe admins can and will post their own opinions, you don't have to post for them."},{"postId":26670,"topicId":3348,"posterId":101,"postTime":1311895498,"postText":"That kind of makes it \"selling\" VIP, which we cannot do."},{"postId":26672,"topicId":3348,"posterId":634,"postTime":1311896099,"postText":"Selling VIP? Do you mean Selling Admin? And I never said to give them admin powers. Perhaps i should elaborate.\n\n10$ - Regular VIP - Orange Name - Gag, Vote kick\n25$ - Upgraded VIP - Red Name - Gag, Vote kick\n50$ - Advanced VIP - Red Name - Gag, Vote kick, Slay, Slap\n100$ - Server Investor - Green - Gag, Vote kick, Slay, Slap\n\nNone of these powers are extremely powerful like the kick and ban power. But still give a nice reason to buy one along with supporting the community.\nAnyone who abuses the powers gets demoted and may re-purchase their position.\n$$$$$ Profit $$$$$"},{"postId":26677,"topicId":3348,"posterId":2,"postTime":1311899723,"postText":">> Selling VIP? Do you mean Selling Admin? And I never said to give them admin powers. Perhaps i should elaborate.\n\n10$ - Regular VIP - Orange Name - Gag, Vote kick\n25$ - Upgraded VIP - Red Name - Gag, Vote kick\n50$ - Advanced VIP - Red Name - Gag, Vote kick, Slay, Slap\n100$ - Server Investor - Green - Gag, Vote kick, Slay, Slap\n\nNone of these powers are extremely powerful like the kick and ban power. But still give a nice reason to buy one along with supporting the community.\nAnyone who abuses the powers gets demoted and may re-purchase their position.\n$$$$$ Profit $$$$$ \nGiving any VIP a command that alters gameplay should not be allowed. Be happy gag and votekick are both allowed as it is. New additions for VIPs will not allow access to additional commands."},{"postId":26678,"topicId":3348,"posterId":397,"postTime":1311900191,"postText":"i like what gash said, the obvious question then is do to rank regular vips cant gag ore votekick higher ones right?"},{"postId":26687,"topicId":3348,"posterId":54,"postTime":1311905348,"postText":"Mark approves."},{"postId":26689,"topicId":3348,"posterId":243,"postTime":1311905499,"postText":"Idea!\nVIP=$10:  Gag   Brown  name (who wants brown?)\nCooler VIP=$25:  Gag&Votekick   Orange  name!\n\nBut srsly though I would rather see a VIP system more like jail if money is what we want.\n$5/mo\n$50/yr\n$175/2yr\netc..\n\n>> No it will make it easier. there are 22 player caps now. \nThat means 5 traitors versus 17 innocents.\nWith 24 players it will be 6 traitors vs 18 innocents. which is MUCH easier. \nDont forget this will also mean another detective, which seems to balance out the difficulty level, but still includes  more  players.\n\n\n>> More people= More chaos and more rdm.\nThere is no plus side. \nI don't think that 2 extra people on at one time will increase this, have faith in the current mods/admins!\nI mean, we have plenty of VIP's to report things. I don't think that would be an issue.\nAnd the plus side is: More popularity.\nIt seems as though people enjoy full server's with many slots, as opposed to an empty server with 12 slots.\n\n  (Constructive criticism please. No idea's are perfect.)  "},{"postId":26690,"topicId":3348,"posterId":634,"postTime":1311905813,"postText":">> \nBut srsly though I would rather see a VIP system more like jail if money is what we want.\n$5/mo\n$50/yr\n$75/2yr\netc..\n \nfixed"},{"postId":26707,"topicId":3348,"posterId":397,"postTime":1311917077,"postText":"i personaly dont like the monthly thing, it was the biggest reason i when to steam and not blizzard. only had to pay once"},{"postId":26719,"topicId":3348,"posterId":115,"postTime":1311922184,"postText":">> >> How about we first:\n\nGet Jail up\nGet puzzle up (whenever the hell it comes up)\n\nThen we can deal with server problems in NNJG.\n \nWhy wait? The quicker we start, and the more time we focus in improving, the more improvements shall be made. We can start with ttt, and then when those two come up, work on those as well. No need in waiting to start.\n\n\nThe point of games is to have fun, not argue all the time. \nTo make modifications and improvements to the website, I assumed we would need Ben or Gash. TTT gets all the upgrades it can ever get, Jail needs some attention while it gets back up on its feet. It could be better if modifications were made to it."},{"postId":26743,"topicId":3348,"posterId":612,"postTime":1311930401,"postText":"Add more maps to the server. Keep maps upgraded. Point shop is bawss"},{"postId":26765,"topicId":3348,"posterId":634,"postTime":1311953808,"postText":"Jail needs weapon upgrades like the ones on TTT."},{"postId":26769,"topicId":3348,"posterId":397,"postTime":1311955584,"postText":"what jail needs really is for us to get way more of them on forums, i find that a regulars pov is perfect for pointing out problems they see, all of us on here save tin,and Mario and Ben, truly play on ttt. i say the more the merrier. just imagine how this community would be booming."},{"postId":26805,"topicId":3348,"posterId":115,"postTime":1311965404,"postText":">> what jail needs really is for us to get way more of them on forums, i find that a regulars pov is perfect for pointing out problems they see, all of us on here save tin,and Mario and Ben, truly play on ttt. i say the more the merrier. just imagine how this community would be booming. \nIt was booming until the ddos's.\n\n\n>> Jail needs weapon upgrades like the ones on TTT. \nThis is sort of what I meant. People would play more often if there were more upgrades to gain on jail. It would give them a motive to stick around."},{"postId":27016,"topicId":3348,"posterId":397,"postTime":1312119880,"postText":"bumbed do to fact i feel this movement shouldnt get pruned, i dont think punk would like that either."},{"postId":27152,"topicId":3348,"posterId":115,"postTime":1312235135,"postText":"We are doing a lot of things behind the scenes involving fixing NNJG's problems. But I guess I'll comment.\n\n1. No way to solve this. New members should gain respect of old members, if thats what happens. But I've never seen anything like this of the sorts on the server.\n\n2. All they have to do is google nonerdsjustgeeks. We dont need to advertise anything. Playing on the servers is advertising.\n\n3. Working on behind the scenes and such.\n\nEDIT: We also rewrote a lot of the rules."},{"postId":27342,"topicId":3348,"posterId":634,"postTime":1312243612,"postText":"So we should set out some goals for project Reconstruction so we can actually make progress.\n\nI suggest that people come here and post what they think should be accomplished by NNJG and that they should be added to the OP.\nWe can scratch them off as we go along. Gash, Ben, and Admins should tell us which goals are  not  accomplish-able.\n\nHere are 5 that I have seen or come up with myself.\n\n1. A more organized and well defined way to confirm what is and what isn't trolling, and how players and mods+ should handle it.\n2. An updated MOTD containing all current rules on the TTT server.\n3. More updates and content for the Jail server. (include a link to a thread called \"Project Reconstruction Jail Suggestions\" where people can post suggestions for jail)\n4. An official NNJG promo video that is done at a professional level.\n5. Expand the TTT server by 2 slots (24).\n\n\nEDIT: Anyone who wishes to become more active in project reconstruction should join the steam group for it."},{"postId":27351,"topicId":3348,"posterId":364,"postTime":1312247248,"postText":"I'm so fucking confused...\n\nWhat are we trying to solve again...\n\nBecause there are a shit ton of like fixes people are like throwing out right now... but I HAVE NO clue what problem or server there trying to fix.\n\nFUCK\n\nWe should first state the problems... then slove... this is to confusing."},{"postId":27353,"topicId":3348,"posterId":364,"postTime":1312247393,"postText":"And another thing... is there a donation problem... because people have said this before.\n\nBut if there is one, then what are we (NNJG comunity) missing out on?\n\nI'm so fucking confused !.!"},{"postId":27367,"topicId":3348,"posterId":397,"postTime":1312254130,"postText":">> I'm so fucking confused...\n\nWhat are we trying to solve again...\n\nBecause there are a shit ton of like fixes people are like throwing out right now... but I HAVE NO clue what problem or server there trying to fix.\n\nFUCK\n\nWe should first state the problems... then slove... this is to confusing. \n\n\nwe are fixing nnjg as a whole, some problems do relate to the servers, i kind of look at this as a way for people to be aware and do there best to help out aswell"},{"postId":27400,"topicId":3348,"posterId":82,"postTime":1312289739,"postText":"I would have to agree with Soh about being confused. I don't really understand what the purpose of reconstructing when, at least from my point of view, things are better than ever. There certainly isn't anything broken as far as I can tell..."},{"postId":27402,"topicId":3348,"posterId":237,"postTime":1312293086,"postText":">> i personaly dont like the monthly thing, it was the biggest reason i when to steam and not blizzard. only had to pay once "},{"postId":27407,"topicId":3348,"posterId":634,"postTime":1312300032,"postText":"You guys don't know what this is meant to accomplish when the post directly before Sohi's saying \"I'm confused what r we doing?\" explains that you guys should post realistic goals for NNJG to accomplish and also gives 5 to start out with. Pay attention more, here it is again if you didn't read it the first time.\n\n>> So we should set out some goals for project Reconstruction so we can actually make progress.\n\nI suggest that people come here and post what they think should be accomplished by NNJG and that they should be added to the OP.\nWe can scratch them off as we go along. Gash, Ben, and Admins should tell us which goals are  not  accomplish-able.\n\nHere are 5 that I have seen or come up with myself.\n\n1. A more organized and well defined way to confirm what is and what isn't trolling, and how players and mods+ should handle it.\n2. An updated MOTD containing all current rules on the TTT server.\n3. More updates and content for the Jail server. (include a link to a thread called \"Project Reconstruction Jail Suggestions\" where people can post suggestions for jail)\n4. An official NNJG promo video that is done at a professional level.\n5. Expand the TTT server by 2 slots (24).\n\n\nEDIT: Anyone who wishes to become more active in project reconstruction should join the steam group for it. "},{"postId":27418,"topicId":3348,"posterId":115,"postTime":1312304440,"postText":"1. Rule-related, we're still semi-working on the rules (definition will be made later).\n2. Rule related, we wrote the rules the other week, but we're still sort of working on it.\n3. I agree, mostly with the shop. It would give more incentive to play more often.\n4. Nobody has one of these, and seeing as we're constantly making updates and switching server (besides the 3 main ones) makes it hard to pinpoint what the video should be focused on.\n5. It doesn't need 2 more slots."},{"postId":27429,"topicId":3348,"posterId":79,"postTime":1312307977,"postText":"1) In Internet slang, a troll is someone who posts inflammatory,[2] extraneous, or off-topic messages in an online community, such as an online discussion forum, chat room, or blog, with the primary intent of provoking readers into an emotional response[3] or of otherwise disrupting normal on-topic discussion. Wikipedia ftw :)\n\n2) I think Kryzoid has been working on this in another thread honestly.\n\n3) Who cares about jail? *trolololol*\n\n4) Promo vid? I suggest Lua be the voice, everyone will come ;)\n\n5) I would agree with either or, 2 slots would be a even 3 detectives and 6 traitors. i think it would be more fun with a couple more slots. But overall this is up to Gash, and if he feels like paying more.\n\n6) More maps would be nice, i think bigger map index will improve the amount of players we have. Currently were stuck between playing around 5 maps since none of the others people think are fun.\n\n7) Rework the !nominate thing so the next page/cancel works. People cant see but 1 small page of maps, assuming we have more then 10 maps.\n\n8) Have a lengthy thread about exactly what the rules entail. (Descriptions on what exactly the rule means, while in game its a short definition)\n\n9) Few updates to the server, i know Gash has been working on source ban so that has taken most his time atm. But maybe RTV end of round and a few other little updates. (yet to be named)"},{"postId":27440,"topicId":3348,"posterId":272,"postTime":1312312480,"postText":"Crisis, nominate does work. Open console, \"bind 9 slot9\" \"bind 0 slot0\""},{"postId":27443,"topicId":3348,"posterId":79,"postTime":1312313371,"postText":"I have it set like that Kobold, for whatever reason the next and cancel option still don't work. Maybe a personal bug, but they don't work for me at the least."},{"postId":27463,"topicId":3348,"posterId":718,"postTime":1312317187,"postText":"the next button in !nominate works for me."},{"postId":27640,"topicId":3348,"posterId":272,"postTime":1312394754,"postText":">> I have it set like that Kobold, for whatever reason the next and cancel option still don't work. Maybe a personal bug, but they don't work for me at the least. \nOdd, mine didn't work until I did that, but afterwards it's worked just fine."},{"postId":29216,"topicId":3348,"posterId":735,"postTime":1313335655,"postText":">> \n3) Who cares about jail? *trolololol*\n \nDon't bash jail, its more popular than TTT now.(according to GT)"},{"postId":30858,"topicId":3348,"posterId":364,"postTime":1314317354,"postText":"Should we host more contests???"},{"postId":31672,"topicId":3348,"posterId":364,"postTime":1314888167,"postText":"I think we should have more community events... Like dress up as your fav. Dragon Ball Z Character day. (AKA Change steam name, and pic for that day)"}]}