{"topicId":2641,"forumId":14,"topicTitle":"Unban Request","topicTime":1304874486,"topicViews":122,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"John Ossim","topicFirstPosterColor":"","topicLastPosterName":"John Ossim","topicLastPosterColor":"","topicLastPostTime":1304878566,"posts":[{"postId":21172,"topicId":2641,"posterId":761,"postTime":1304874486,"postText":"Your In-Game name: John Ossim\nYour Steam ID: STEAM_0:1:19063714\nReason: Racism\nLength of Ban/Date and Time of Unban: Permanent\nWhat server were you playing?: Jailbreak\nWho banned you?: Pharaoh\nWhy should we unban you?: I used the term \"Nigger\" as an expression of freedom of speech, and to express personal opinion on how racism is looked upon by people in general, rather than to offend, as I don't personally care if a person is Black, White, Asian whatever, as-long as you aren't an ass you're fine. I'm also a regular on the server as it's a good server to play on."},{"postId":21175,"topicId":2641,"posterId":112,"postTime":1304874911,"postText":"You said it once. I told you not to be racist. You replied with (as shown by picture)\n\n\" >mfw people think saying nigger is racist\ntrololo\"\n\n http://i41.photobucket.com/albums/e285/umean123/ossim.png \n\n\nI replied with \"Gtfo\""},{"postId":21177,"topicId":2641,"posterId":761,"postTime":1304875051,"postText":"I was just commenting on how racism is looked upon, hardly seems worthy of a perma-ban, maybe a week or something.\nedit: not to deny I said it although\nedit edit: Although thinking about it now, my second comment was out of order and for that I apologise."},{"postId":21178,"topicId":2641,"posterId":79,"postTime":1304876073,"postText":"Just thought i should mention something real quick. Although you want to express your freedom of speech. In the US we actually dont have the freedom of speech, its just a bogus thing that everyone says we have. Freedom of Speech doesn't allow words that are considered racist as well as any comments about death/killing. Yes blacks use the word all the time, they are wrong for doing so. But thats the world we live in, just gotta accept that. As for the perma ban, i think using a racist comment should be a warning then a day-week ban depending on the circumstances and usage of the word, then a perma if they come back saying it again. I would recommend in this cause to lower it to a 4-5 day ban, but admins have final say.\n\nEdit: So mainly what im saying is, you give up your rights for freedom of speech when you start playing a game. In the agreement it says offensive language can/will get you banned. Think of games as school, you complain/bitch, you get kicked out of class."},{"postId":21181,"topicId":2641,"posterId":112,"postTime":1304877743,"postText":">> I was just commenting on how racism is looked upon, hardly seems worthy of a perma-ban, maybe a week or something.\nedit: not to deny I said it although\nedit edit: Although thinking about it now, my second comment was out of order and for that I apologise. \n\n\nI don't understand how you can even attempt to say you were saying that to express your opinion on racism. You said nothing constructive.\nAnd since your full of bullshit. Your first comment was \"fuck nigger\" Care to explain how that helps fight racism?\n\nYou weren't doing anything against racism. Your comment didn't help anybody. You continued after your warning, and now you're lying in your unban request. You said things like \"You only killed me because I'm black\". Again I don't understand how that helps racism at all.\n\nYou saying \"trololo\" proves you knew you were breaking the rules, and you didn't care."},{"postId":21182,"topicId":2641,"posterId":761,"postTime":1304878079,"postText":"I didn't intend it to be constructive or help against racism, it was a trollish comment, however it still reflected my actual views despite how I set it out at the time."},{"postId":21185,"topicId":2641,"posterId":112,"postTime":1304878468,"postText":">>  I used the term \"******\" as an expression of freedom of speech, and to express personal opinion on how racism is looked upon by people in general, rather than to offend,  as I don't personally care if a person is Black, White, Asian whatever, as-long as you aren't an ass you're fine. I'm also a regular on the server as it's a good server to play on. \n\n>>  I didn't intend it to be constructive or help against racism, it was a trollish comment, however it still reflected my actual views despite how I set it out at the time.  \n\n\nBut you said it was to express personal opinion on how racism is looked on by the public? Now you say it was a troll comment?\nLying in an unban request what?\n\n\n@_Crisis: I appriciate your input, but you can't post on unban requests that you aren't directly involved in. Read the unban request rules."},{"postId":21186,"topicId":2641,"posterId":761,"postTime":1304878566,"postText":"Edit: Trollish comment meaning it was sounding and was meant to sound like a troll comment, but wasn't, it was reflecting my views, despite being non-constructive or informal. I aint saying it was a troll comment, just that I set it out in a way which sounds like one, by being non-constructive to the argument and informal. The first post was just an quick, short and general explanation of my viewpoint. Not that i'm lying, I just set out my previous posts in a way that clearly was open to confusion now that I look back on them.\n\nAnyway, hope I haven't made myself sound like an ass again, and hope to have my ban lowered to a week, get a warning or removed or whatever you feel appropriate, I enjoy playing on the server and its become a favorite of mine, i'm a regular and this is my first offense on the server.\n\nEditedit: If I made something unclear or you need further explanation for a part of my reasoning, i'll clear it up for to make it more understandable or explain further, just rushed out my justification as I wanted a speedy unban to get back into the game."}]}