{"topicId":3003,"forumId":22,"topicTitle":"Improvement on Votekick?","topicTime":1307933659,"topicViews":158,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"Moonrakerone","topicFirstPosterColor":"","topicLastPosterName":"__Crisis","topicLastPosterColor":"","topicLastPostTime":1309232289,"posts":[{"postId":23880,"topicId":3003,"posterId":237,"postTime":1307933659,"postText":"Can a votekick actually be like a 10 minute ban, so at least it will keep trolls from just coming right back?"},{"postId":23911,"topicId":3003,"posterId":112,"postTime":1307983025,"postText":"You could make a ban request"},{"postId":23915,"topicId":3003,"posterId":237,"postTime":1307983961,"postText":">> You could make a ban request \nI know, and i did have balenti ban the dude later, but it seems like most people would learn their lesson if they couldn't play for ten minutes."},{"postId":23916,"topicId":3003,"posterId":634,"postTime":1307983995,"postText":"If someone is that persistent usually you can call in a mod or admin that is Online. There is almost always at least 1 on."},{"postId":23943,"topicId":3003,"posterId":397,"postTime":1308008629,"postText":"but why bother a mod or admin. like farow said thats what ban requests are for. plus the mod wasnt there so he really cant do anything about it"},{"postId":23969,"topicId":3003,"posterId":634,"postTime":1308020570,"postText":">> but why bother a mod or admin. like farow said thats what ban requests are for. plus the mod wasnt there so he really cant do anything about it \nWhy bother an admin or mod? I don't know. Maybe because it's their job? And they can take action then and there if you screenshot it and give them a link to the screenshot. Ban requests are slow and I prefer immediate action taken against rule breakers."},{"postId":24047,"topicId":3003,"posterId":389,"postTime":1308095353,"postText":"Honestly I believe that if theres no mod / admin online at the time, your better off having evidence and making a ban request.\nThis way there wont be conflicts where a mod / admin has no proof.\n\nAn example would be Liza calling Destar a hacker.... which i still am unsure about.... Admins and such have no proof other than the basing of the public in the server. Even then theres not enough sufficient proof to go with."},{"postId":24950,"topicId":3003,"posterId":79,"postTime":1309232289,"postText":"Destar does hack ;). But yea, if people would actually take 5 minutes out of there death waiting for next round, they could take evidence, post it online and make a ban request (its what i do). Maybe then people will stop flaming those who actually post ban requests. Its because ban requests make half the player base frown upon the members that makes those members never post the request in first place."}]}