{"topicId":3968,"forumId":18,"topicTitle":"Destar's TTT Constitution","topicTime":1315096949,"topicViews":192,"topicReplies":24,"topicStatus":0,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1317770448,"posts":[{"postId":31990,"topicId":3968,"posterId":4,"postTime":1315096949,"postText":"  The Rules  \n\n01. Do not RDM (Random Death Match). This means either shooting/killing someone for no reason, insufficient proof, revenge, or hatred.\n\n02. Do not exploit glitches/hacks/bugs in the gamemode. This INCLUDES the Magneto stick/props and leaving a map with Hands.\n\n03. Do not spam in any way.\n\n04. Do not advertise anything in any way.\n\n05. Do not disrespect NNJG administration or your fellow players.\n\n06. Do not discriminate against another player's religion, sex, race, orientation, ethnicity, age, or other aspects.\n\n07. Do not RTV during a round (Rock The Vote). !Rtv or !rockthevote is a command that we have for players to vote for a forced map change. RTV is allowed pre/post-round only.\n\n08. Do not impersonate a player by changing your Steam name.\n\n09. Do not intentionally go idle in our server in order to gain points.\n\n10. Do not truce with another player(s) unless all truced players have been proven innocent via traitor tester. (Available on certain maps)\n\n11. Do not ghost. Ghosting is providing information to players, through means other than the standard in game chat, that could alter the outcome of the game.\n\n12. Do not claim areas.\n\n13. Do not camp in a certain area as a traitor for more than 1 minute.\n\n14. Do not traitor bait. Traitor baiting is when you intentionally use a gun to shoot near/around another player.\n\n15. Do not false call-out as an innocent. This means exclaiming that a certain player(s) is a traitor without proof or based upon suspicion.\n\n16. Do not force another player(s) to relinquish their standard weapon(s) for whatever reason.\n\n17. Do not force another player(s) to utilize a traitor tester.\n\n18. Do not attack/kill based on last-seen unless you use a visualizer and it shows that they were killed from the front.\n\n19. Do not attack/kill another player based on what weapon(s) they have.\n\n20. Do not attack/kill another player(s) based on NNJG Point shop item(s) that they may currently be in possession of.\n\n21. Do not intentionally commit traitorous acts as an innocent terrorist and/or try to make other players lose karma.\n\n22. Alive checks may only be performed once every 2 minutes at most. Being alive and not responding to an alive check after 30 seconds is traitorous.\n\n23. If you are being followed by someone who isn't a detective, you may warn them at least 3 times to stop following you before you may attack them. Each warning must be clear, concise, and include the player's name. This can also be used in the same fashion for someone who is door blocking.\n\n24. If you are a traitor and would like to use a Jihad Bomb, you must warn any other traitors in the immediate area to leave and allow at least 10 seconds before you commence the explosion process.\n\n25. You must play the game correctly. If you witness a traitorous action while innocent, you must act upon it by attacking the culprit and/or calling them out.\n\n\n\n    Rule Explanations    \n\n\n\n 01. Do not RDM (Random Death Match). This means either shooting/killing someone for no reason, insufficient proof, revenge, or hatred. \n\n\n\nKilling/Shooting someone in self-defense is never RDM, as long as you were shot first it is never RDM.\n\nKilling/Shooting someone in cross-fire is never RDM, however, multiple incidents can result in consequences.\n\n\n\n Types of RDM \n\n\n\n blatant RDM \n\nBlatant RDM with no reason even close to being \n\n Example:  Killing/Shooting someone because you \"feel\" like it, or because \"you were bored\".\n\n Mass RDM \n\nMass RDM is killing with the intention to eliminate as many players as possible. Essentially, it is acting as a traitor while being innocent.\n\nMass RDM can be accomplished with as little as 2 innocent kills.\n\n Example:  Killing/Shooting everyone around you immediately at the start of the round.\n\n RDM without proper evidence (Standard RDM) \n\nYou may not kill someone without proper evidence.\n\nProper evidence for killing a player include but are not limited to\n\n -The player committing any traitorous actions. (see Index, Traitorous Actions)\n\n-The player being the only person left unproven through valid means of proving innocence. (see Index, Proving Innocence)\n\n-The player being called out by another player that is not known to be a traitor.[/list:o:3oyswmge]\n\n RDM due to revenge or hatred \n\nRDMing someone due to an event from the previous round is Revenge RDM.\n\n Example:  Killing/Shooting a player the current round because you were killed the previous round by that player.\n\nRDMing someone based on a characteristic they have is discriminatory RDM (RDM due to hatred).\n\n Example:  Killing/Shooting someone because you dislike the sound of their voice.\n\n Traitor Teamkilling \n\nTeamkilling your traitors can be a form of RDM.\n\n Example:  Knifing your traitor teammate on accident.\n\nTeamkilling with C4 is allowed, it is your job to watch out for your teammate's C4 as a traitor.\n\n\n\n 02. Do not exploit glitches/hacks/bugs in the gamemode. This INCLUDES the Magneto stick/props and leaving a map with Hands. \n\nA glitch is a programming error which results in behavior not intended by the programmers.\n\nObvious glitches can be dealt with by moderators.\n\nIf you become \"stuck\" in the map or in a player, do not kill the player, that is RDM, notify a staff member to teleport you or reamin stuck until the end of the round or until the player gives you permission to kill him.\n\nGlitches must be reported to a staff member or on the forums.\n\nHacking is any program or alteration to a program that gives a player an unfair advantage or invokes malicious actions.\n\nUsing props for damaging or moving players is against the rules.\n\nTo read about leaving the map with hands Click Here .\n\n\n\n 03. Do not spam in any way. \n\nSpamming is a repeated message that is stated repeatedly with short intervals of time between the message.\n\nThis rule is largely subjective to the moderator dealing with it.\n\n\n\n 04. Do not advertise anything in any way. \n\nAdvertising anything other than NNJG is against the rules.\n\n\n\n 05. Do not disrespect NNJG administration or your fellow players. \n\nDisrespecting players or admins can consist of insulting, ignoring, or spreading lies about the person.\n\nLying to an administrator during an investigation about a violation in the rules is the one of the most serious forms of disrespect.\n\n\n\n 06. Do not discriminate against another player's religion, sex, race, orientation, ethnicity, age, or other aspect. \n\nThere is zero tolerance for discrimination at NNJG.\n\n\n\n 07. Do not RTV during a round (Rock The Vote). !Rtv or !rockthevote is a command that we have for players to vote for a forced map change. RTV is allowed pre/post-round only. \n\nRTV during round is a kick.\n\n\n\n 08. Do not impersonate a player by changing your Steam name. \n\nChanging your name to resemble a name in appearance or enunciation is against rule 8.\n\nIn the event that a player joins with a similar name, the player that holds seniority on NNJG will claim the name.\n\n\n\n 09. Do not intentionally go idle in our server in order to gain points. \n\nIdle consists of going into an afk-like state, where you do not play the game.\n\n Example:  Moving every 5 minutes or so to avoid the auto kick.\n\n\n\n 10. Do not truce with another player(s) unless all truced players have been proven innocent via traitor tester. (Available on certain maps) \n\nAiding another player who is an obvious member of the other team is trucing.\n\n Example:  Giving an obvious traitor a health station.\n\n Example:  Refusing to shoot a known traitor.\n\n If someone was unaware of information because of a legitimate reason they are exempt from trucing in some cases.\n\n Example   Being AFK, or having No Sound[/list:o:3oyswmge]\n\n\n\n 11. Do not ghost. Ghosting is providing information to players, through means other than the standard in game chat, that could alter the outcome of the game. \n\n Example  Telling someone who the traitor is through steam chat.\n\n\n\n 12. Do not claim areas. \n\nClaiming an area consists of damaging anyone that attempts to enter an area that you have \"claimed\".\n\nKilling anyone while claiming an area is RDM.\n\n\n\n 13. Do not camp in a certain area as a traitor for more than 1 minute. \n\nAs a traitor you must move between areas every minute.\n\n\"Areas\" may be defined differently by individual mods, but usually consists of a single room. In most cases, as traitor only room.\n\n\n\n 14. Do not traitor bait. Traitor baiting is when you intentionally use a gun to shoot near/around another player. \n\n\n\n 15. Do not false call-out as an innocent. This means exclaiming that a certain player(s) is a traitor without proof or based upon suspicion. \n\nThe same proof you must have to kill someone applies to calling them out.\n\nA callout is the same as attempting to kill someone.\n\nIf a false call-out is successful it is the same as RDM.\n\nTraitors can use false call-outs to further their goals.\n\nIf a known traitor does a call-out, it is RDM if you kill the person they call-out.\n\n\n\n 16. Do not force another player(s) to relinquish their standard weapon(s) for whatever reason. \n\nYou can never kill a player for not dropping a standard weapon.\n\nDetectives can request players to drop traitor weapons to see if there is DNA and kill them if they refuse to drop it.\n\nIf someone agrees to an ammo check or DNA check, you may not steal the persons weapon, you must return it.\n\nKilling a player for not dropping a weapon is RDM.\n\n\n\n 17. Do not force another player(s) to utilize a traitor tester. \n\nNo one is aloud to force another person to use a traitor tester.\n\nKilling someone for not using a traitor tester is RDM.\n\n\n\n 18. Do not attack/kill based on last-seen unless you use a visualizer and it shows that they were killed from the front. \n\nThe visualizer is a detective item that shows the location of the killer, when the victim died, when placed on the victim's body.\n\nIf the visualizer shows that someone was killed from the front, you may kill the person that was last seen.\n\nIf the victim was killed form any other direction than from the front you may not use last seen.\n\nKilling based on last seen without a visualizer showing a kill from the front is RDM.\n\n\n\n 19. Do not attack/kill another player based on what weapon(s) they have. \n\nYou can never kill someone based on what weapon they have.\n\nKilling based on someone's weapon is RDM.\n\nThis does not apply if it is a traitor weapon.\n\n\n\n 20. Never attack/kill another player based on NNJG shop items that are owned by players. \n\nCheck to see the NNJG Shop by pressing F4, never kill anyone based on which of these items they own.\n\n Example: A player kills someone because they have a cloaker. They have broken rule 24.\n\n Example: A player sees someone with a turtle hat go into a Traitor room, he knows that another player has that item so he calls out that player. The person doing the call-out has broken rule 24.\n\n\n\n 21. Do not intentionally commit traitorous acts as an innocent and/or try to make other players lose karma. \n\nIntentionally trying to make others lose karma is a form of trolling and will not be tolerated on NNJG.\n\n Example: Calling yourself out as a traitor so that other will kill you when you are an innocent, violates rule 25.\n\n Example: Finding a knife from a body, Not telling anyone, and pulling it out in an attempt to scare someone into killing you, violates rule 25.\n\n\n\n 22. Alive checks may only be performed once every 2 minutes at most. Being alive and not responding to an alive check after 30 seconds is traitorous. \n\nAlive checks must always be typed in chat.\n\nYou must respond to live checks in chat.\n\nYou may not be killed for not responding to a live check if you are a detective or proven innocent.\n\nKilling someone for not responding to a live check before waiting 30 seconds is RDM.\n\n\n\n 23. If you are being followed by someone who isn't a detective, you may warn them at least 3 times to stop following you before you may attack them. Each warning must be clear, concise, and include the player's name. This can also be used in the same fashion for someone who is door blocking. \n\nWarnings must be at least 5 seconds apart.\n\nKilling someone for following/door blocking without giving at least 3 warnings and adequate time intervals first is RDM.\n\nSomeone is not following if they are not moving.\n\nSomeone is not following if they are 100 feet+ away.\n\n\n\n 24. If you are a traitor and would like to use a Jihad Bomb, you must warn any other traitors in the immediate area to leave and allow at least 10 seconds before you commence the explosion process. \n\nJihading without a warning and without giving teammates 10 seconds to leave is RDM.\n\n\n\n 25. You must play the game correctly. If you witness a traitorous action while innocent, you must act upon it by attacking the culprit and/or calling them out. \n\nNo bullshit.\n\nThis rule can be interpreted at the discretion of a moderator.\n\n Example:  A player is called out as a traitor by 3 people. The player called out says they are lying and calls-out those 3 people, a fifth player decides to go on the single player's call-out and kill the 3 people. This fifth person has violated rule 22.\n\n\n\n\n\n\n\n  The TTT Rules are subject to change at any time and\n\nit is the responsibility of the player to be aware of them.  \n\n\n\n\n\n\n\n To learn tips and tricks for playing TTT on our server, or to share some of yours,  Look Here   \n\n If you have a question about any of the rules feel free to ask a moderator on the server, or post a question  Here   \n\n If you think a rule should be modified and are not a part of the NNJG staff please make a new thread  Here   using this template.  Are you modifying or proposing a new rule?\n\n\n\nIf modifying, please state the Article/Section of the rule.\n\nPlease explain how you would like the rule changed.\n\n\n\n[b]If proposing a new rule, state the rule.\n\nPlease explain the rule more in depth if possible. \n\n\n\n If you see someone who is breaking the rules, report it to a moderator, if no moderator is present, post a ban request thread  Here   using  This Template   \n\n If you believe you have been unjustly banned and would like to be unbanned post an unban request  Here   using  This Template   \n\n\n\n\n\n\n\n Thank you for reading, I hope this guide has given you a better understanding of the rules "},{"postId":31991,"topicId":3968,"posterId":4,"postTime":1315097000,"postText":"    Destar made this     and kindly asked me to post it here in the staff corner so that TTT mods+ could comment on it and propose suggestions. He wants it to eventually become an official thing."},{"postId":32000,"topicId":3968,"posterId":153,"postTime":1315098378,"postText":"Too many spaces and too big of fonts. I won't read it because it takes up so much space."},{"postId":32017,"topicId":3968,"posterId":112,"postTime":1315102992,"postText":"You're really going to use tl;dr?"},{"postId":32056,"topicId":3968,"posterId":153,"postTime":1315142405,"postText":">> You're really going to use tl;dr? \nDon't give me that attitude. \nIt's annoying to read something that takes up so much space."},{"postId":33860,"topicId":3968,"posterId":812,"postTime":1316546394,"postText":"If this is going to be added to the Motd, or whenever a new version of the Motd will be added, PLEASE add that The Cloaker is not a traitor weapon, it's a buyable item in the F4 shop. \n\nHopefully this would prevent alot more people being killed from it.\n\nEdit: And actually at that, also add incendiary ammo from a rifle is not a traitor weapon.\n\nAnd also apply the stop following rule to door blocking as well, meaning warn 3 times, can kill the person blocking the door."},{"postId":34045,"topicId":3968,"posterId":735,"postTime":1316661794,"postText":"What about propblocking, that gets really annoying."},{"postId":34046,"topicId":3968,"posterId":812,"postTime":1316662242,"postText":">> What about propblocking, that gets really annoying. \nSure that too, even though that could go under map exploiting etc.\n\nTo be honest there are alot of tidbits that should be at least be included on the next updated motd. If needed I could compile a list of all that."},{"postId":34090,"topicId":3968,"posterId":812,"postTime":1316741502,"postText":"Sorry to double post, but I just realized something unusual.\n\nWe don't have a rule against Ghosting for some reason? I just banned a guy for that and realized it wasn't even on the motd or the forum TTT rules. Just informing you guys.\n\nEdit: I suppose you can consider it a sub-rule under Trucing, but I think an individual rule just for ghosting with an explanation, like :Ghosting is using some sort of third party communication to alert another player who the traitors are, wouldn't hurt the motd."},{"postId":34097,"topicId":3968,"posterId":373,"postTime":1316744073,"postText":"I think we should also have a >> You also acknowledge the fact that this list of rules may change at any time and it is solely your responsibility to check back frequently for new content. \n\nSort of thing thrown in there."},{"postId":34101,"topicId":3968,"posterId":4,"postTime":1316744828,"postText":"Just going to add this in: Destar specifically told me that this shouldn't be the motd, just a thing that's maybe linked to in the motd for moderator and player reference on in depth rule explanations/consequences. It's too massive to be an efficient motd anyways"},{"postId":34102,"topicId":3968,"posterId":812,"postTime":1316745045,"postText":">> Just going to add this in: Destar specifically told me that this shouldn't be the motd, just a thing that's maybe linked to in the motd for moderator and player reference on in depth rule explanations/consequences. It's too massive to be an efficient motd anyways \nWhy not just add it to here http://nonerdsjustgeeks.com/rules/ttt/? It's already got the rules there, why not give the explanations. I think that's the perfect spot."},{"postId":34104,"topicId":3968,"posterId":4,"postTime":1316745162,"postText":">> >> Just going to add this in: Destar specifically told me that this shouldn't be the motd, just a thing that's maybe linked to in the motd for moderator and player reference on in depth rule explanations/consequences. It's too massive to be an efficient motd anyways \nWhy not just add it to here http://nonerdsjustgeeks.com/rules/ttt/? It's already got the rules there, why not give the explanations. I think that's the perfect spot. \nI completely agree.\nAnd the MOTD needs to be updated. :/"},{"postId":34105,"topicId":3968,"posterId":812,"postTime":1316745235,"postText":">> >> >> Just going to add this in: Destar specifically told me that this shouldn't be the motd, just a thing that's maybe linked to in the motd for moderator and player reference on in depth rule explanations/consequences. It's too massive to be an efficient motd anyways \nWhy not just add it to here http://nonerdsjustgeeks.com/rules/ttt/? It's already got the rules there, why not give the explanations. I think that's the perfect spot. \nI completely agree.\nAnd the MOTD needs to be updated. :/ \nWho made the current MOTD, are they still with us?"},{"postId":34107,"topicId":3968,"posterId":4,"postTime":1316745456,"postText":">> Who made the current MOTD, are they still with us? \nI wrote the current MOTD's text, Comrade Hardstar made it into a cool picture thing, which is the current MOTD.\nI wrote this updated version  recently."},{"postId":34109,"topicId":3968,"posterId":812,"postTime":1316745645,"postText":">> >> Who made the current MOTD, are they still with us? \nI wrote the current MOTD's text, Comrade Hardstar made it into a cool picture thing, which is the current MOTD.\nI wrote this updated version  recently. \nAhh I see. Would anyone here now be able to edit it into that picture?"},{"postId":34577,"topicId":3968,"posterId":4,"postTime":1317349003,"postText":"I told him a few of the suggestions you guys gave (under anonymous names)\nand the updated version is now in the op."},{"postId":34807,"topicId":3968,"posterId":812,"postTime":1317696088,"postText":"Just wondering when and IF this is going to replace the current MOTD, or if we're going to have a new one? I honestly feel the rules that Kryzoid, and now I guess Destar also, made should replace the current motd."},{"postId":34811,"topicId":3968,"posterId":4,"postTime":1317697019,"postText":">> Just wondering when and IF this is going to replace the current MOTD, or if we're going to have a new one? I honestly feel the rules that Kryzoid, and now I guess Destar also, made should replace the current motd. \n http://i.minus.com/itwUop8tCy8lv.jpg \nCredits to Destar for making the actual picture, me for the rules."},{"postId":34814,"topicId":3968,"posterId":812,"postTime":1317697241,"postText":"God Damn, that's great. Great work by Destar, so I guess it's now up to Gash/Ben to finalize it and put it up?"},{"postId":34824,"topicId":3968,"posterId":2,"postTime":1317709550,"postText":"Please don't have it give the names of all admins on there, it's annoying when someone gets promoted/demoted.\n\nAnd the \"click here\" thing? What?"},{"postId":34830,"topicId":3968,"posterId":84,"postTime":1317739297,"postText":"Gash, I think the \"Click Here\" is suppose to be a hyperlink that goes to the topic where each of these rules are explained in detail."},{"postId":34834,"topicId":3968,"posterId":812,"postTime":1317754159,"postText":"I think the click here link would either bring you to http://nonerdsjustgeeks.com/rules/ttt/, or wherever Destar has placed his in-length explanation of every rule."},{"postId":34842,"topicId":3968,"posterId":4,"postTime":1317763430,"postText":"The \"Click Here\" thing is literally supposed to link to Destar's TTT Constitution once and if we revise it and then repost it in the TTT board."},{"postId":34849,"topicId":3968,"posterId":4,"postTime":1317770448,"postText":">> Please don't have it give the names of all admins on there, it's annoying when someone gets promoted/demoted. \n\nDone.\n\n http://i.minus.com/ibw6X7i64qC0WE.jpg?q=0.640327086897 \n\n\nAlso, updated OP with revised TTT Rule explanations."}]}