{"topicId":4646,"forumId":18,"topicTitle":"Trolling / TTT","topicTime":1319528692,"topicViews":83,"topicReplies":13,"topicStatus":0,"topicFirstPosterName":"๖Mr. Gash","topicFirstPosterColor":"000000","topicLastPosterName":"Udane","topicLastPosterColor":"009900","topicLastPostTime":1319667063,"posts":[{"postId":36314,"topicId":4646,"posterId":2,"postTime":1319528692,"postText":"I would like to start this off with saying, the \"Troll is allowed if it doesn't break any rules\" was a dumb thing for me to say, and a dumb choice to make. \nTrolling from this point on should be against the rules, which also means if Kryzoid and Ben would be so kind as to add it to the rules..."},{"postId":36317,"topicId":4646,"posterId":115,"postTime":1319546632,"postText":"Trolling is pretty much player disrespect, insulting, possibly admin disrespect, possible racism, possible offensive words, and basically ignoring the rules. A person who is \"trolling\" only comes on to antagonize others, which technically should be against the rules. So, I agree with your decision tp make trolling against the rules.\n\nBut I DONT think trolling should be defined to a point. People should know what trolling means, and \"trolling\" can happen in many ways, shapes, or forms. Defining it to a point only gives a player a chance to find loopholes in the rule system and allow them to get away with certain things.\n\nWhat I'm saying is that you should add \"no trolling\" to the rules and give a brief description, but make it a flexible rule, where actual \"trolls\" will be able to escape a ban."},{"postId":36324,"topicId":4646,"posterId":812,"postTime":1319570884,"postText":"What I was most confused about during all of this was the whole 'controversy'' over Rule 22. Am I now able to enforce Rule 22 again?"},{"postId":36328,"topicId":4646,"posterId":153,"postTime":1319573089,"postText":">> What I was most confused about during all of this was the whole 'controversy'' over Rule 22. Am I now able to enforce Rule 22 again? \nYes, all rules should be enforced."},{"postId":36346,"topicId":4646,"posterId":2,"postTime":1319578431,"postText":">> you should add \"no trolling\" to the rules \nThe entire post you made was unnecessary, what I quoted was the point of my first post. Ben has to add it to the rules on the website homepage, and Kryzoid needs to send me the updated MOTD."},{"postId":36348,"topicId":4646,"posterId":115,"postTime":1319580520,"postText":"It was necessary, I stated that then went on saying it should be stated as \"no trolling\" and nothing more."},{"postId":36354,"topicId":4646,"posterId":4,"postTime":1319583309,"postText":"Before i update the motd with the no trolling rule, i was informed that there were other things in there that should be added/changed. playerhata and udane?"},{"postId":36358,"topicId":4646,"posterId":812,"postTime":1319584391,"postText":"Ah, yes, thank you Kry for remind me.\n\n-For rule 24 please add time intervals, either 3 seconds apart or 5, I'm not really sure wish. Also if you could dictate what types of chat warnings must be given in (Text/Voice/Or both)\n-Rule 23 doesn't dictate which chat to initiate/respond to live checks. ''Officially'' we've been using only text, and if you deem that is correct, please add that in the rule like \"Alive checks may only be performed in text, and responded via text\".\n-Could we just add a rule about releasing person information via the server? I understand this could technically be considered a sub-rule of 5, but it would be nice just to mandate that to players.\n-Maybe for Rule 5 also add \"Even if said player is your friend, player disrespect is not tolerated\"\n-On Rule 1, would you mind adding with the other examples for not killing someone \"killing on suspicion\"\n-And with rule 2, would you mind adding along with magneto stick/props, \"no propblocking/killing\".\n\nThat's pretty much all the amendments I can think of right now"},{"postId":36378,"topicId":4646,"posterId":605,"postTime":1319590865,"postText":"I'd like to disagree on the addition to rule 5 that hata has suggested, friends sometimes like to toy with others and usualy not intended of ill harm. I just follow a simple \"were you offended?\" and if yes, warn the player who offended them.\nWarnings and live checks must be in text, as some players have no sound/too loud music/etc."},{"postId":36384,"topicId":4646,"posterId":115,"postTime":1319592806,"postText":"Doesn't the \"were you offended?\" concept stepped over when you banned David tennant though, udane? Not that Im trying to argue, but you saying that, I found a sort of irony in it."},{"postId":36386,"topicId":4646,"posterId":812,"postTime":1319593665,"postText":">> I'd like to disagree on the addition to rule 5 that hata has suggested, friends sometimes like to toy with others and usualy not intended of ill harm. I just follow a simple \"were you offended?\" and if yes, warn the player who offended them.\nWarnings and live checks must be in text, as some players have no sound/too loud music/etc. \nWell I'm not exactly implying that the moment Mortos and Moon called each other chodes I'd ban them, but more of a common ground. of course I'd be able to tell when two friends are just messing around\n\nReally just it shouldn't be alright for two ''friends'' to totally verbally abuse each other and not be warned or punished, but Player X who saw that decides to do the same and then is punished.\n\nPlus, it's happened plenty of times where the person expects blatant player disrespect justified with the reasoning \"But he's my friend!\".\n\nAs I said, it's really just more of something that I feel should be stated in the rules so it's not less lenient, but a kind of prevention method."},{"postId":36434,"topicId":4646,"posterId":153,"postTime":1319657035,"postText":">> I'd like to disagree on the addition to rule 5 that hata has suggested, friends sometimes like to toy with others and usualy not intended of ill harm. I just follow a simple \"were you offended?\" and if yes, warn the player who offended them. \nI disagree. Having rules like this creates confusion and complication. If I dislike Kryzoid, I can just make a non-offending joke about him, and when he makes one back I'll be offended and get him banned. I don't think joking should be disallowed, I just think the \"were you offended\" system is flawed and needs to be changed.\n\n>> Warnings and live checks must be in text, as some players have no sound/too loud music/etc. \nAlso disagreed. Voice chat is meant to be used. I for one, when playing, wouldn't think of putting an alive check through chat. Why? I don't type because I'm trying to play while I speak. If people can't hear an alive check, it's their fault, not the person who called it. In addition, most people reply to alive chats in text so if someone's alive and they see\n [NNJG]Ben: Alive\nKryzoid:Alive\nPunkedmind:I\n in chat, they should get the hint."},{"postId":36435,"topicId":4646,"posterId":2,"postTime":1319660096,"postText":"Warnings should always be in text, in the chance that they can't be heard, or if something happens between the two people involved at least there would be logs of the warnings. Even \"ttt_radio imwith\" mixed with a \"say This is a warning\" bind would work. (This is if by \"warning\" you mean a warning about someone following you.)"},{"postId":36444,"topicId":4646,"posterId":605,"postTime":1319667063,"postText":"@quack;\nThis was off topic. If you must digress, we can talk in a pm. We are discussing ruling additions/changes and their effects, not past bans.\n\n@hata;\nYOU would be able to tell when two players are messing around, but everyone else may think they are breaking the rules and ask for a ban, leading to questions of why they are allowed to break that rule, and not them. Then you'd have to explain they are friends, and as thus, you know they do not mean it... even though in the rules, it states no exception, all disrespect is not allowed, even if they are friends. By not dealing with them, you would be contradicting the very rule you want to set out.\nPlayer X is the only situation I tend to have a problem with my own theory. Oddly, I haven't actually seen this situation pop up yet though.\n\n@ben;\nYou dont get a ban for one offense of player disrespect... otherwise, I'd be banning everyone for one case of rdm.\nBut by all means, I am not perfect. If you have a better idea of how to actually find out a player dislikes comments being thrown at them, pray tell.\n\nUse \"ttt_radio check\" if you are too busy to type out live check... currently the previously listed command (which comes out as \"Anyone still alive?\") is respected as the quick man live check.\nIt's a ton harder to prove someone actually did a live check if they went through their mic instead of text.\nAlso, by your definition, if my speakers broke, it would be my fault that I couldn't hear the live checks through the mic, and as thus, deserved to be killed each time they go off. Or let's say a dude was beind a dick to another player(s), no admins/mods are on, so they cleintside mute that player... this player then uses this time to use his mic to call a live check while only 3 or 4 players are alive. No one answers since they muted him, and by doing so, he would have a loop hole allowing him to rdm them, and get away clean."}]}