{"topicId":2018,"forumId":19,"topicTitle":"Forum rules. It is important to read these.","topicTime":1298952363,"topicViews":1628,"topicReplies":0,"topicStatus":1,"topicFirstPosterName":"Pharaoh","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1298952363,"posts":[{"postId":16594,"topicId":2018,"posterId":112,"postTime":1298952363,"postText":"First off, welcome to the NNJG forums. We hope you enjoy your time here :D\n\nWe just have a few simple rules to keep the forums a little bit in order and not cluttered.\n\n1. Post in the right section.  For example: If you're talking about TTT then don't go in general discussion. Simple enough. \n2. Keep private things private:  Don't share personal information about other users. Doing so will result in a ban. \n3. No drama: Its just annoying. Pm them through steam or even through the forums if you feel the need. Not everything needs to be brought to public attention. \n4. Don't troll/flame: Simple enough. You will be banned from the forums and our servers. \n5. Don't bump old threads unless your post is constructive: Don't just post on a old thread saying \"Lol\" \n6. This website is to be SFW. Meaning no porn of any kind is allowed. Not in the shoutbox, not in your sig, not in your thread. \n7. Only make one thread about a topic.  Don't keep reposting for an answer. You'll get an answer when somebody online knows it. \n8. Don't spam. Can't contain yourself? Spam here.  \n9. It is against the rules to be a bot. If you are found to be a bot you will be dragged into a dark alley and be beaten savagely with stunsticks until we get something else to do. \n If a bot posts, report it. Don't reply to it, we'll deal with it when we can. \n10. As a forum we do NOT support pirating.  Do not post links to pirated games. Do not give links to download them. \n11. No admin disrespect. Keep it to yourself. \n12. No personal attacks.\n13. Don't blankquote.  Meaning quoting somebody without adding any extra words/comments. \n14. Try to use proper spelling and grammar.  We aren't grammar nazis, but its annoying to try to read through sentences that are hardly english. \n15. No shitposting.  Goes with rule 8. Shitposting is posting things that are not constructive in any way. Shitposting/Spamming will have the post be deleted/ you being warned on the forums. \n16. Don't impersonate other people.\n17. Don't be a jackass.\n New to the forums? \nNeed to make a ban/unban request? Click here. \nNeed to check current bans? (For TTT) Click here. \nWant to make an introduction to the forums? Click here \nNeed donation information? Click here. \n\n  Remember to check back on this post every so often, because it can change at any time.  "}]}