{"topicId":4782,"forumId":12,"topicTitle":"Hank Banned?","topicTime":1320431885,"topicViews":125,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"Vasto","topicFirstPosterColor":"009900","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1320467305,"posts":[{"postId":37090,"topicId":4782,"posterId":916,"postTime":1320431885,"postText":"Yeah last night stratos told me that dum banned hank,And i DID saw something about a steamId being banned trolling,disrespecting..etc Couldnt read it all but soo..Is he banned or not"},{"postId":37093,"topicId":4782,"posterId":101,"postTime":1320432496,"postText":"COMPLETELY RE-WRITTEN POST:\n\nI believe I did ban him last night. He was constantly making up rules for people to follow even after I told him \"no\" and was disrespecting players. As you can see above, I completely re-wrote this post, as I didn't remember before, but I recalled someone having a voice bypass (talking while dead) last night. I got on my mic to ask why and I remember asking \"Hank, how are you still talking?\" in which he replied \"I'm holding down my mic button, duh\"\n\nAfter a bit of player disrespect I believe, he left, in which case I banned him for the cumulative offenses. It is either a week or 2 days, I forgot which.\n\nOn a side note, when I got on the server last night there were 2 mods and the server was in chaos, and they weren't doing anything. I am quite ashamed of your lack of administration, please use your powers to help control the server and not whip yourself 100 times."},{"postId":37097,"topicId":4782,"posterId":916,"postTime":1320435935,"postText":"Last night? What Time if it was past 1 i was in bed by then."},{"postId":37098,"topicId":4782,"posterId":1121,"postTime":1320437225,"postText":"Hey,\nI just want to say that some of that information is completely false. Making up rules? Now thats just not true. Disrespect? Hardly. Some of what I may have said may have been misconstrued as offensive, and for that I'm sorry, but do I deserve a ban when you (or any other players for that matter) never told me what I was saying was disrespectful. If you had simply told me that you were offended by some of the things that I was saying, I have no doubt in my mind that I would have stopped imediatly. I'm sorry if you felt I disrespected you, I truely am but can you at least tell me before you bring down the banhammer. As for talking whilst dead, it's a common trick used by most of the server, if you hold down your microphone button (X in my case) before you are killed you can continue talking. Also when you do this it appears as though you are letting go of the mic button even though you are not (I have no explanation as to how this works).\n\nTo Dum and any other players on the server last night, I'm sorry if you felt you were being disrespected."},{"postId":37104,"topicId":4782,"posterId":1016,"postTime":1320443706,"postText":"Actually that's a good one, who was whipping themselves? When I was on the server was alright."},{"postId":37108,"topicId":4782,"posterId":735,"postTime":1320444612,"postText":"I wasn't even on since I left around 11"},{"postId":37126,"topicId":4782,"posterId":916,"postTime":1320462658,"postText":"Hes Not telling no one,Might as well say Forget it"},{"postId":37128,"topicId":4782,"posterId":735,"postTime":1320467063,"postText":"Can someone with logs (quack,ben,gash,etc.) show who actually was whipping themselves"},{"postId":37129,"topicId":4782,"posterId":115,"postTime":1320467305,"postText":"We already have an idea of who, don't worry about it, I have it handled."}]}