{"topicId":2240,"forumId":14,"topicTitle":"Unrightful ban by KrystalWolf","topicTime":1301351348,"topicViews":237,"topicReplies":11,"topicStatus":1,"topicFirstPosterName":"DJNyssie","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1301626429,"posts":[{"postId":18028,"topicId":2240,"posterId":619,"postTime":1301351348,"postText":"I was perma-banned from TTT becuase overclocking said i had an aimbot and a video to boot of me using it after a minute or two of him kicking and rekicking when everyone else didnt care Krystal perma-banned me and i have seen no video or anything about it. I would like to be unbanned as I have been with TTT forever and have never used aimbot or any other hack on there.\nName [NNJG] DJ Nyssie\nSteam ID STEAM_0:1:37705664"},{"postId":18031,"topicId":2240,"posterId":54,"postTime":1301356091,"postText":"Yeah.. I'd like for That Guy to explain why he was banned. DJ Nyssie is a regular player on NNJG, plus he's a good player. I saw that you were banned and no reason was even there."},{"postId":18034,"topicId":2240,"posterId":389,"postTime":1301356750,"postText":"I like to see that video by Overclocking as well."},{"postId":18036,"topicId":2240,"posterId":619,"postTime":1301356899,"postText":"yeah i really wanna see this video i think it may be of a pistol duel me and him had. i won because he didnt shoot and walked everywhere."},{"postId":18044,"topicId":2240,"posterId":377,"postTime":1301362075,"postText":"The Reason I Banned you was because I spectated you and saw first was you shooting someone with a Shotgun at quite some distance and He was at full health and you two-shotted him, which can only be done by all pellets hitting, but you were too far away for that, and you did it a second time.  I was a little Iffy on that, so I killed myself and told Overclocking to challenge you to a Deagle battle so I can see clearer.  What I saw was 5 in a row Deagle shots that the cross-hairs were about --------------------------------------------- from Target, yet I saw all Five Shots Hit Overclocking Square in the chest, one after another in rapid succession.  Only when Overclocking was behind a tree was he safe.  I Know Aimbot's don't always Aim for the Head, My friend has one that aims for the knee.  I was told by the Admin's that If I see Clear Hacking, I act upon it.  To me, that was clear enough.  I wasn't Laggy at all, In fact I just got my neighbor to stop stealing my Internet so I was as Lag free as I ever was.  If I suspect someone of Hacking Even If the Entire Server Is screaming BAN HIM, I always wait till I SEE the hacking with my own eyes to Ban them.  That's what I got to say in my defense.  If I forgot something I'll be sure to add it.  And Pharaoh, I've seen Hax get by Admin scans before."},{"postId":18047,"topicId":2240,"posterId":389,"postTime":1301363941,"postText":"*off topic*\n\nYour neighbour stole internet.... put a password on that shit"},{"postId":18049,"topicId":2240,"posterId":2,"postTime":1301364730,"postText":">> *off topic*\n\nYour neighbour stole internet.... put a password on that shit \nIt's funnier to remotely shut down their computer with the message \"GTFO.\"\n\n*k I'll be on topic after this ;)*"},{"postId":18061,"topicId":2240,"posterId":112,"postTime":1301399361,"postText":"All I was saying is that he's a regular on jail and plays TTT occasionally. He even applied for mod, so I don't really think he would come on hacking. I've never heard a complaint against him before on either server and he doesn't have crazy traitor rounds. The hitboxes get really skewed while you are moving."},{"postId":18134,"topicId":2240,"posterId":619,"postTime":1301589060,"postText":"Even if I won the pistol duel I never shoot someone from faraway with a shotgun I lewer them in and them blow there head off when they dont look. sometimes that dosent even work and I get shot or caught."},{"postId":18165,"topicId":2240,"posterId":252,"postTime":1301616875,"postText":"-Snip-"},{"postId":18166,"topicId":2240,"posterId":142,"postTime":1301617166,"postText":"Talked to overclocking and he says he has no video and didn't claim that he did. Anyway I think an unban should be done now or accepted since no proof has been presented on the plate. Unless that guy or krystal has something more than his own seeing it then by all means post it but otherwise unban nyssie and lock this."},{"postId":18190,"topicId":2240,"posterId":2,"postTime":1301626429,"postText":"Unbanned."}]}