{"topicId":4061,"forumId":122,"topicTitle":"lolmaster","topicTime":1315612218,"topicViews":70,"topicReplies":3,"topicStatus":1,"topicFirstPosterName":"Bobdole","topicFirstPosterColor":"","topicLastPosterName":"Mark","topicLastPosterColor":"000099","topicLastPostTime":1315702369,"posts":[{"postId":32785,"topicId":4061,"posterId":1061,"postTime":1315612218,"postText":"Offender name?: lolmaster\nWhich Server?: TTT\nOffender's Steam ID?: STEAM_0:1:39245126 2\nWhat the Offender did?: RDM Beginning of round\nAdmins on?: No\nProof?: http://i53.tinypic.com/2j68fw0.jpg "},{"postId":32825,"topicId":4061,"posterId":1061,"postTime":1315635855,"postText":"He rdmed again Ask Player He is my witness"},{"postId":32826,"topicId":4061,"posterId":812,"postTime":1315636488,"postText":"In addition to your evidence Bob, here's mine.\n\nI knife a person in front of him, then start to shoot him. Me and him are directly facing each other, so he has ample time to read my name and identify me. I then run around the corner not to be killed. As he comes along the corner he went in the opposite direction as I, and immediately killed 02 who was also a traitor but not involved in the situation at all, as it wasn't a case where he didn't shoot me or anything. When I asked him about it he said it was a split second decision and \"kill or be killed\". \n\nNow I can understand that in some situations, but I was very noticeable in front of him especially with my Spotlight headwear, and 02 having a Turtle hat, even more distinct features aside from having DIFFERENT NAMES.\n\nNow of course I can see where he went wrong but he really shouldn't have jumped the gun rather than paying attention to clear details. So I asked him to slay himself, which he did, but in pre-round to be a smart ass. Then once the round had actually started he did not slay himself.\n\nHere is my proof:\n http://i162.photobucket.com/albums/t245/kennyd3333/lol3.jpg \n http://i162.photobucket.com/albums/t245/kennyd3333/lol2.jpg \n http://i162.photobucket.com/albums/t245/kennyd3333/lol1.jpg \n http://i162.photobucket.com/albums/t245/kennyd3333/lol4.jpg \n\n^That last one is the next round proving he did not slay himself."},{"postId":32916,"topicId":4061,"posterId":54,"postTime":1315702369,"postText":"banned."}]}