{"topicId":2617,"forumId":12,"topicTitle":"Why do we have pretty much every type of game banned?","topicTime":1304713738,"topicViews":90,"topicReplies":8,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1304720754,"posts":[{"postId":20997,"topicId":2617,"posterId":101,"postTime":1304713738,"postText":"Honestly, why not rename the gamemode to \"Simon Says of Death\" if we are going to ban half of the types of days."},{"postId":20999,"topicId":2617,"posterId":521,"postTime":1304714036,"postText":"Well zombie freeday was banned because the guards that were 10- would just shoot the prisoners anyway and the prisoners would bitch about it. Nobody ever followed rules.\nOpinion based games were banned because some people had different opinions than others, and some guards would just say they didn't like the prisoners item/thing because they didn't like the player, and then freekill them. All the other guards and prisoners would be like, \"But that stuffs amazing\" and the guard wouldn't care.\nFreedays are banned because.... No idea."},{"postId":21007,"topicId":2617,"posterId":3,"postTime":1304714882,"postText":"I'm against the banning of Opinion games... and that bull run thingie. (I WISH YOU'D RENAME IT THE BLOB THAT ATE EVERYTHING)"},{"postId":21008,"topicId":2617,"posterId":595,"postTime":1304715071,"postText":"I agree. Jail is getting bleh. I loved it thats why I donated. Now all my favorite days are banned. And if the guards hate them cause they get killed/slayed for freekill, why even call the day out? Warden might as well shuttup if hes going to cry. I disagree with this."},{"postId":21009,"topicId":2617,"posterId":634,"postTime":1304715148,"postText":"I wish I was there for a test of it, but I wish that it was allowed by the rules even more. If yo''ure going to limit the rules so much that you pretty much have a standard day everyday and the server becomes less fun."},{"postId":21010,"topicId":2617,"posterId":373,"postTime":1304715295,"postText":">> and that bull run thingie. (I WISH YOU'D RENAME IT THE BLOB THAT ATE EVERYTHING) \n\nI was playing the Bull Run with a server of filled with 8 people. It was fun on mars <3 \n\nOn hellz it's gay"},{"postId":21019,"topicId":2617,"posterId":521,"postTime":1304718645,"postText":"I was thinking of a game where the prisoners all gathered into one group and stacked and the prisoners that are on the outside die first, and the guards whiddle it down to 1 prisoner."},{"postId":21020,"topicId":2617,"posterId":112,"postTime":1304718911,"postText":"I like opinion days. I think to fix the rdming we should just have ONLY the warden kill, which is what is good for any game that's played.\n\nMy favorite day was joke day, even though some people got killed after warden laughed"},{"postId":21026,"topicId":2617,"posterId":373,"postTime":1304720754,"postText":"I have to csay \"Only Warden can kill\" Every fucking day because 4 people die during last reaction. \n\nTheir reaction after killing 4 people, \"wut\""}]}