{"topicId":2856,"forumId":105,"topicTitle":"Donations Alternative","topicTime":1306662074,"topicViews":61,"topicReplies":1,"topicStatus":0,"topicFirstPosterName":"TinfoilHatter","topicFirstPosterColor":"FF6600","topicLastPosterName":"TinfoilHatter","topicLastPosterColor":"FF6600","topicLastPostTime":1306662777,"posts":[{"postId":22933,"topicId":2856,"posterId":464,"postTime":1306662074,"postText":"So, the Goldcraft staff realised that it's a bit hard for most of you to make donations.\nI know PayPal is a bitch to deal with, especially as a minor, but we're in pretty deep, here.\n\nWe've received tons of interest in donating, but nobody's actually followed through on this.\nSince Goldcraft 2.0 opened, we haven't received a single donation.\nThis is a bit of a problem.\n\n Pirate, Kry and I had to pay entirely out of pocket for Goldcraft for the third month in a row.\nWe love you guys, but we can't keep doing this. It's just too expensive for the three of us to handle. \n\nWe think we've come up with a viable solution.\nTo make donating easier, we're allowing donation of the Bitcoin currency.\n\nMost of you likely don't know what Bitcoin is. Here's a video explaining it. \nIn a nutshell, it's a secure, constantly appreciating currency embraced by many due to its decentralised nature.\nTo get started, grab some coins from the Bitcoin Faucet  and find instructions on how to mine here. \n\n  Goldcraft's donation address in Bitcoin is 16yfFdrLYokwxvPep7FrrKs2sun6SmD4Qh.\nMake a transaction to this address in order to donate.\nMinimum donation is 0.05 BTC, but we'd appreciate more.  "},{"postId":22934,"topicId":2856,"posterId":464,"postTime":1306662777,"postText":"Use the following Donation Form, if you do donate.\n\n Minecraft Username:\nBitcoin address:\nAmount in BTC donated:   [Must be above 0.05 BTC]\n What you would like for your donation:  [Donator nametag, /lwc, other goodies]\n\nIf you want to help Goldcraft even more, it would help us if you'd fill out this additional, optional form.\nTthis isn't necessary to donate, but it'll help us mine more effeciently.\n\n Operating System:\nWhat Bitcoin miner are you using?  [Diablo, poclbm, puddinpop]\n What Bitcoin pool are you mining with?  [Slush, Mt Red, individual]\n What's your kHash rate?\nWhat's your GPU/CPU?\nHow long did it it take to mine the amount that you donated? \n\nAgain, Goldcraft's Bitcoin address is 16yfFdrLYokwxvPep7FrrKs2sun6SmD4Qh."}]}