{"topicId":3478,"forumId":1,"topicTitle":"E.Y.E Divine Cybermancy","topicTime":1312514785,"topicViews":119,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Domineeto","topicLastPosterColor":"","topicLastPostTime":1312647202,"posts":[{"postId":27794,"topicId":3478,"posterId":82,"postTime":1312514785,"postText":"If I bought 4 copies, would 3 others enjoy a deep, complex fps/rpg hybrid? I will give the game out for free for those who really are interested in the game :)\n\nAlternatively I will get this AND Frozen Synapse however, I wouldn't be giving my second copy away for free.\n\nEDIT: Please list any previous experience with FPS/RPG games like so:\nI have finshed Deus Ex, System Shock 2, Bioshock multiple times.\nI have played Borderlands, S.T.A.L.K.E.R Series, Fallout 3 and Fallout: New Vegas"},{"postId":27795,"topicId":3478,"posterId":634,"postTime":1312514957,"postText":"I'd play it. And love you forever <3. And as I think you already know, I'm a master at image editing/creating I could whip something up for you.\n\nEDIT: Check this out, I think you're really gonna like it.\nhttp://i877.photobucket.com/albums/ab332/Destar_01/Dom.png?t=1312515149\n\nEDIT: EDIT:\nBioshock 1 and 2\nBordelands\nS.T.A.L.K.E.R Series\nFallout 3 and Fallout: New Vegas\ndoes Oblivion count as a shooter?"},{"postId":27796,"topicId":3478,"posterId":856,"postTime":1312515250,"postText":"I would be interested, I checked out the screenshots and it looked pretty good. but...IDK\nEdit: Have played a bit of Borderlands as well.... and I guess thats only Fps/rpg game i've played. :\\\nI don't know if you mean just fps and just rpg but Im pretty sure you're talking about fps/rpg hybrids,so Only one I have played is borderlands."},{"postId":27810,"topicId":3478,"posterId":397,"postTime":1312519750,"postText":"ive played fallout 3 with all expansions\ni too would be interested if you like me ;_;"},{"postId":27826,"topicId":3478,"posterId":364,"postTime":1312522114,"postText":"I have also played Fallout 3 and Fallout: New Vegas. The latest dlc sucked. I also got borderlands... that also suked. Now I am playing Two Worlds Two(II), it's fucking awsome.\n\nI did play stalker., but never bought it for myself. Mainly, because it sucked.\n\nWhen skyrm, rage, Dead Island come out. I'll be able to add then to the list.\n\nAnd yes, I would like e.y.e"},{"postId":27869,"topicId":3478,"posterId":693,"postTime":1312572594,"postText":"I would absolutyly love a copy, as I'm a big fan of rpg/shooter hybrids. MY favorite games of all time are the Fallout series, particularly the latest few, and would play it for weeks on end.\n\nSome other favorites include Deus Ex, Bioshock, and Borderlands. Brink and the entire Elder Scrolls series as well if you're loose on your definition of RPG or FPS.\n\nIn addition, I'm also a big fan of anything Bioware makes, Mass Effect and Dragon Age being my favorites.\n\nI've played STALKER, and it wasn't BAD by any means, I just had trouble getting in to it. It wasn't really anything special IMO.\n\nLooking forward to seeing if Dead Island meets my expectations of a blend between RPG and FPS."},{"postId":27939,"topicId":3478,"posterId":517,"postTime":1312610757,"postText":"You have no idea how long ive wanted this game, an entire hour, id play it untill i beat it and love you forever, also deus ex, deus ex invisible war, all fallout games, all S.T.A.L.K.E.R games, borderlands (twice), all elder scrolls games and in the future skyrim human revo, and hopefully this *edit bioshock games"},{"postId":27950,"topicId":3478,"posterId":517,"postTime":1312614142,"postText":">> \nI did play stalker., but never bought it for myself. Mainly because it sucked  .       Youre off youre rocker mate that game is just amazing, at least with the complete pack i just loved every minute of that game"},{"postId":27969,"topicId":3478,"posterId":82,"postTime":1312641204,"postText":">> >> \nI did play stalker., but never bought it for myself. Mainly because it sucked  .       Youre off youre rocker mate that game is just amazing, at least with the complete pack i just loved every minute of that game \nI played for about 5 minutes at a time before exiting in fear, Stalker is scary!"},{"postId":27970,"topicId":3478,"posterId":517,"postTime":1312644006,"postText":">> >> >> \nI did play stalker., but never bought it for myself. Mainly because it sucked  .       Youre off youre rocker mate that game is just amazing, at least with the complete pack i just loved every minute of that game \nI played for about 5 minutes at a time before exiting in fear, Stalker is scary! \nYes i soiled my trousers a few times with stalker :3"},{"postId":27972,"topicId":3478,"posterId":82,"postTime":1312647202,"postText":"Well the sale is over, if I still have enough cash left for the next time it goes on sale I will probably get it, sorry guys :("}]}