{"topicId":2646,"forumId":22,"topicTitle":"Jihad Gun","topicTime":1304882991,"topicViews":146,"topicReplies":19,"topicStatus":0,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"__Crisis","topicLastPosterColor":"","topicLastPostTime":1304991870,"posts":[{"postId":21198,"topicId":2646,"posterId":79,"postTime":1304882991,"postText":"Wanted to suggest adding in a weapon that shoots a jihad out and blows up after 2-3 seconds after shot. Might sound op but make it cost 2 or 3 points in traitor menu to buy, and also make it so its a upgrade for 1000 points. Also as a bonus this would maybe be a 2 item buy. Another suggestion added in is making a Betrayl Gun for detectives, a 1 shot gun that insta kills costing 1 point, just like the traitor gun but for detectives. \n\nWould like them both to be shop items, either a 2 for 1 deal or both separate costing around 1k points each. Just think it be nice to get some special weps from shop as well.\n\nAnother idea is maybe a 2k point upgrade that makes the betrayl have 2 ammo instead of one. 1 shot per reload tho. Or make it so you have to spend another traitor point on another betrayl gun.\n\nSo overall:\nJihad Gun and Detective Betrayl - 1k points each or 1500 for a 2 for 1 package.\nBetrayl second shot - 2k point upgrade"},{"postId":21210,"topicId":2646,"posterId":397,"postTime":1304886558,"postText":"ive seen the betrayal on other servers for detective its a golden deagle only problem is if a traitor kills you they have that weapon and rape people with it"},{"postId":21211,"topicId":2646,"posterId":389,"postTime":1304886963,"postText":"Well I've seen the same.\n\nOn the other server I've played on, it was called the Golden Gun.\nJust like the betrayl, its for the detective. 1 shot 1hko (only if they are traitors)\nIf the player is innocent, they dont feel a thing.\n\nAlso in order to use it, the detective had to ask if they were allowed to shoot the player first."},{"postId":21212,"topicId":2646,"posterId":79,"postTime":1304887516,"postText":"i think having to ask is a bit meaningless. Just make it a 1 shot kill on everyone it hits regardless of inno/trait so you cant confirm what they are and if your wrong you rdm'd. If you had no reason to shoot and he was traitor its rdm. Dont have to ask for other guns, so y this one. But seems like people want detective betrayl. How about the other ideas i added in."},{"postId":21219,"topicId":2646,"posterId":373,"postTime":1304889648,"postText":"The Jihad-Firing gun probably wouldn't happen..  We used to have a jihad that could be strapped onto another player to detonate a bomb on them, like a jihad except\nit makes loud c4-beeps.  Forgot why it was removed :l"},{"postId":21224,"topicId":2646,"posterId":272,"postTime":1304890104,"postText":"No, no, no, NO."},{"postId":21235,"topicId":2646,"posterId":389,"postTime":1304895702,"postText":">> i think having to ask is a bit meaningless. Just make it a 1 shot kill on everyone it hits regardless of inno/trait so you cant confirm what they are and if your wrong you rdm'd. If you had no reason to shoot and he was traitor its rdm. Dont have to ask for other guns, so y this one. But seems like people want detective betrayl. How about the other ideas i added in.\n >> No, no, no, NO. \nAgreeing with Kobooold.... No, no, no, NO.\nYour really asking people to be rdmed.... these ideas are not only OP but completely retarded.\nTheres no fucking point in adding a betrayl (detective's version), if you make it 1 shot kill on everyone.\n\n\nSO NO NO NO NO NO NO NO!!!!!!\nI'm pissed off today...."},{"postId":21252,"topicId":2646,"posterId":634,"postTime":1304906225,"postText":"Detective Betrayal - Yes\n\nRanged Jihad - No\n\n1k points for 2 bullets in betrayal - Yes\n\n2 for 1 deals in the shop - No\n\n>> \\We used to have a jihad that could be strapped onto another player to detonate a bomb on them, like a jihad except\nit makes loud c4-beeps.  Forgot why it was removed :l \nThis seems awesome."},{"postId":21263,"topicId":2646,"posterId":397,"postTime":1304913612,"postText":">> The Jihad-Firing gun probably wouldn't happen..  We used to have a jihad that could be strapped onto another player to detonate a bomb on them, like a jihad except\nit makes loud c4-beeps.  Forgot why it was removed :l \n\ninstead of c4 beeps it should be the wtf boom sound, i would not be able to stop laugh/crylaughing X'D"},{"postId":21306,"topicId":2646,"posterId":79,"postTime":1304960017,"postText":"So you think the detective having a 1 shot 1 kill gun is OP. I dont see how, considering you have to hit with it and you wouldn't just shoot someone at random with it. Also, if detective dies with it, it gives traitors another weapon to use like every other gun. Whats the difference between a detective killing a traitor with betrayl and grabbin it while it has ammo and being able to buy his own. There is none, the Jihad Gun i don't think is OP if you make it cost 2 or 3 traitor creds to purchase because most the time, unless people are idiots. More then 2-3 arnt standing next to each other anyway."},{"postId":21309,"topicId":2646,"posterId":373,"postTime":1304965782,"postText":"There is NEVER going to be an item in the cmenu for more than one credit."},{"postId":21335,"topicId":2646,"posterId":389,"postTime":1304975835,"postText":"All I have to say for this Jihad gun is.... Its not even a jihad...\n\n\nAs for the Betrayl Detective's Version.... Great... A even better rdming weapon.\n\nex. Detective sees a called out innocent.\nDetective shoots him with the DGun (Detective Betrayl), and checks body. O shit hes innocent.\n\nor\n\nDetective: Hey are u innocent, ur suspicious.\nInnocent: I am innocent.\nDetective: BS\n*Detective shoots with DGun*\nDetective: FUCK he was telling truth.\n\nor\n\nDetective: Hi Crisis\nCrisis_: He-\n*Detective killed Crisis_ RDMed*\nDetective: He point his gun at my head for a long time now.\n\nor\n\nTraitor: Detective can you buy the DGun, I wanna see it\nDetective: Okay\n*Detective takes out the DGun*\n*Traitor kills and takes it*\nTraitor (Team): WOOT I GOT 2 Betrayls now!\n\nI'm guessing you want the last situation...."},{"postId":21341,"topicId":2646,"posterId":101,"postTime":1304977793,"postText":"Flame, how does that stop anything from something that would already happen?\n\nEx. Detective sees called out Innocent.\nDetective shoots him with a Mac10 and checks body. Oshit hes innocent.\n\nReally, how will a 1 hit kill weapon cause MORE RDM? If anything itll cause less."},{"postId":21348,"topicId":2646,"posterId":112,"postTime":1304979606,"postText":">> The Jihad-Firing gun probably wouldn't happen..  We used to have a jihad that could be strapped onto another player to detonate a bomb on them, like a jihad except\nit makes loud c4-beeps.  Forgot why it was removed :l \n\n\nIt was stolun ;-;"},{"postId":21350,"topicId":2646,"posterId":373,"postTime":1304980027,"postText":"Whaat? By who? I really miss it ;-;"},{"postId":21351,"topicId":2646,"posterId":389,"postTime":1304980853,"postText":"Cause its 1hko on everyone. \nWhat happens if u miss and hit the other guy?\nThat be so pointless. It shouldnt be 1hko on everyone if anything. I dont even know anymore.\n\nI've always thought Detective was more of a support kind of thing. Innocents are support and defensive. Then Traitors are offensive.\n\nIn that case, Detectives shouldn't need something so offensive. Detectives only have 2/3 weapons and rest is to help find the traitors. or. help innocents and potentially traitors."},{"postId":21359,"topicId":2646,"posterId":521,"postTime":1304983794,"postText":"What about the golden gun? Kills them if theyre traitor and does nothing if theyre not."},{"postId":21368,"topicId":2646,"posterId":79,"postTime":1304986625,"postText":"If the golden gun does no dmg to innocents, detectives will just go around shooting someone they think is a little suspicious. It would cause too much trouble because they wouldn't be afraid to just shoot it at first person they see. It has to 1 shot anyone it hits or not be added at all. Those are only 2 options that would make it legit and fair to all."},{"postId":21369,"topicId":2646,"posterId":521,"postTime":1304988220,"postText":"What if the det shot someone and they were traitor it killed them, and if they shot an inno it did 50 dmg to the det?"},{"postId":21400,"topicId":2646,"posterId":79,"postTime":1304991870,"postText":"If u did that, then the betrayl would ALSO have to do only 50 dmg to traitors. Cant have one be one way and other be another. Either make both betrayl for traitor and detective kill both 1 shot, or have them both only hurt allies by 50 dmg."}]}