{"topicId":708,"forumId":14,"topicTitle":"Unban, I got banned for an admin raging.","topicTime":1283107180,"topicViews":102,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"Harper","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1283119336,"posts":[{"postId":6367,"topicId":708,"posterId":234,"postTime":1283107180,"postText":"When posting a unban request please follow this template\n\nYou can just read this post.\nIt pretty much sums up what happened.  http://nonerdsjustgeeks.com/forum/viewtopic.php?f=3&t=707 \n\nYour In-Game name: Harper\nYour Steam ID: STEAM_0:1:9830862\nReason: I honestly have no idea. Im pretty sure he just raged.\nLength of Ban: I have no idea.\nWho banned you?: Dum\nWhy should we unban you?: The admins obviously a 15 year old kid that was raging. He RDMed some guy, got pissed that we killed him with the detect when he was trader. I was explaining about why we killed him, told him we had complete proof. Then he straight up mutes me. So i say \"Oh wow, another gmod server with shitty 14 year old admins\" Then. My screen goes black, I restart gmod and it says Im banned.\n\nIf you honestly condemn this clearly stupid abusing shit, then this server is not worth anyones time. Abuse is posted all across the forum, and half the time its right."},{"postId":6373,"topicId":708,"posterId":112,"postTime":1283108818,"postText":"Okay.. where to start...\nFirst off: Dum isn't admin.\nSecond: You need to calm down before posting\nThird: No need to make two posts\nFourth: His age shouldn't matter\nFifth: He can't use quit on you\n\nPlus, Dum doesn't \"rage\" and ban people because he feels like it. He can only voteban, that means more than half the server thinks you should be ban. Lern2notlie?"},{"postId":6374,"topicId":708,"posterId":4,"postTime":1283109177,"postText":"I was the one who banned you.\nWhen i logged on the server, all i saw was a big fight between you and him.\nI trust Dum enough to know that he will always follow the rules and enforce them with any power he has.\nCurrently, he is a vip which means he cannot ban, which is why i did.\n\nYou were banned for an hour for insulting a VIP, insulting the server, and i checked the logs before i banned you. Every other kill was a teamkill. The hour ban was in hopes that you could calm down and rejoin later. It seems you never got to the \"calm down\" part."},{"postId":6387,"topicId":708,"posterId":234,"postTime":1283111986,"postText":"lol what a bunch o fags"},{"postId":6388,"topicId":708,"posterId":112,"postTime":1283112929,"postText":"Sounds like you know how to write a convincing unban request."},{"postId":6393,"topicId":708,"posterId":153,"postTime":1283119256,"postText":"Raging doesn't help.\nYou didn't provide good reason to be unbanned.\nLocked and Denied."},{"postId":6396,"topicId":708,"posterId":4,"postTime":1283119336,"postText":"Uh. he was banned for one hour.\nhis ban expired like 5 hours ago >.>\n\n(locked again)"}]}