{"topicId":72,"forumId":12,"topicTitle":"Re: Im apparently going to get permabanned from every nnjg server.","topicTime":1272689829,"topicViews":200,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1272739173,"posts":[{"postId":557,"topicId":72,"posterId":26,"postTime":1272689829,"postText":"He says hes going to pursuade bird, into pursuading ben into permabanning me from every NNJG server there is.\n\nyou ask why?\n\nWe were playing jail with other people, I said i didnt want anyone out of the cell room or else they die, Joker fucked around, he died.\n\nBIRD kept on giving him weapons and shit, Which i was getting sick of, then bird started to noclip while invis and kill people, then one round he mauled everyone.\n\nI called admin abuse, and told him to knock it the fuck off.\n\nthen in later rounds, Swine/joker started to spawn miracualously with strange weapons, such as machine guns/ a famas, Im not sure if this was part of map, but im pretty sure it was bird seeing as it stopped when he left.\n\nHe then proceeded to say hes going to get me permabanned off of every server, and complained that i wasnt following rules, Which i was\n\nHe claimed free killing - I faught back by saying i exclaimed 3-4 times that if anyone passed the cell door, they die. + He almost never followed orders: Once this other guard foolishly gave him a gun, as it was his last request, i ordered him to give it back for well over 2 minutes, he refused every time, I eventually told him give it back or you will die, he refused, i counted to 3, then killed, HE RAGEQUITTED, blocked me and told my friend to tell me hes working on the ban.\n\n\nHe claimed not following Last Request rules - I admit, sometimes i turned them down if it was ridiculous, like (Guards cant kill me,give me a famas (which i cant spawn) but i did if asked gave weapons, but if they armed and took it out, i would kill, Line up on wall (i did do these, but since non-specific i stopped immediatly after) or \"Let me kill a guard\") And most of the times, i accepted them, But this other guy (Catnorak) kept freekilling in mid LR/before it.\n\nHe then said its an RP so i should act like its real, i countered this by saying yes, But if i were in a jail, why would i let prisoners that may or may not be armed roam freely anywhere in a jail? that at any point could kill me instantly.\n\nAs this other play said \"He's probobly some kid that gets butthurt every time he doesnt get his way\".\n\nExpect him trying to get me banned soon.\n\n\n\nACTUAL LOG:\n\nNever tell your password to anyone.\n[NNJG]✮J◎KΣя KiiиG✮â„¢: bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]RainRain: I will block,\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]✮J◎KΣя KiiиG✮â„¢: : bitch unmute so i can respond to u when u tak to me\n[NNJG]RainRain: Type.\n[NNJG]✮J◎KΣя KiiиG✮â„¢: do i give a fuck i will get u perm banned from every NNJG server\n[NNJG]✮J◎KΣя KiiиG✮â„¢: um... first breaking rules excecive blocking\n[NNJG]✮J◎KΣя KiiиG✮â„¢: need me to go go for\n[NNJG]✮J◎KΣя KiiиG✮â„¢: free\n[NNJG]✮J◎KΣя KiiиG✮â„¢: killing\n[NNJG]✮J◎KΣя KiiиG✮â„¢: what else\n[NNJG]✮J◎KΣя KiiиG✮â„¢: not alowing last request\n[NNJG]✮J◎KΣя KiiиG✮â„¢: not in those extentsd\n[NNJG]RainRain: are you listening to me at all?\n[NNJG]✮J◎KΣя KiiиG✮â„¢: u say oh u have ability  to shoot stop  twisting there request\n[NNJG]RainRain: Free killing - I said if anyone passed the gate, they die\n[NNJG]RainRain: LR - That was catnorak.\n[NNJG]✮J◎KΣя KiiиG✮â„¢: exactly u cany tell them that\n[NNJG]✮J◎KΣя KiiиG✮â„¢: its threttining\n[NNJG]RainRain: i did.\n[NNJG]✮J◎KΣя KiiиG✮â„¢: its RP\n[NNJG]✮J◎KΣя KiiиG✮â„¢: u have to act like real life\n[NNJG]RainRain: Its an rp, Prisonors have to folow gaurds ordors\n[NNJG]RainRain: OK, if you owned a jail\n[NNJG]RainRain: You would allow prisonors that may or may not be armed\n[NNJG]RainRain: pass straight anywhere\n[NNJG]RainRain: in the building\n[NNJG]RainRain: literally passing by you\n[NNJG]RainRain: with the easiest possibility\n[NNJG]✮J◎KΣя KiiиG✮â„¢: so do u wanna b baned or not cuh if i want ill jus keep persuading Bird  to talk ben into perm banning you u are supposed to have fun on this like a fuckin fun day once in a while where u go out side but no u use back wall rule every time its in rule **not allowed to use back wall every time and last request is all ways a ywes thats y its a request\n[NNJG]RainRain: Thanks for the log.\n\n\nHe said in voice that just because hes friends with admins, he can become admin when his staff appli finishes, or ban me\n\n\n\nBY CELL DOOR, I MEAN THE DOOR LEADING TO THE REST OF THE AREA, THEY CAN LEAVE THE CELL, BUT NOT THE CELL AREA TO EXECUTION ROOM/OUTSIDE"},{"postId":559,"topicId":72,"posterId":153,"postTime":1272716021,"postText":"I'll make sure this is addressed. Next time, type condump in console. It will save a log of the console automatically. Then upload it here so I can look more into it.\n\nBen"},{"postId":562,"topicId":72,"posterId":2,"postTime":1272729956,"postText":"If/when he posts a ban request, then post this. And you will only be banned if we have reason for it. If what you say is true, you should\nnot be banned. But take screenshots, anyone can edit condumps."},{"postId":565,"topicId":72,"posterId":3,"postTime":1272732888,"postText":"RainRain, I gave him weapons one time. The rest you can spawn with.\n\nAlso\n\nHow long after I left did this happen?"},{"postId":566,"topicId":72,"posterId":4,"postTime":1272733544,"postText":"I don't think the guy will be posting a ban request or even looking further into this, i can tell just by the way he types, he will forget about it in a few hours.\nAnd also, is the \"no backwall continuously\" rule still in effect?"},{"postId":568,"topicId":72,"posterId":2,"postTime":1272735577,"postText":"Yes"},{"postId":570,"topicId":72,"posterId":153,"postTime":1272739173,"postText":"Remember if for some reason you do get permabanned from all the NNJG servers, you can always post an unban request. These are top priority to us. \nAlso, I think we are done with this topic. Locked."}]}