{"topicId":2364,"forumId":22,"topicTitle":"Downloading maps","topicTime":1302755612,"topicViews":92,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"TinfoilHatter","topicFirstPosterColor":"FF6600","topicLastPosterName":"TinfoilHatter","topicLastPosterColor":"FF6600","topicLastPostTime":1302826961,"posts":[{"postId":18929,"topicId":2364,"posterId":464,"postTime":1302755612,"postText":"Is someone willing to create a .rar or torrent of their maps folder?\nI'm new, so I'm missing a fuckton of the maps you all have already downloaded.\nBeing kicked because of !RTVs sucks since a good number of the maps don't auto-download.\n\nCan someone upload their maps?"},{"postId":18931,"topicId":2364,"posterId":2,"postTime":1302757064,"postText":"All the maps automatically download."},{"postId":18933,"topicId":2364,"posterId":389,"postTime":1302758081,"postText":"I think he means.... (gonna use my previous experience in puzzle mod)....\n\n\nI try to join and download the map. BUT SOMEONE KEEPS CHANGING IT SO I CANT DOWNLOAD IT!!!! D:< \n\n*cough* Gash *cough*\n\nbut in this case, people rtv too fast??? even though it takes 10 minutes to rtv??? o.o"},{"postId":18934,"topicId":2364,"posterId":2,"postTime":1302758168,"postText":"Slow computer or internet?"},{"postId":18938,"topicId":2364,"posterId":464,"postTime":1302763522,"postText":"For me, the maps do the weirdest sorts of things:\nThe server boots me, says it's downloading the map, and it takes about the same amount of time one would expect it to take.\nWhen it's done downloading, it tries to download the cache, and says the map is missing.\n\nEven though I JUST downloaded it in GMod not 10 seconds ago, it's missing.\nMy maps folder doesn't show it, either. It's stranger than all hell.\n\nThat being said, someone should put up a torrent or an upload of our maps, regardless of my loading problems.\nIt means someone can leave the download open when they leave for work/classes, then play uninterrupted when they get back."},{"postId":18939,"topicId":2364,"posterId":373,"postTime":1302764461,"postText":"This has also been happening to me, forcing me to manually find the map on fpsbanana and download the rar from there .-."},{"postId":18954,"topicId":2364,"posterId":4,"postTime":1302796781,"postText":"Try this. \nAssuming it works properly, it should ask you for a password. Just type in \"tinfoilmapper\"\n\nI recently formatted, so i might not have all the maps..."},{"postId":18975,"topicId":2364,"posterId":464,"postTime":1302826961,"postText":"Kry, you are a god."}]}