{"topicId":2036,"forumId":24,"topicTitle":"Any other Applegeeks?","topicTime":1299120330,"topicViews":78,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"TinfoilHatter","topicFirstPosterColor":"FF6600","topicLastPosterName":"Pirate43","topicLastPosterColor":"FF6600","topicLastPostTime":1299209273,"posts":[{"postId":16689,"topicId":2036,"posterId":464,"postTime":1299120330,"postText":"Seems as if most of NNJG is insanely anti-Apple.\nI don't wanna start a flamewar about which OS or hardware set is better, cause nobody's gonna change anybody else's mind.\nJust want to see if there are any other Applegeeks here.\n\nGeneral Apple discussion, I guess.\n\nI've got an iPod Touch 2G 16GB, MBP 17\" Mid-2009 10.6.6, a smashed iPhone 4 that a friend found in the street, and a couple USB-bootable Hackintoshes.\n\nIf Apple posts the goddamn link soon, I will have an iPad 2 32GB Wi-Fi come the 11th.\nIf they don't, I'm standing in fucking line for 9 goddamned hours.\n\nAnybody else watch the keynote?\nJobs looked healthier than I've seen him in a while. =)"},{"postId":16691,"topicId":2036,"posterId":557,"postTime":1299120810,"postText":"I've been on an apple before and I must say they are not bad, but not entirely for gaming. I personally like Windows and have been using it for years, and apple with safari and other crap would be sort of confusing for me, even though I've used on before."},{"postId":16737,"topicId":2036,"posterId":456,"postTime":1299209273,"postText":" Personally, I dislike apple computers because they are overpriced. I also dislike the OS because it's confusing and discompatible <--- yes, that's a word, discompatible with most games. I also dislike the lack of hardware compatibility, and the general community of old people who believe themselves to be computer literate. Also, if it breaks, hurray, go get a new one as you are fucked. Finally, need an adapter? Yay! Time to go spend 10x their worth for an apple compatible one!\n\nAlso, it rather pisses me off that a company that tries to screw over its customers becomes this successful. It's absurd and defies any and all business logic. \n\nI have nothing against the iPhone and iPod Touch. They are marvelous pieces of machinery, and do their job quite well. About the OS, the company, and their computers, well, you will have to highlight the text in white. That is all."}]}