{"topicId":3840,"forumId":3,"topicTitle":"Hypothetical Scenario","topicTime":1314561560,"topicViews":99,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"CoreyW.Rogerson","topicLastPosterColor":"","topicLastPostTime":1315697083,"posts":[{"postId":31172,"topicId":3840,"posterId":634,"postTime":1314561560,"postText":"Frank, Steve, Joe, and Bob are playing TTT.\nBob is the traitor, the rest are innocent.\nFrank traitor baits Steve.\nSteve kills Frank.\nJoe kills Steve for killing Frank\nDid Joe RDM?\n\n\nEDIT: Thanks Tin"},{"postId":31174,"topicId":3840,"posterId":464,"postTime":1314562134,"postText":"That depends on Joe's intent.\nThis is also assuming you meant that Frank kills Steve, instead of Frank being killed twice.\n\nIf Joe killed Frank under the belief that Frank was a Traitor for killing Steve, he didn't RDM.\nIf both Frank and Steve were proven earlier, and Joe thought he was stopping an RDMer, he didn't RDM.\nIf Joe killed Frank for revenge for T-baiting, he RDM'd, but the punishment should be minimal."},{"postId":31178,"topicId":3840,"posterId":101,"postTime":1314562956,"postText":"Nobody could really be proven innocent. The most common situation would be\n\n\"If Joe killed Frank under the belief that Frank was a Traitor for killing Steve, he didn't RDM.\"\n\nTin is right. So usually, this isn't RDM."},{"postId":31198,"topicId":3840,"posterId":605,"postTime":1314569812,"postText":"Although, in my experience, if its just 4 players, no one really cares, and its just mess around type of rounds... had it often were with just 4 players, one dude would buy rocket jumps for nigh everyone, and wait till everyone dies by fall damage. :O!\nNow, if your stating that those 4 are playing in a full server or something, then ya, normally, Joe would think Steve is the T unless he actually witnessed the tbaiting himself, then it depends on who he is, as some people would still think its a T act to kill a tbaiter, while some would think the tbaiter got what he deserved."},{"postId":32888,"topicId":3840,"posterId":1061,"postTime":1315691949,"postText":"Why put Bob D:"},{"postId":32903,"topicId":3840,"posterId":612,"postTime":1315697083,"postText":"Do not post/ bump old topics"}]}