{"topicId":4666,"forumId":22,"topicTitle":"Banana.","topicTime":1319681067,"topicViews":149,"topicReplies":20,"topicStatus":0,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Destar","topicLastPosterColor":"","topicLastPostTime":1320105918,"posts":[{"postId":36470,"topicId":4666,"posterId":4,"postTime":1319681067,"postText":"Like Jihad bomb in the sense that it has a playing animation and then an effect.\nThe playing animation is the player eating the banana, and the effect is dropping the banana (which then switches you to your next weapon)\nTraitor item, type: weapon, 1 use, can be bought once.\n\nOnce the eating animation is played (same amount of time as jihad animation), the banana is dropped. the location in which the eating animation stopped playing (we'll call it the \"drop point\") is going to act as a slip zone for the next 15 seconds. That means that any innocent terrorists that step within a reasonable amount of distance from the drop point will temporarily become ragdolls for another 15 seconds, as if they had just \"slipped on a banana peel.\" every time another person slips, if someone has already slipped, their timer will be reset as the second slipper begins. Example: You walk where a traitor has used it and become a ragdoll. After 14 seconds, someone goes to identify your \"corpse\" and they slip. You have to wait another 15 seconds until you get up, so in total, you will be on the floor for 29 seconds, while the second guy will be on the floor for 15. the effect of the slip zone will only last for 15 seconds, so if a third person arrives 5 or so seconds after the second person falls, they won't fall as well because the timer has well exceeded 15 seconds.\n\n\npros: gives traitors time to position themselves so they can be ready to wipe out multiple people when they turn back from a ragdoll.\nimagine: one person slips, someone goes to identify their body. Slip. And so on. There is an eating sound accompanying the eating animation, so a traitor wouldn't just be able to go into a crowd of people and use the item without being noticed. the model of the weapon would be a banana, of course.\n\n\nSorry about this post by the way, usually i would take time to organize it and make it pretty with an actual bullet list and pretty color coding and such. Too lazy.\nAnd i know it's silly."},{"postId":36471,"topicId":4666,"posterId":82,"postTime":1319681716,"postText":"This needs to be in TF2"},{"postId":36476,"topicId":4666,"posterId":237,"postTime":1319687691,"postText":"This sounds awesome."},{"postId":36478,"topicId":4666,"posterId":605,"postTime":1319691415,"postText":"If this were to come into the game, I probably wouldn't stop laughing ;~;"},{"postId":36488,"topicId":4666,"posterId":1094,"postTime":1319694229,"postText":"Would the people caught in it show up as unid'd or what?  Sounds hilarious though, I can just imagine people buying these nonstop for a while if/when it comes out and just throwing them around and watching the people slide.  Ragdolls are too funny."},{"postId":36495,"topicId":4666,"posterId":1142,"postTime":1319697542,"postText":"You stole this idea from mindblast.org"},{"postId":36497,"topicId":4666,"posterId":634,"postTime":1319716429,"postText":">> You stole this idea from mindblast.org \nhttp://www.mindblast.org/forum/index.php?/topic/86-suggestion-thread/page__p__712__hl__banana__fromsearch__1#entry712\n\nDid mindblast ever actually implement it?, it still sounds really fun."},{"postId":36503,"topicId":4666,"posterId":272,"postTime":1319720036,"postText":"The ragdolls may be mistaken for dead people, so there should be a sound played when they slip. And reduce from 15 seconds to 10."},{"postId":36508,"topicId":4666,"posterId":769,"postTime":1319725615,"postText":">> The ragdolls may be mistaken for dead people \nThat's the point, so other people see the body and try to identify it, resulting with them on the ground as well"},{"postId":36509,"topicId":4666,"posterId":612,"postTime":1319729222,"postText":"But make it gag the players. So they can't tell where it is"},{"postId":36510,"topicId":4666,"posterId":1094,"postTime":1319731036,"postText":"Would more than one be able to be in effect at a time? And it wouldn't affect traitor buddies, correct?  I can just imagine a traitor team of regulars all buying one and covering as large an area as possible and just mowing down the poor ragdolls.  It'll be great."},{"postId":36516,"topicId":4666,"posterId":634,"postTime":1319742323,"postText":">> Would more than one be able to be in effect at a time? And it wouldn't affect traitor buddies, correct?  I can just imagine a traitor team of regulars all buying one and covering as large an area as possible and just mowing down the poor ragdolls.  It'll be great. \nRagdolls are invincible I think.\nIt should have effect on traitor teammates.\nI don't see why more than one would not be able to be active at the same time.\nIt takes time to uses and plays a noise along with a custom animation, making someone very obvious."},{"postId":36527,"topicId":4666,"posterId":2,"postTime":1319745529,"postText":"I can just see this causing problems when players get out of their ragdoll form... What if someone intentionally stands over/on the ragdoll, causing them to get stuck when the player is finally able to move? \nWill the ragdoll be able to take damage? For example, I could shoot someone and run to a small hallway. Usually, because of this, a few people (if not just the person who I shot) will run after me. After going through the first door by the entrance to the hallway, I eat a banana, causing anyone to go through the door to slip and turn into a ragdoll. Would I be able to shoot the ragdolls and gain kills? If not, what if someone were to use this as a way to exploit the map, and get into places they normally can't? This with use of the prop rod could result in players getting far outside the map, and also have players die from fall damage if they were to toss them off of some place or just shoot them into the air a few seconds before their time is up. If they don't take damage, or even just fall damage, they could very easily get to the bottom of a few maps, such as epic_city4 or de_kakarikovillage. If they do take damage, this would be more of a very simple way to gain kills by shooting players who are defenseless than an inconvenience to the players who didn't see it coming.\nWould the banana not affect traitors? Or would the \"slipping\" take effect a few seconds after the person who uses it moves away?"},{"postId":36530,"topicId":4666,"posterId":4,"postTime":1319747485,"postText":">> You stole this idea from mindblast.org \nI've never visited that website in my life. \nAnd fuck, i thought i was being original. Also, they are partially different, i did not suggest a health boost when the banana has been eaten-This is what the health vial is for.\n\n>> Would the banana not affect traitors? Or would the \"slipping\" take effect a few seconds after the person who uses it moves away? \nSince the effect of the item doesn't actually cause any damage by itself, the option of it being able to affect traitors could be easily debated. I was thinking that normally, traitors would be affected by it, so that it becomes like a jihad bomb in the sense that traitors use tchat to tell their buddies that they are about to use it, but a 500 point upgrade so that they don't get affected by it would be available in the shop.\n\nYou might say, \"Why would traitors need to warn their T buddies that they are about to use it if it doesn't cause any damage?\nWell...\nWithout upgrade: Traitor is immobile for 15+ seconds which is an inconvenience to them and any plans they might be collaborating with their buddies.\nWith upgrade: If witnessed crossing discovered slip zone without falling, traitor can be called out.\n\n And i was thinking more along the lines of the ragdolls not taking damage. \n\n-----------------------------------------------------\n\nThe only counter-argument that i can provide to what you said about the possibility of map exploitation with this item is the rules. Unless you can somehow code the ragdolls to not be affected by the magneto rod&stick, the only way to fight back against said exploitation would be moderator enforcement."},{"postId":36783,"topicId":4666,"posterId":1109,"postTime":1320040730,"postText":"not only would i be cracking up the whole time, but it sounds like an awesome weapon\nso u turn into a corpse when u slip, but u come back after timer?   \nstep one, lube up ground\nsetp 2, block T trap exit\nstep 3, let good amount of innos bunch up\nstep 4, laugh evily and close the door >:D"},{"postId":36822,"topicId":4666,"posterId":1094,"postTime":1320093701,"postText":">>  And i was thinking more along the lines of the ragdolls not taking damage.  \nSo it's more of a incapacitating weapon for getaways than a trap for murdering innocents then?  I suppose it would be unfair if you trapped a mass number of people then murdered them with literally no ability whatsoever to fight back."},{"postId":36826,"topicId":4666,"posterId":4,"postTime":1320094926,"postText":">> >>  And i was thinking more along the lines of the ragdolls not taking damage.  \nSo it's more of a incapacitating weapon for getaways than a trap for murdering innocents then?  I suppose it would be unfair if you trapped a mass number of people then murdered them with literally no ability whatsoever to fight back. \nExactly, would be op."},{"postId":36841,"topicId":4666,"posterId":101,"postTime":1320102076,"postText":"Still. Banana+Jihad=Rape."},{"postId":36848,"topicId":4666,"posterId":1087,"postTime":1320104367,"postText":"No it's..Banana + Teleporter + C4\n So hand inno a Tele, he/she uses it, slips, c4 tiems down. un-dolls then boom!"},{"postId":36849,"topicId":4666,"posterId":4,"postTime":1320105458,"postText":"I was thinking more along the lines of banana in middle of spike room.\nSee? If used intelligently, can be powerful. Otherwise, it doesn't cause any damage by itself."},{"postId":36850,"topicId":4666,"posterId":634,"postTime":1320105918,"postText":">> I was thinking more along the lines of banana in middle of spike room.\nSee? If used intelligently, can be powerful. Otherwise, it doesn't cause any damage by itself. \nBanana on the edge of the cliff in gm_cliffhanger would be crazy. Wait, ragdolling off the cliff in cliffhanger? Why does that sound familiar? xD"}]}