{"topicId":4597,"forumId":35,"topicTitle":"Bobdoyle Jail Mod","topicTime":1319168036,"topicViews":130,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"Bobdole","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1319251903,"posts":[{"postId":35972,"topicId":4597,"posterId":1061,"postTime":1319168036,"postText":"1) What position are you applying for:Jail Break\n2) Your age:13\n3) Your location:CA,USA\n4) Current In-Game Name: Bobdoyle\n5) Steam ID & Link to your Steam Community Profile:STEAM_0:1:17110879,http://steamcommunity.com/id/xdustinx199\n6) Tell us about yourself:I Like To play NNJG I Hang Out With Friends as a Hobby Im 13 And Im Confident in myself Sometimes\n7) How did you find out about NNJG:Myself\n8) How long have you been involved with NNJG and/or Shadow's servers:Couple Months Like 6 or 5 Months Now :D\n9) How long have you been a registered user on Steam:Hmmm Cant Remeber i think in 2008 i registered\n10) What you can bring to the NNJG Team:Less Ragers(QQERS),Happiness, No Disrespect (i can try to make people not disrespect)\n11) Why do you want to be part of the NNJG Team:Because I always wanted to be Something Part Of NNJG I like want to know other People More Better as a Mod/Admin\n12) Do you have any past experience with the position you're applying for:Yes and if u want to know i've been Mod/Admin In Flood,TTT,Zombie And Jail for like a week.. until someone like ddosed it forever\n13) Have you ever posted a ban request, and if so, was it accepted:yes i posted Like 8 Ban request And 7 out of 8 of them got Accepted\n14) How often do you play on an NNJG server:Pacific Time Weekdays 4pm-10pm Weekends 4pm-12 am\n15) Do you own a decent microphone, and do you frequently utilize it:i own a decent Mic and i use it alot Until someone Says Its annoying so i stop \n16) How fast/well can you type:Well I did a Computer Test At my school and One of my teachers says i did 80 words per minute? Sometimes 50 Don't know why\n17) What is your favorite and least favorite aspect of NNJG:My Favorite is people using the right powers for NNJG my least favorite is People Abusing it \n18) Any other comments or information you can provide:ill try my best To make Jail Break as Fun as possible if i am possibly Mod\n http://i56.tinypic.com/e5s8wm.png  \n http://i51.tinypic.com/148hpxv.png "},{"postId":36023,"topicId":4597,"posterId":153,"postTime":1319241782,"postText":"Sorry, but I don't think you've ever played jail before the apps opened.\nIn addition, you seem to think 14 comes after 14..."},{"postId":36047,"topicId":4597,"posterId":115,"postTime":1319251903,"postText":"This is insulting. You dont even play a minute of jail, and yet you decide to apply? \n\nDenied."}]}