{"topicId":48,"forumId":30,"topicTitle":"Important!!!! [NNJG] Jail - What do YOU want?","topicTime":1272161292,"topicViews":622,"topicReplies":30,"topicStatus":0,"topicFirstPosterName":"[NNJG]Ben","topicFirstPosterColor":"000000","topicLastPosterName":"MarioDJW","topicLastPosterColor":"990000","topicLastPostTime":1293759372,"posts":[{"postId":323,"topicId":48,"posterId":153,"postTime":1272161292,"postText":"We need players. What we want is people to ALWAYS be on our servers. But first, we need people to join on their own. There is one way to do this. We need to add things that other servers don't have. For instance, Night Jail, A Shiny New HUD, and the Weapon Scanner. I need YOUR suggestions, so list them below ;)"},{"postId":327,"topicId":48,"posterId":12,"postTime":1272162659,"postText":"Go read the night jail post for what I think of that.\nAs for shiny new things... I recently found a post on garrysmod.com of an addon that creates headshakes to make it more real. \nAlso we need gaurds who actually have a mic and don't just kill of prisoners... That's gay as f***\numm I guess a few more guns wouldn't hurt?\nAlso a decent map rotation since one map does get boring. \nSometimes I wish the chance for prisoners to get special start items to be better but that's not up to me.\n\n*irrelevant\nno refunds for staff!! Post here or message me your recommendation!*"},{"postId":331,"topicId":48,"posterId":4,"postTime":1272164396,"postText":"a head guard, that has a remote to open/close cells anywhere/anytime\na better diving board\na volleyball field and bouncy ball in courtyard?\na wall that can be broken to lead you into falling into a part of the courtyard (in one of the cells) 1% chance of a prisoner spawning in that cell\nmore things in the cafeteria\n\npossibly a day to night rotation for the sky and lights as bird suggested...\nhandcuffs?\n\n:l\n\nand yes, the no mic no orders thing too"},{"postId":334,"topicId":48,"posterId":153,"postTime":1272164803,"postText":"Bird and I have talked about that. If we wanted to make it JailRP, we could add a Warden, Guards, and Gangs. It would be a real-jail simulation. If we need it, Non-Toxic has been bugging me that he needs $, so I'm sure he'd code it."},{"postId":337,"topicId":48,"posterId":12,"postTime":1272200248,"postText":"Kryzoid makes some good points. I could aloe add to the cell idea that if they get that they spawn with a spoon and have to dig their way out :D also if it was possible and I'm srenit is I could make a map that when they get to an \"escape point\" the round ends with a message saying the prisoners have escaped. But of course there would be booby traps!\n\nAnother thug a guard only voice chat to discuss ways of conducting the round"},{"postId":341,"topicId":48,"posterId":3,"postTime":1272214843,"postText":"I also noticed that the Disguise kit was never finished, I can finish it."},{"postId":343,"topicId":48,"posterId":4,"postTime":1272217345,"postText":">> Bob Dole\":16v29p88]\nI also noticed that the Disguise kit was never finished, I can finish it.\n \n\nOMFG YES"},{"postId":344,"topicId":48,"posterId":12,"postTime":1272225719,"postText":"isnt that ttt not jail?..."},{"postId":345,"topicId":48,"posterId":4,"postTime":1272229640,"postText":"Nope.\nOn jail, if you're a prisoner and are lucky enough to spawn with the disguise kit, once you use it you can appear as another guard :D"},{"postId":346,"topicId":48,"posterId":12,"postTime":1272231678,"postText":"Oh o have nver gotten it."},{"postId":347,"topicId":48,"posterId":3,"postTime":1272232486,"postText":"Because it's not finished, it's not a random spawn."},{"postId":348,"topicId":48,"posterId":12,"postTime":1272238023,"postText":"lol. And bird... I just tasted the cake :D"},{"postId":488,"topicId":48,"posterId":25,"postTime":1272576810,"postText":"ive seen on alot of servers that it says 30 people are in the server but there only like 5 people ifu make it say 30 when u want u could generate more people or maybe make new skins for guns and stuff like a dildo or that u can hit with someone and make them jump or like new payer models like Jail suits and maybe more things to do in your jail cell or u could make ncps like they have in  Rp and u can click on them and like buy food druggs etc. and u can make skins of those"},{"postId":597,"topicId":48,"posterId":12,"postTime":1272769141,"postText":"Sounds compicated but interesting. Cool ideas!"},{"postId":605,"topicId":48,"posterId":4,"postTime":1272773221,"postText":"Dildos are courtesy of Bob Dole."},{"postId":612,"topicId":48,"posterId":3,"postTime":1272808727,"postText":"lolwut, Stop suggesting that kryzoid"},{"postId":626,"topicId":48,"posterId":12,"postTime":1272854239,"postText":"Lolz or is it just you kryzoid. And I beleive dildos would be \"inaproriate\" for the little tards that play gmod.  Lol I jus remembered I have a drildo ingmame lol"},{"postId":1080,"topicId":48,"posterId":11,"postTime":1273716161,"postText":"Lol Drildo? Ummm Hellzprision is getting kinda old. How bout a new map just as good as Hellzprision."},{"postId":1082,"topicId":48,"posterId":12,"postTime":1273716272,"postText":"Ben was looking at other ones and then changed it back"},{"postId":1085,"topicId":48,"posterId":153,"postTime":1273716864,"postText":"I have MUCH BETTER ONES. I just need figure out why FastDL isn't working."},{"postId":1088,"topicId":48,"posterId":12,"postTime":1273719129,"postText":"That may be the server provider or the fastdl broke wit a recent update and you need a new one"},{"postId":1093,"topicId":48,"posterId":153,"postTime":1273748938,"postText":"No,\nIt mostly works.\nIt lets you download everything EXCEPT MAPS."},{"postId":1095,"topicId":48,"posterId":12,"postTime":1273751049,"postText":"Dunno just don't use assmod on any of our servers a I xcNt connect to an assmod server."},{"postId":1096,"topicId":48,"posterId":153,"postTime":1273781245,"postText":"What's wrong? Does the MOTD not load?"},{"postId":1098,"topicId":48,"posterId":12,"postTime":1273781950,"postText":"Nope I just time out and can joi a server that uses it"},{"postId":1427,"topicId":48,"posterId":9,"postTime":1274648520,"postText":"a jihad bomb ,flash grenades, incindenary, tmp, and explosive and smoke"},{"postId":1501,"topicId":48,"posterId":12,"postTime":1274840660,"postText":"Quick scopable intervention with sway just like in mw2, cuz I'm good at that :)"},{"postId":1761,"topicId":48,"posterId":55,"postTime":1275182641,"postText":"If you guys want i can stay on the jail server or on a server where there never someone on to bring ppl on it and make them like it :3 ? ???"},{"postId":1876,"topicId":48,"posterId":12,"postTime":1283200777,"postText":"That could work! But I like features aswell"},{"postId":12459,"topicId":48,"posterId":150,"postTime":1293227658,"postText":"i think the shop should have a larger stock more charater more trails and more bonuses such as eztra speed or more health or sumthin like that"},{"postId":13157,"topicId":48,"posterId":372,"postTime":1293759372,"postText":"I don't know if this is reviving a dead post, since it still is aplicable to jail, but the map rotation idea would be greatly welcomed.  Playing one map for hours gets very tiring, and a change up after a certain amount of rounds or time is something i think everyone would be behind. Much better than getting an admin in just to do that."}]}