{"topicId":4545,"forumId":3,"topicTitle":"UnBan Request","topicTime":1318965911,"topicViews":47,"topicReplies":1,"topicStatus":1,"topicFirstPosterName":"Radiored","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1318967392,"posts":[{"postId":35690,"topicId":4545,"posterId":1123,"postTime":1318965911,"postText":"Yesterday in ttt different chains of events went on to where considering to talk out a problem that risen turned into blatant arguement of how things got me banned.\nFirst off the game started out on devtown, the map that had been edited so that people would use the full map and not only run to the gunshop. Well it started out me shooting myself in the air with the button at the smaller tower, while in the air i said anyone under me is going to get goombastomped, I have no control of myself while in air except at the peak of the launch, \"now if innos agree to run under me to get goombastomped\" it will happen, which it did happen. I ended up killing an inno while i was inno which the inno was Nutterbutter and considerably i didnt realize i had killed a certain mod. Nutter actually laughed about it because he ran under me. The mod however didn't take too kindly to this saying i will be banned for saying im going to goombastomp people/rdm. We'll i kept my mouth shut didnt say anything considering itd add onto ban time. Next i was a traitor had a rocket jump and while jumping through the air (partyrocker) called me out saying i was a traitor, this i do consider i should be banned for because it was a mistake and shouldnt be said, but i said a racial slur in the heat of the moment not thinking. Well the mod said that it would add onto my ban time again. Again me keeping my mouth shut considering it would add onto more ban time. Two rounds later there are 7 people left in the round and someone issues \"Live check Respond or KOS\". I said \"i'll take the kos >:D\" considering itd be a joke and that no one would really take that as traitorus words. One of the innos whom i cant remember said well then kos radio, i went into the gun shop where i found another inno with me stood beside of him for 30 seconds or so, and he said \"wait radios down here should i kill him\" another person said yes. So he started shooting me took me down to 40 health but i killed him in doing so he also shot first. going out of the gun shop i met 2 other innos one being wheatly, wheatly and the other inno started shooting me which consider im still an inno, no where did i say i was a traitor. Wheatly ended up killing me and was confused because everyone was gunghoe for killing me. While dead the mod said looks like trolling/tbaitings going on they're too. At this point i was fed up and i took it to be the mods personal vendetta against me. Rage does make people do cray things, i said \"we'll what else could i do to add onto this long ass bantime\" the mod then sugjested that i \"Go on a rdm spree\". Which i did consider but never do because i considered this to be a issue between me and the mod. When i saw the mod i shot at him dont know if i wounded him but he ended up killing me. So my ban ended up being (rdm, racism, trolling, tbaiting, attempting to add ban time and as thus, accepted). I consider that we both didnt handle the situation right, and that yes there probally were 2 things that i should be banned for in there but most of this was based on chance/coincidence/personal affairs. So take it how you may but i believe i was wronged"},{"postId":35691,"topicId":4545,"posterId":101,"postTime":1318967392,"postText":" http://nonerdsjustgeeks.com/forum/viewforum.php?f=14 \n\nPlease go there and follow the format if you wish to have a chance at being unbanned."}]}