{"topicId":3099,"forumId":1,"topicTitle":"Admin troll vs. Vip troll vs. ___crisis","topicTime":1308867859,"topicViews":295,"topicReplies":19,"topicStatus":1,"topicFirstPosterName":"Alphonse","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1309182204,"posts":[{"postId":24709,"topicId":3099,"posterId":465,"postTime":1308867859,"postText":"lets see here.... hmmm....admin gets to troll with voting.....___Crisis gets to troll and rdm.....yet the lonely Vip guy gets a 24 hour ban for everytime crisis complains and he responds with a lesser troll.... who wins...who losses...try to guess who losses...ME the vip. and koboold and crisis are just gana come on here have this post removed and me banned from the forum just for posting this...seems almost 100% likely...Gash would be ashamed of all of you. This is what happens when gash doesnt moniter his server. person with admin friends trolling=no ban. person with no admin friends trolling=ban"},{"postId":24713,"topicId":3099,"posterId":634,"postTime":1308868266,"postText":"Are you Gator?\nIf so, it's a day ban and you were asked to stop and you kept doing it.\nThis thread will only bring you shame."},{"postId":24717,"topicId":3099,"posterId":465,"postTime":1308868432,"postText":"i know it will but if i can somehow get gash to come back and see whats become of his ppl then fine bring on the shame i dont care no more nnjg has gone to shit lately\nps. i am gator"},{"postId":24718,"topicId":3099,"posterId":101,"postTime":1308868532,"postText":"Pretty much none of us except you were intentionally trolling.\n\nYou were saying rude things on purpose to get him to leave."},{"postId":24721,"topicId":3099,"posterId":465,"postTime":1308868655,"postText":"yes i was intetionally trolling(at ___crisis) only because ___crisis can do what ever the f**k he wants and get away with it it aint right\nif gash was here we would both be banned not just me and i would be fine with that. you can even deem me the troll of TTT i dont care it aint fair\nps. The ungratefull dead had a great quote from a post.(However, I've seen some admins and mods go straight for the ban just for accusing them of hacks or some shit)\nnot for hacks but on the same subject. you should read his whole post... *Koboold not enforcing the rules on crisis just cuz he's ur friend*"},{"postId":24723,"topicId":3099,"posterId":101,"postTime":1308870877,"postText":"Kobooold did slay Crisis for his RDMs."},{"postId":24724,"topicId":3099,"posterId":465,"postTime":1308871027,"postText":"let me refrase....Koboold didnt use the apropriate punishment on ___crisis because he was his friend (3 Rdmed innos and 1 Rdmed T is not just a slay) i dont understand why Pharaoh didnt step in and do something\n\n\nthis post has slowly become related to TTT.How do i move it?"},{"postId":24725,"topicId":3099,"posterId":272,"postTime":1308871328,"postText":">> let me refrase....Koboold didnt use the apropriate punishment on ___crisis because he was his friend (3 Rdmed innos and 1 Rdmed T is not just a slay) i dont understand why Pharaoh didnt step in and do something \nI'm sorry? I don't plan to sit here while you accuse me of not punishing my apparent \"friend\". If you paid the slightest bit of attention ingame you'd know that I don't like him any more than you do. But, it's not relevent to the situation. Now, you deserved your ban, and your ban shall be kept. I used the punishment that was necessary at the time. should the activity have continued,  a ban would have followed. Now I'd appreciate it if you waited out your ban without any more complaints."},{"postId":24726,"topicId":3099,"posterId":465,"postTime":1308872375,"postText":"it has been in my knowledge that 2 rdms is a slay and >3 is a ban. so when he gets 4 rdms its not a ban. please clarify how that isnt favoratism.\n\nps.im not upset over my ban(i dont care) im upset about im not being banned\npps. i would like to hear Pharoah's opinion on this.\n\nppps.still cant figure out how to move a topic"},{"postId":24728,"topicId":3099,"posterId":634,"postTime":1308873797,"postText":"I may be wrong on this but, the only RDM crisis did was killing the detective(Dum) for creating votes that Crisis considered trolling (Killing someone for something against the rules, like trolling, is wrong, rule-related problems should be handeld by mods+), the rest of the people he killed shot at him first (for good reason) and he only shot back in self defense. He was slayed for his RDM, you persisted to troll him when you were asked to stop 4 times."},{"postId":24729,"topicId":3099,"posterId":465,"postTime":1308874442,"postText":"1.first of all he had shot me first(could have been crossfire i dont know) which means rdm\n2.second the generic rule that i have been told(out of experience) is that when you rdm someone expecially a detective is to kill your self or be killed not continue on killing which to me means rdm on those he killed\n3.i know i had been warned i get it"},{"postId":24732,"topicId":3099,"posterId":101,"postTime":1308876911,"postText":"The \"2 rdms is a slay\" rule is more as of a guideline. 2 accidental rdms is a slay, while as little as one RDM if it is so blatant could be a ban.\n\nEDIT: But yes, Crisis did RDM and get punished. And yes, he does too often jump to conclusions (Like every freaking round I see about 1 false kill from him), but he only did it one round and after he was punished then stopped. We told you to stop 4 times and you continued."},{"postId":24750,"topicId":3099,"posterId":397,"postTime":1308885595,"postText":">> i know it will but if i can somehow get gash to come back and see whats become of his ppl then fine bring on the shame i dont care no more nnjg has gone to shit lately\nps. i am gator \n\n\ngash will be back tomorrow i think i mean tomorrow is the 24"},{"postId":24756,"topicId":3099,"posterId":79,"postTime":1308889607,"postText":"Maybe i should clarify, i only rdm'd 1 guy. The other 2 people shot me first there for i am allowed to return fire, one of which was a T that i killed for shooting at me. If you want to complain that i rdm'd 4 people then get a pic of the 4 people i killed, that round was only 1 then defensive for the other 2 \"rdm's\" as you call it.\n\nI get away with no more then the average person, its just that many people dislike me so they think that EVERY time i kill someone its a rdm. You were warned 3 times to stop trolling then u did it 2 more times with 2 more warnings while alive. If anything i believe the 1 day ban was too short, this thread also is TARGETING me in particular so id say from this thread alone you'd also deserve a bigger ban.\n\nI don't actually get my way like you say i do either. I tend to complain when time is right even when some times it might be a little over the top so it would look like and hard to prove that its not over the top. From how many warnings you got I am personally surprised it was only a day.\n\nEdit: As to the killing detective and your supposed to kill yourself thing. That's not exactly true, its what people do to avoid punishment for the next round. If i was mod still I would still slay the person the next round for blatant rdm (hence why when i rdm i rarely kill myself(as rare as me rdming actually is)). I know what i did was wrong, and next time ill put over chat for him to stop instead of trying to talk over all the mic spammers. Also, Kobold has said on many occasions that he doesn't like me, really wish you would at least get 25% of your \"facts\" correct before posting. (Dunno exactly y he doesn't like me)"},{"postId":24780,"topicId":3099,"posterId":112,"postTime":1308933223,"postText":">> \nEdit: As to the killing detective and your supposed to kill yourself thing. That's not exactly true, its what people do to avoid punishment for the next round. If i was mod still I would still slay the person the next round for blatant rdm (hence why when i rdm i rarely kill myself(as rare as me rdming actually is)). I know what i did was wrong, and next time ill put over chat for him to stop instead of trying to talk over all the mic spammers. Also, Kobold has said on many occasions that he doesn't like me, really wish you would at least get 25% of your \"facts\" correct before posting. (Dunno exactly y he doesn't like me) \n\n\nYou didn't wait to get slayed. You went on to get some kills so you didn't waste your traitor round."},{"postId":24786,"topicId":3099,"posterId":465,"postTime":1308935581,"postText":"I just got up right now and was reading all of my previous post right now and decided I would like to apoligize to all those i have brought into this and those who are in it. I over reacted WAY too much yesterday. I dont know what came over me. Sorry ___Crisis. You may be a douchebag but your an NNJG douchbag which make you all right. Sorry Koboold. I have been wrong and your right. And sorry to everyone else.\n\n\nPs.Please be mature and dont post any \"Nener Nener\" or \"I told you so\" type posts.THX"},{"postId":24787,"topicId":3099,"posterId":101,"postTime":1308936673,"postText":"Locked by request....sort of.\n\nNo further discussion needed."},{"postId":24791,"topicId":3099,"posterId":101,"postTime":1308939330,"postText":"Unlocked by request."},{"postId":24792,"topicId":3099,"posterId":465,"postTime":1308939603,"postText":"thx"},{"postId":24912,"topicId":3099,"posterId":115,"postTime":1309182204,"postText":"No.\n\nThis is just ecouraging drama and most of it has no right to be in general discussion.\n\nRe-locked."}]}