{"topicId":3846,"forumId":35,"topicTitle":"NINJABreadMan's super sexy mod application","topicTime":1314579013,"topicViews":169,"topicReplies":2,"topicStatus":1,"topicFirstPosterName":"NINJABreadMan","topicFirstPosterColor":"","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1315018388,"posts":[{"postId":31229,"topicId":3846,"posterId":235,"postTime":1314579013,"postText":"1) What position are you applying for:Mod on TTT\n2) Your age:14 soon to 15 in a month\n3) Your location: United States of the Americas PST\n4) Current In-Game Name: [NNJG] NINJA BreadMan\n5) Steam ID & Link to your Steam Community Profile: STEAM_0:0:29209427, http://steamcommunity.com/id/thedemon09/\n6) How did you find out about NNJG: NNJG's TTT server is one of the first servers I have joined on Garry's Mod\n7) How long have you been involved with NNJG and/or Shadow's servers:I can not pin point the exact amount of time but it is somewhere between one and a half years to two years\n8) What you can bring to the NNJG Team: Moderation of TTT\n9) Why do you want to be part of the NNJG Team: I have been playing on NNJG's servers for a long time and often times I felt that if I was mod I would be able to help keep the server fun and enjoyable for others. \n10) Do you have any past experience with the position you're applying for:I have no experience in this field. \n11) Do you own a decent microphone, and do you frequently utilize it:Yes \n12) Any other comments or information you can provide: To my knowledge i have never been banned kick of be slayed that i know of.\n\nRecommendations:  http://k.min.us/jbjwinyCBi6y2b.png "},{"postId":31257,"topicId":3846,"posterId":272,"postTime":1314586649,"postText":"Hey guys, look carefully at punked's reccomendation. \n\n http://everyboty.net/shared/emotipix/skeptical/fry.jpg \n\nOT: I think you would make a good mod, you know the rules and what do do when they're broken. \n\n +support "},{"postId":31866,"topicId":3846,"posterId":2,"postTime":1315018388,"postText":"Unfortunately, we are unable to accept your application at this time."}]}