{"topicId":1458,"forumId":1,"topicTitle":"Suggestion Template for BoD Voting 2011","topicTime":1293682357,"topicViews":132,"topicReplies":14,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1293751749,"posts":[{"postId":12997,"topicId":1458,"posterId":101,"postTime":1293682357,"postText":"I was bored, so I made this. It's my suggestion on how we'll vote for the new BoD for 2011.\n_________________________________________________________________\n\n<Random intro stating random shit>\n\nRequirements to run:\n-Must have signed up on the forums before December 10, 2010.\n-Must have 30 posts.\n-Must have signed up for the election in a thread (also to be made, pretty much saying \"Post if you want to run in the election\")\n-Ben/Gash do not have to run.\n-Must be active.\n-Must have a general knowledge of how the community works and the important people.\n\nVoting system+Requirements:\n-If signed up before or on December 25, 2010 you must post 1 to 8 votes on who you want elected.\n-If signed up after December 25, 2010 you must verify to Mr. Gash or Ben in steam (to prevent fraud accounts) and have to have played on our servers at least once.\n-If a fake account is made and is caught all of your votes will be turned void and you risk being banned.\n-You may vote for yourself if you have run for election.\n-If banned for longer than 3000 minutes from any server during any part of the election, you may not run or vote.\n-Voting will take place for approximately 7 days.\n\nResults:\n-The top 10 people (excluding Mr. Gash and Ben) with the most votes are elected into the Board of Directors.\n-If there is a tie between the last spots, a new topic will be started and the same system will be there\n_________________________________________\n\nSo what do you think?"},{"postId":12998,"topicId":1458,"posterId":112,"postTime":1293682935,"postText":"How about they created their acounts before the 30th?\nOne more day isn't enough for people to make bullshit acounts and try to back them up.\nWe've gotten alot of new people in the last month, some of which have become mods.\nIt wouldn't make sense if they couldn't vote.\nBesides that it seems fine.\n\nDo you agree?"},{"postId":13000,"topicId":1458,"posterId":101,"postTime":1293683563,"postText":">> How about they created their acounts before the 30th?\nOne more day isn't enough for people to make bullshit acounts and try to back them up.\nWe've gotten alot of new people in the last month, some of which have become mods.\nIt wouldn't make sense if they couldn't vote.\nBesides that it seems fine.\n\nDo you agree? \n\n\nNo, people who joined after the 25th couldnt RUN.\n\nPeople who join after the 25th can still vote but have to verify in steam.\n\n\nAnd to add on: Screen-caps of a person saying \"I vote for you Pharaoh\" and things like that will not count.\n\n\nEDIT: Also to add on: If you want your vote to be private you may PM it in forums or steam to Mr. Gash or Ben.\n\nEDIT2: Also you can have the option to have your post deleted by Mr. Gash or Ben at request in the post."},{"postId":13001,"topicId":1458,"posterId":2,"postTime":1293683737,"postText":" Requirements: Must be a VIP/Moderator/Admin/Super "},{"postId":13002,"topicId":1458,"posterId":153,"postTime":1293684169,"postText":">>  Requirements: Must be a VIP/Moderator/Admin/Super  \nNah,\nAnyone can run"},{"postId":13004,"topicId":1458,"posterId":4,"postTime":1293684597,"postText":">>  Requirements: Must be a VIP/Moderator/Admin/Super  \nI think the public deserves to vote. Not the general public though."},{"postId":13009,"topicId":1458,"posterId":101,"postTime":1293685666,"postText":"He meant to run, Kry.\n\nEDIT: Still disagree though."},{"postId":13010,"topicId":1458,"posterId":4,"postTime":1293685834,"postText":"Oh, i must have misread. Well, scratch that, I think the public deserves to run, not the general public though."},{"postId":13016,"topicId":1458,"posterId":101,"postTime":1293686518,"postText":"I edited my post, but... Yeah, I don't think that you HAVE to be Mod/Admin to run. Oh, and \"If you don't know about it because you didnt check the forums, well too bad.\" maybe?"},{"postId":13018,"topicId":1458,"posterId":389,"postTime":1293687392,"postText":"How about you guys set a date range to see who wants to participate in the BoD by signing up?\n\nAfter the date, anyone that signed up will be participating in the vote.\nCreate a New Group and Add everyone that you think should be able to participate in the voting such as people who joined the forums ahead of time. (Giving a heads up to all servers population about this vote and ask people to sign up on forums)\nCreate a New Forum Section made for people in the New Group and then make a topic and have a vote for who they believe should join the BoD.\nLet the voting take 2 - 5 days?\nEnd of voting days, lock the topic/forum and make it unavailable to see and count the votes. Also delete the New Group.\nNext day or something, release the results through Announcements or something.\n\nThat seems like a lot of work."},{"postId":13022,"topicId":1458,"posterId":2,"postTime":1293688404,"postText":"If you're in the BoD that means you should be admin/mod. I'm not adding any new admins/mods if they didn't post an app/I don't want them with power."},{"postId":13063,"topicId":1458,"posterId":112,"postTime":1293726281,"postText":"Its kind of a late reply, but Dum I thought you were giving the requirements to vote, not to run.\n\nMods/Admins should be able to run, and mabye a few regulars that have been here for a long time?"},{"postId":13075,"topicId":1458,"posterId":101,"postTime":1293735065,"postText":">> Its kind of a late reply, but Dum I thought you were giving the requirements to vote, not to run.\n\nMods/Admins should be able to run, and mabye a few regulars that have been here for a long time? \n\n\nThat's what I'm saying.\n\n\nEDIT: We should really put that up today or tomorrow, or at least put up the voting somehow."},{"postId":13108,"topicId":1458,"posterId":389,"postTime":1293746277,"postText":"Just make January (2011) your BoD election thing. Take time to settle down and make use of the month for it.\n\nThen next year (2012) you guys can spend less time on it based on this year (2011 in like a couple days)."},{"postId":13125,"topicId":1458,"posterId":153,"postTime":1293751749,"postText":">> If you're in the BoD that means you should be admin/mod. I'm not adding any new admins/mods if they didn't post an app/I don't want them with power. \nThey dont get power for being in the BoD.\nStop being stubborn, like really. WTF"}]}