{"topicId":3322,"forumId":122,"topicTitle":"Personal Attack","topicTime":1311671285,"topicViews":212,"topicReplies":12,"topicStatus":1,"topicFirstPosterName":"__Crisis","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1311953816,"posts":[{"postId":26312,"topicId":3322,"posterId":79,"postTime":1311671285,"postText":"CoreyW.Rogerson\nTTT\nSTEAM_0:0:24225449\nProof: http://www.youtube.com/embed/cv97fYYzPEw\n\nI know some are gonna say this is me trolling, but i have enough agreements to say that this video was indeed a personal attack. At 1:55 you 100% ignore someone other then me shooting a rifle shot at you. At around the 2:20 mark you take out a knife without looking around, after going up ladder you turn around with 2 people following u up ladder that prolly saw you with knife and saying that your death was 100% my fault, instead of yours for taking out the knife. At the 2:30 mark you make the statement \"Rule Breaking Ass Kisser\" which i have people agreeing is a Personal Attack/Troll comment.\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/576677340150729023\n\nThis is a pic showing that Chopper, Mimeyy, Bitches, Pingas and Sergeant Teddy agreeing its a Personal Attack comment. (Only ones i could find online atm) Overall this personal attack goes against the forum rules as well as server rules."},{"postId":26316,"topicId":3322,"posterId":237,"postTime":1311684080,"postText":"Dumb post is dumb. Sorry."},{"postId":26319,"topicId":3322,"posterId":142,"postTime":1311689785,"postText":"1. Don't go posting something like that. \n2. He accepted his ban and knows his unban request might not go through, he's only continuing it because he wants the other person banned and not himself unbanned because he knows its unlikely he will be.\n3. You troll him and expect him to do nothing? It would be the same way if he did it to you and yes it was wrong of him to do so but with so many people against him, I wouldn't be surprised.\n4. This isn't how you are suppose to be acting towards someone who frequent our server and get ban requests on people who harm the server even if you don't like him.\n5. You know this already and should have ignored it, unless you were directly involved or mod+, do not post on a ban or unban request.\nNow I'm not here to protect him but as a mod, to see something right goes on and not have him be denied of something just because most people don't like him and he does have sufficient proof upon this ban request if reviewed and not ignored."},{"postId":26321,"topicId":3322,"posterId":760,"postTime":1311690449,"postText":">> CoreyW.Rogerson\nTTT\nSTEAM_0:0:24225449\nProof: http://www.youtube.com/embed/cv97fYYzPEw\n\nI know some are gonna say this is me trolling, but i have enough agreements to say that this video was indeed a personal attack. At 1:55 you 100% ignore someone other then me shooting a rifle shot at you. At around the 2:20 mark you take out a knife without looking around, after going up ladder you turn around with 2 people following u up ladder that prolly saw you with knife and saying that your death was 100% my fault, instead of yours for taking out the knife. At the 2:30 mark you make the statement \"Rule Breaking Ass Kisser\" which i have people agreeing is a Personal Attack/Troll comment.\n\nhttp://steamcommunity.com/id/hidden_assassin/screenshot/576677340150729023\n\nThis is a pic showing that Chopper, Mimeyy, Bitches, Pingas and Sergeant Teddy agreeing its a Personal Attack comment. (Only ones i could find online atm) Overall this personal attack goes against the forum rules as well as server rules. \n\nCrisis, cool down. You are trying to make something out of nothing to get Corey banned because of anger. Calling someone a \"Rule Breaking Ass Kisser\" is indeed an insult. But guess what? It's not trolling/excessive flaming though. This is the internet. When someone calls you a name, you deal with it, not make a petty ban request on these forums."},{"postId":26322,"topicId":3322,"posterId":142,"postTime":1311691711,"postText":"Sigh. Again as I just said, Do not post unless you are directly involved or mod+"},{"postId":26326,"topicId":3322,"posterId":79,"postTime":1311697762,"postText":"This post has significant proof of a rule that is here to prevent people from directly attacking people. The both of you posting how you did on this post is also showing your dislike and personal issues with me. As Bewm said, don't post unless mod+ or involving you, i have no intention of backing down on this cause ENOUGH is ENOUGH. You want to keep trolling me at this point and i will report you, i will no longer show sympathy and let things go un-noticed. You all tell me to cool down when its your fault that it has gone this far. You can only troll someone for so long before he has no intention of holding sympathy for all that has gone on."},{"postId":26329,"topicId":3322,"posterId":612,"postTime":1311703413,"postText":"Crisis. Again? Really? I'm tired of you thinking that I selected you out of everyone. No one else that shot at the radio called me out for it. That, my friend, is what I request a ban for. Get over it. You have to realize the world isnt out to get you. This isn't a personal attack, it's a fair and just request. You broke the rule. Get over it. Stop trying to get me banned because you got caught doing what you do."},{"postId":26330,"topicId":3322,"posterId":612,"postTime":1311703544,"postText":"Also. No one is trolling you. If anyone was trolling you, it's yourself. I don't see why you keep making a fool out of yourself. Seriously, quit while you are ahead."},{"postId":26333,"topicId":3322,"posterId":79,"postTime":1311703937,"postText":"Again, im not trying to get unbanned from this but that comment at the end of the video \"Rule Breaking Ass Kisser\" was in no way shape or form related to anything that had to do with the video. That in its self was a direct attack on me as a person and proves that you were not in the right state of mind when you made the video. You trolled and expect no one to say anything about it as well. Rules go 2 ways and i am in no way using this as a excuse to get unbanned. The ban request will be looked at and dealt with in difference with the unban request. I have no intention of letting a apology for that mishap at the end of the video clear you from the trolling you have clearly done. (as seen in 2:30 of the video) This is an average ban request from me and i show no favoritism in any of my posts. Everyone gets reported if they broke a rule.\n\nSo in further notice, no more messages other then a admin should be on this. You clearly say \"I don't see why you keep making a fool out of yourself.\" I dunno if you understand the term trolling, but that statement is trolling as well since everyone other then a few of you notice the trolls.\n\nFORUM RULES: http://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=103&t=2018\n\nIt is blatantly obvious he broke forum rule #12 with his video and there for should be punished accordingly. When i broke it once Gash removed my access to the forums entirely for a year. But that was extreme and i don't know the punishment, all i do know is that it's not JUST a warning. Its at least a removal of the post and there for the ban should be lifted as if no post was made."},{"postId":26338,"topicId":3322,"posterId":612,"postTime":1311706486,"postText":"Yea well.you know how many times people say shot to you on the server? You don't make ban requests on them? Trucing? Yea I think so!\n\nNo. I'm not an idiot. You just want me banned. I'm not gonna let you ruin my name because of your own ban. Get over it. I didnt break the rules to get banned. Admins. Wanna slay me? That's the punishment for trucing I think. I'll be in the server all day"},{"postId":26474,"topicId":3322,"posterId":79,"postTime":1311790884,"postText":"Since everything thinks this is out of anger. It prolly partly is since im tired of dicks trolling me and getting away with it. I DO expect the rule to be enforced since if nothing else the 2:30 mark is a obvious and blatant attack at who i am. \n\nIf thats not a personal attack then maybe i should start going around calling people names like he did? No, the answer is no. I would obviously get banned for trolling/attacking someone. When i use terms like idiots i normally use it when 5 people standing around when 1 person knifes me in front of them all. Not everyone is traitor.\n\nEDIT: http://www.nonerdsjustgeeks.com/forum/posting.php?mode=reply&f=21&t=3335\n\nJust another personal attack towards my character that was plain out un-needed."},{"postId":26623,"topicId":3322,"posterId":612,"postTime":1311879368,"postText":"Is this over? Because if so I won't reply to your last post."},{"postId":26766,"topicId":3322,"posterId":153,"postTime":1311953816,"postText":"Locking.\nThis has become E-Drama."}]}