{"topicId":2218,"forumId":1,"topicTitle":"[updated on my situation] Going away","topicTime":1301177178,"topicViews":397,"topicReplies":15,"topicStatus":0,"topicFirstPosterName":"Mark","topicFirstPosterColor":"000099","topicLastPosterName":"TinfoilHatter","topicLastPosterColor":"FF6600","topicLastPostTime":1302990528,"posts":[{"postId":17911,"topicId":2218,"posterId":54,"postTime":1301177178,"postText":"well, I said this a lot, and will say again, i'm getting more and more of a life. I try to get off steam as much as possible. I have my faults, and they're kicking in for no reason. Recently, I haven't been able to sleep, haven't been able to eat much or at all. Some days I go with nothing what so ever in my stomach and don't even realize. I have school sometimes, and stay up to 4am and sometimes all night. i'm stressed for no reason at all, it's all just kinda, falling on me. i'm not gonna be in the servers for a while, i'll be on steam sometimes, but the least I can be on steam.\n\nI already talked to Gash about taking a break. It's just needed at this point in time. I don't know how long i'm gonna be gone for. It's just depending on how long it lasts. Gash knows the kind of stuff I do, and doesn't like it, but it's my hobby. (I tag :c). I also do a lot more than tag, but i'm not gonna say those kind of things on the forums. I'm getting a gym membership (since my friends have memberships as well) and probably gonna be there a lot. No, I will not be gone forever, a few weeks or so is all. Just informing you all ahead of time.\n\nWell, I guess i'll see you guise. adiós :c"},{"postId":17912,"topicId":2218,"posterId":389,"postTime":1301182811,"postText":"Get away from gaming = good thing.\n\nIf i could do it, i woulda done it but.... im basically on a computer every day no matter what...."},{"postId":18059,"topicId":2218,"posterId":112,"postTime":1301398440,"postText":"I just found this. >.> \nGood luck with everything and have fun with everything."},{"postId":18073,"topicId":2218,"posterId":84,"postTime":1301432155,"postText":">> I just found this. >.> \nGood luck with everything and have fun with everything. \nYou need to have your eyes checked if you just found this >.>"},{"postId":18076,"topicId":2218,"posterId":4,"postTime":1301440408,"postText":">> >> I just found this. >.> \nGood luck with everything and have fun with everything. \nYou need to have your eyes checked if you just found this >.> \nPharaoh hasn't been on that much recently, the post is only 3 days old"},{"postId":18081,"topicId":2218,"posterId":84,"postTime":1301450498,"postText":">> >> >> I just found this. >.> \nGood luck with everything and have fun with everything. \nYou need to have your eyes checked if you just found this >.> \nPharaoh hasn't been on that much recently, the post is only 3 days old \nThen maybe I need to get my eyes checked >.>\n\nI should go pick up my new pair of glasses soon"},{"postId":18311,"topicId":2218,"posterId":636,"postTime":1301795015,"postText":"Its impossible once a computer addict always dun dun dun xD cause i play the computer way too much i play a lot i dont waanna say how long but ya."},{"postId":18430,"topicId":2218,"posterId":54,"postTime":1301901826,"postText":"bump and update:\n\ni get on the servers when I can, i'm on the forums a lot. i try to be as active as possible. no, i'm not like 100 percent back at this point, i get active when i want to pretty much. a lot of drama happened 2 nights ago (well, drama in my case anyway) so I gotta get over some shit. gonna be working on an art project for a while as well. TAKs testing is tomorrow and the next day (texas state test) if I fail it, I go back to the 8th grade, I pass, I move on, going to the 9th grade, then 10th when tested for it.\n\nIf I fail the TAKs, i'm just letting you know, I'll be leaving NNJG, steam, everything. If I fail the 8th grade, i'm out. I'm just gonna drop out and runaway. I'm sick of being a failure, sick of being the last to finish. I want to be with my friends, if I can't have that, then fuck it all. I'm done with failing, I really am. So if I do fail this grade, you wont see me for a while, possibly never again. When and if I leave, I'll be going back to Chicago where I belong with a gooooood friend of mine, I know she will take care of me. She has been there for me when I needed her most. She's my best friend. And if I do fail, I'll be going to Chicago, then a few months after that, Europe with her. I already have it all planned out. I can't stand the fact that I failed a grade already, two is too much for me.\n\nI'll update you when the time comes, what happens, everything."},{"postId":18489,"topicId":2218,"posterId":521,"postTime":1302038603,"postText":"Good luk bro"},{"postId":18513,"topicId":2218,"posterId":54,"postTime":1302052695,"postText":"another update:\n\nwell, i'm confident I passed the exams and shit, but I have two more at the end of April (Science and History), so wish me luck on those :/. But; even if I don't fail this grade, i might goto Chicago for a few weeks in the summer. (might, but it's a good chance I will). I was born in Chicago, i wanna say my goodbyes c:"},{"postId":18516,"topicId":2218,"posterId":2,"postTime":1302053380,"postText":"No Nerds Just Blogs"},{"postId":18528,"topicId":2218,"posterId":54,"postTime":1302061956,"postText":">> No Nerds Just Blogs  NNJB (lul, jb)"},{"postId":18940,"topicId":2218,"posterId":464,"postTime":1302768160,"postText":"I've taken the English portion of the TAKs, we have to do it as busywork.\nGood luck, Mark. I think you'll do well on them."},{"postId":19006,"topicId":2218,"posterId":54,"postTime":1302891103,"postText":">> I've taken the English portion of the TAKs, we have to do it as busywork.\nGood luck, Mark. I think you'll do well on them.  you live in texas?"},{"postId":19007,"topicId":2218,"posterId":84,"postTime":1302894669,"postText":">> >> I've taken the English portion of the TAKs, we have to do it as busywork.\nGood luck, Mark. I think you'll do well on them.  you live in texas? \nIt would seem he does."},{"postId":19096,"topicId":2218,"posterId":464,"postTime":1302990528,"postText":"No, New Mexico.\nOur teacher thinks it's good practice for us to take other state's exams in preparation for our finals.\nTaken the 2008 9th, 10th, and 11th tests, I believe.\n\ntl;dr for the TAKS,\nThat fucking raccoon story is infuriating."}]}