{"topicId":4138,"forumId":3,"topicTitle":"Map Suggestions","topicTime":1315880740,"topicViews":46,"topicReplies":2,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"__Crisis","topicLastPosterColor":"","topicLastPostTime":1315937850,"posts":[{"postId":33173,"topicId":4138,"posterId":634,"postTime":1315880740,"postText":"ttt_gunkanjima_v2\nhttp://www.garrysmod.org/downloads/?a=view&id=123522\n\nttt_rooftops_a2\nhttp://www.garrysmod.org/downloads/?a=view&id=121448\n\n\nBoth look pretty interesting and fun, lets give them a try?\nGave them a quick run on single player and gunkanjima is probably one of the most visually pleasing TTT maps I've seen.\nI didn't explore rooftops as much but just the layout of the map looks like it would be a blast for hands parkour, and maybe we could actually get some use of the binoculars on a map for once with this."},{"postId":33196,"topicId":4138,"posterId":605,"postTime":1315905602,"postText":"Ive had the chance to play both these maps on many different servers.\n\nFirst map is pretty, but linear and simple, yet oddly some people would get lost in it. This being said it is pretty decent. Only flaw imo, is all the guns+ammo start at the spawn, and it aint easy getting them before the round starts. (they start in a box crammed together, and people fighting over each other to get one aint pretty)\n\nSecond map, sniper wars, the end. Nothing else much to this map other then Ts running for a sniper spot and sniping the overly easy to spot rooftops. With the rifles as they are, this makes it even harder to do. May as well just play the minecraft map, where at least some people go into places to get knifed/shotgunned. (also, there isnt as many areas as you think there are to play with you hands in your 2nd suggested map)"},{"postId":33211,"topicId":4138,"posterId":79,"postTime":1315937850,"postText":"I still believe a version of Skyscrapers would be nice for the server. But would need to find one that doesn't have that download bug"}]}