{"topicId":4010,"forumId":22,"topicTitle":"Russian Roulette Revolver","topicTime":1315270970,"topicViews":75,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1315281209,"posts":[{"postId":32309,"topicId":4010,"posterId":634,"postTime":1315270970,"postText":"My idea is a Special Revolver, that can be purchased in the NNJG shop, under the weapons tab, that costs 50 points, and only lasts for 1 round.\n\nUpon right click it will open a menu that allows you to load the gun with between 1 and 6 bullets.\n\nThe ammo that is in the gun is displayed, hovering above the player's head.\n\nUpon left click it will do a random number check and determine if it fires or not.\n1 bullet = 1 in 6 chance of firing. ect.\nIf the gun fires, the player holding it dies.\n\nIf it fires and the player dies, a message prints in the chatbox that reads.\n\"''Player name'' has tested his luck, with ''bullet count'' bullets in his revolver, and died.\"\n\nIf it does not fire and the player lives, a message prints in the chatbox that reads.\n\"''Player name'' has tested his luck, with ''bullet count'' bullets in his revolver, and lived.\"\n\nYou can only use the gun once every 10 seconds to prevent spam.\n\n\n\nPlease feel free to post any suggestions on how to improve this idea."},{"postId":32320,"topicId":4010,"posterId":605,"postTime":1315276427,"postText":"Change it from 50-500 points, permanent item, mention what slot [imo slot 9 weapon (you'd have to temporaily disable the cloaker if you want roulette)], and then I would vote yes :O!\nMaybe make it 7 seconds instead of 10, but this is a meh."},{"postId":32335,"topicId":4010,"posterId":735,"postTime":1315278811,"postText":"Wouldn't this just promote rdm?"},{"postId":32338,"topicId":4010,"posterId":812,"postTime":1315279044,"postText":"Wait, you can use it on other players?"},{"postId":32348,"topicId":4010,"posterId":634,"postTime":1315280884,"postText":"I knew I left something out, XD. it's the Russian roulette revolver so you load it shoot it, if you live you pass it on. If you die then... Well you die. I just thought it could be a way to make C4 roulette into something for refined and that causes less rdm."},{"postId":32351,"topicId":4010,"posterId":115,"postTime":1315281209,"postText":"Not 50 not 500 it should be 2000.\n\nIt would give people a reason to save points.\n\nAlso, I love c4 roulette. :3"}]}