{"topicId":3126,"forumId":14,"topicTitle":"Unban request","topicTime":1309210467,"topicViews":111,"topicReplies":5,"topicStatus":1,"topicFirstPosterName":"MurielBagge","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1309212577,"posts":[{"postId":24936,"topicId":3126,"posterId":704,"postTime":1309210467,"postText":"Your In-Game name: MurielBagge\nYour Steam ID: STEAM_0:0:26154701 00:18 94 0 \nReason: Not exactly sure. My friends was playing (I know its my responsibility) while I was sleeping and was most likely trolling or cursing\nLength of Ban/Date and time of Unban: It's been a few months so most likely permanent\nWhat server were you playing?: Jail\nWho banned you?: Pharaoh (I think)\nWhy should we unban you?: I am a regular on the server and love playing it. There's not a day goes by I don't feel regret. Not because I'm banned; or because you think I should. I look back on the way I was then: a young, stupid kid who committed that terrible crime. I want to talk to him. I want to try to talk some sense to him, tell him the way things are. But I can't. That kid's long gone and this old man is all that left. I gotta live with that. Please, unban me. I love to play and I gifted my friend GMod just to play with him, forgetting I was banned."},{"postId":24937,"topicId":3126,"posterId":112,"postTime":1309210692,"postText":">> Your In-Game name: MurielBagge\nYour Steam ID: STEAM_0:0:26154701 00:18 94 0 \nReason: Not exactly sure.  My friends was playing  (I know its my responsibility) while I was sleeping and was most likely trolling or cursing\nLength of Ban/Date and time of Unban: It's been a few months so most likely permanent\nWhat server were you playing?: Jail\nWho banned you?: Pharaoh (I think)\nWhy should we unban you?: I am a regular on the server and love playing it. There's not a day goes by I don't feel regret. Not because I'm banned; or because you think I should.  I look back on the way I was then: a young, stupid kid who committed that terrible crime.  I want to talk to him. I want to try to talk some sense to him, tell him the way things are. But I can't. That kid's long gone and this old man is all that left. I gotta live with that. Please, unban me. I love to play and I gifted my friend GMod just to play with him, forgetting I was banned. \n\nSo are you saying you did it or not? Make up your mind."},{"postId":24939,"topicId":3126,"posterId":704,"postTime":1309210859,"postText":"I did not do it, my friend did"},{"postId":24940,"topicId":3126,"posterId":112,"postTime":1309211775,"postText":"You said you did it, in the second part that I highlighted red."},{"postId":24941,"topicId":3126,"posterId":704,"postTime":1309211891,"postText":"I look back on the way  he  was*"},{"postId":24942,"topicId":3126,"posterId":112,"postTime":1309212577,"postText":"ah. I see\n\nWell, considering you were a semi-regular and I never saw you break rules before that point I will unban you.\nI'm going to give you the benefit of the doubt. This one time only. Don't do it again, this is your warning.\nKeep your account to yourself."}]}