{"topicId":3317,"forumId":14,"topicTitle":"Unban request","topicTime":1311653383,"topicViews":106,"topicReplies":5,"topicStatus":1,"topicFirstPosterName":"(BG)Angelgirl","topicFirstPosterColor":"","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1311692387,"posts":[{"postId":26269,"topicId":3317,"posterId":974,"postTime":1311653383,"postText":"Hey. i was banned from the server, the terrorist one. i am (BG)Anglegirl and i would wish to be unbanned. i killed a guy twice while he was afk for 2 rounds. im so sorry if i am unbanned i will never rdm again."},{"postId":26270,"topicId":3317,"posterId":101,"postTime":1311653488,"postText":"Fill out this format please:\n\nhttp://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=14&t=1946"},{"postId":26273,"topicId":3317,"posterId":974,"postTime":1311654182,"postText":"IN game: (BG)Angelgirl\nSteam: http://steamcommunity.com/id/1432143\nReason: rdm\nLength: 1 day17:56 26 Jul 2011\nserver:ttt\nBannedby:Quack\nWhy should we uban you: I was just killing him out of boredum and he was afk for 2 rounds. i had killed a afk person. i really wish i could be on the server again. i would never rdm ever again. i will warn 3 times if someone is following me before shooting them in the foot. or firing into the roof for a warning. please."},{"postId":26293,"topicId":3317,"posterId":79,"postTime":1311659511,"postText":"I was here during the ban and agree that the ban should be lifted. She got banned for killing a afk that kept nudging to stay in the server. The guy that was afk should have been kicked and dealt with as well rather then just her. (guessing female by name(correct me if wrong)). Not saying what she did was right, but isn't it normally a slay unless repeatedly done? I think a ban for a very first offense on the server is a little harsh for the rule that was broken. I think a warning and slay would have prolly solved everything about the same way."},{"postId":26301,"topicId":3317,"posterId":115,"postTime":1311662278,"postText":"She (as I am assuming) rdmed more than just one round. It was 5, maybe 6 rounds while I was watching the damagelogs and the complaints. Then when I  said it firsthand, I banned you for a day.\n\nIt's only a day, it can't be disputed if its a day or under. But, I understand it is your first offense and that's why I banned you for a day, and not a month.\n\nYou honestly don't NEED to take the precautions of warning someone thats following you. But it would be a lot easier for you if you got a mic. Trust me, being a regular chat user previously was tough. Using my mic suddenly made ttt much easier to play."},{"postId":26324,"topicId":3317,"posterId":112,"postTime":1311692387,"postText":">> \nLength: 1 day\n \n\nThat is all."}]}