{"topicId":1410,"forumId":12,"topicTitle":"plea to the owners.","topicTime":1293410929,"topicViews":186,"topicReplies":10,"topicStatus":0,"topicFirstPosterName":"mimeslayer1337","topicFirstPosterColor":"","topicLastPosterName":"MarioDJW","topicLastPosterColor":"990000","topicLastPostTime":1293755751,"posts":[{"postId":12677,"topicId":1410,"posterId":387,"postTime":1293410929,"postText":"While i am recent to the community, I donated and became a VIP. As a VIP, I constantly became one who had to control and monitor the games process. As I have been told, VIP's are not allowed to do this. Yet, looking at the game before i did this to after, i have noticed a vast improvement in game play, as I am able to keep people under some sort of order. Now, what I am asking is for one of two things. \nEither allow me to continue as I am, without negative repercussions.\nOr make me a regulator (forgot which term) so that i can further aide.\nI am on the server much, and as Spaceballs or Bot (who i believe is now Mr. Gash) i due goof around, but i am a good regulator. Even last night, the server would not respond, disallowing commands, and these guys came on RDMing and making it hell. I found Bot/Gash, and as soon as the server was back, i immediately restored order.\n\nSo please, i am fine with donating, but i would like to continue as I am, keeping the server fine and fun for all, and if I can be made so i can do this more effectively, I will accept. If not, please do not get angry when i do use my VIP powers for good."},{"postId":12678,"topicId":1410,"posterId":112,"postTime":1293411129,"postText":"The only time you shouldn't use your vip powers are when higher ranked people are on (mods/admins)(excluding supervips) \nAs long as you do that, and don't abuse you won't be yelled at.\n\nI really don't understand what you are asking?"},{"postId":12679,"topicId":1410,"posterId":387,"postTime":1293411624,"postText":"sorry, but i was keeping everyone happy, and Swaim came on and saw what i had been doing and demamnded i stop, and i wanted to eb sure i could keep doing what im doin, which benefits all."},{"postId":12680,"topicId":1410,"posterId":101,"postTime":1293411765,"postText":" http://i52.tinypic.com/11bj3i1.jpg "},{"postId":12682,"topicId":1410,"posterId":112,"postTime":1293411814,"postText":">> sorry, but i was keeping everyone happy, and Swaim came on and saw what i had been doing and demamnded i stop, and i wanted to eb sure i could keep doing what im doin, which benefits all. \n\nWell what exactly are you doing?"},{"postId":12683,"topicId":1410,"posterId":387,"postTime":1293411965,"postText":"i would make votes before i did a lot of things but generally i muted and gagged spammers, punished RDMers and kicked bad players."},{"postId":12685,"topicId":1410,"posterId":112,"postTime":1293412608,"postText":"There has to be more behind the story, unless he told you to stop because he was on.\nHe wouldn't just tell you to stop so the minges go free."},{"postId":12686,"topicId":1410,"posterId":3,"postTime":1293412757,"postText":"Well, as Swaim is a a higher power, when he is on let him handle things,\nBut when there is no Administrators or Moderators please feel welcome to handling issues such as that."},{"postId":12750,"topicId":1410,"posterId":369,"postTime":1293440678,"postText":"Ok you need to understand a few points:\n\n\n-Only a few people are able to restore the server and the administration mod.\n-Its great that you call gash, but there are also other people who can do that EASLY, and they do.\n-If you wish to become a moderator I recommend that, the server is in big need of those and applications are open.\n-Have fun at the servers :)"},{"postId":12755,"topicId":1410,"posterId":366,"postTime":1293450747,"postText":">>  http://i52.tinypic.com/11bj3i1.jpg  \nThat picture always gets me.\nand this \n http://img46.imageshack.us/img46/6/1292921573656.png "},{"postId":13139,"topicId":1410,"posterId":372,"postTime":1293755751,"postText":"Mime, just please lay off of the commands.  It seems like every five secconds that you are using another command."}]}