{"topicId":1277,"forumId":26,"topicTitle":"Itsa Me.. Dimento","topicTime":1291779618,"topicViews":98,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"Dimento","topicFirstPosterColor":"660066","topicLastPosterName":"ito","topicLastPosterColor":"","topicLastPostTime":1292638521,"posts":[{"postId":11631,"topicId":1277,"posterId":347,"postTime":1291779618,"postText":"Hello, im not going to repeat my name because it can be seen in two places, thread title and my user name a little bit \n<<< that way. I am a casual gamer that enjoys and plays many games like CSS, DoD:s, Tf2, Gmod, Killing floor, BFBC2, Minecraft, League of ledgend, and plenty more. I am very interested in this community and have gotten to know alot of people up to this point and love to play with them, my favorite server is the TTT server and that is how i found this gaming community, a record everything i play and keep track of steam IDs so if you plan on playing with me, keep da hacks ghosting and all that out :)\n\nI used to be in a DoD:S unit.. correction.. units for anyone who knows what they are and if you care, the units i was was in were the 9th ID and the 1st SAS. I have owned a tf2 and gmod server before mainly for my friends to have fun without the problems of other servers such as trolling griefing and hacking. I do not take kindly to people that like to ruin others fun by any means and i try to stop them with whatever i can. I have been on steam for about 3 years now and have played tf2 for that long, i also have played competitively and i have 4000 hours on spy.. this is the truth. Back to gmod, i play every day on the ttt server and sometimes other servers but my main focus is the ttt server being that is my favorite game mode despite the minges that like to rdm all the time and ruin other peoples fun. now this is starting to sound like a rant thread so i am just going to say\n\nTL;DR: I used to be admin on other servers, I plan to become admin, I like gmod, hi what's up :D"},{"postId":11636,"topicId":1277,"posterId":101,"postTime":1291783528,"postText":"Hai thar :D Its me Dum"},{"postId":11661,"topicId":1277,"posterId":82,"postTime":1291847312,"postText":"Ever since you started playing people have stopped mispronouncing my name, calling me \"Dimento\"\nI <3 U ;D"},{"postId":12056,"topicId":1277,"posterId":78,"postTime":1292638521,"postText":"Whats Up (="}]}