{"topicId":4038,"forumId":3,"topicTitle":"Rule Adjustement","topicTime":1315436653,"topicViews":79,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"Destar","topicLastPosterColor":"","topicLastPostTime":1315446601,"posts":[{"postId":32578,"topicId":4038,"posterId":634,"postTime":1315436653,"postText":"Most people believe the current ruling is that when there are 2 people, both unproven, remaining, you will let the 2 unproven fight it out. I would like to change this rule.\n\nIf one of the last 2 people claims that they are innocent, it would be equivalent of them calling out the other because it would mean that the other is a traitor.\nWell lets look back and see what we do if two people are calling each other out in a regular game. Someone kills one of the people being called out, at their own risk, and finds out whose call-out was valid, and whose call-out was false.\nSo by that logic would not anyone be allowed to kill either one of the last 2 unproven\n\n But Destar, no one has proof that either on of them is telling the truth. \nWell that's true, but no one has proof that someone is telling the truth in a regular call-out either. So why are those allowed?\n\nThe point is that when there are 2 unproven, most of the time they will just try and convince all of the proven players that the other is a traitor. It's the same as both of them calling each other out.\n\nI think that if you see 1 of the last 2 unproven you should be able kill them, if you want to take that risk.\nIf you kill one and they were a traitor, the round ends and it means the other unproven's call-out was valid and therefore no rules were broken.\nIf you kill one and they were innocent, you can gather that the other unproven did a false call-out and is a traitor, once again no rules were broken.\n\nIf you see any problems with this please post it here, if you agree or see a way to make it better or more easily understandable, please post here also."},{"postId":32580,"topicId":4038,"posterId":101,"postTime":1315437318,"postText":"It's RDM and you're killing on suspicion if it's your rules. You only call someone out if you have proof in a different situation, so you also have to have proof now. It's just trying to abuse a loop-hole."},{"postId":32581,"topicId":4038,"posterId":634,"postTime":1315437914,"postText":"Only me and another player are left unproven, I know I'm innocent, therefore they must be a traitor. \nIf it is a enough proof to kill why isn't it enough proof to call out?"},{"postId":32592,"topicId":4038,"posterId":101,"postTime":1315440836,"postText":">> >> You only call someone out if you have proof in a different situation \nOnly me and another player are left unproven, I know I'm innocent, therefore they must be a traitor. \nIf it is a enough proof to kill why isn't it enough proof to call out? \n\nYou wrote it very confusing. If you are talking about the 2 unprovens killing each other, that is fine. However, it seemed like you were trying to say ANYONE can kill the last 2 un-provens."},{"postId":32600,"topicId":4038,"posterId":634,"postTime":1315441780,"postText":">> You wrote it very confusing. If you are talking about the 2 unprovens killing each other, that is fine. However, it seemed like you were trying to say ANYONE can kill the last 2 un-provens. \nI am.\n\nIf in a regular call out, ANYONE is allowed to kill the person being called out.\nWhy can't you kill someone in a call out if it is from one of only 2 unproven players?"},{"postId":32609,"topicId":4038,"posterId":101,"postTime":1315443484,"postText":">> >> You wrote it very confusing. If you are talking about the 2 unprovens killing each other, that is fine. However, it seemed like you were trying to say ANYONE can kill the last 2 un-provens. \nI am.\n\nIf in a regular call out, ANYONE is allowed to kill the person being called out.\nWhy can't you kill someone in a call out if it is from one of only 2 unproven players? \n\nThe person calling out didn't supply valid proof."},{"postId":32628,"topicId":4038,"posterId":634,"postTime":1315446601,"postText":"Ah, I get it. You're saying the proof the person is using (the knowledge that they are innocent) only applies to them so they can't use it to call someone out.\nIn other words you can only use proof that is available to everyone when calling someone out.\nSeems fair enough."}]}