{"topicId":4679,"forumId":106,"topicTitle":"Race For Wool Competition Idea","topicTime":1319756694,"topicViews":79,"topicReplies":3,"topicStatus":0,"topicFirstPosterName":"NINJABreadMan","topicFirstPosterColor":"","topicLastPosterName":"Pirate43","topicLastPosterColor":"FF6600","topicLastPostTime":1319990055,"posts":[{"postId":36547,"topicId":4679,"posterId":235,"postTime":1319756694,"postText":" Hello, as most of you know I am NINJABreadMan  \n                \n\n\n  I have a idea of a friendly game we could play. \n  \nThe idea is to have a small tournament of sorts with teams of 4 players on each team going against each other but the sad thing is, is i don't have a server that can support a lot of people so i wanted to ask if pirate would be so kind as to host this map along side the goldcraft map so that way people can still play goldcraft while 2 teams are going against each other. I will put more detail in if pirate would be so kind to host the map when needed."},{"postId":36669,"topicId":4679,"posterId":456,"postTime":1319907637,"postText":"Please provide more information."},{"postId":36671,"topicId":4679,"posterId":235,"postTime":1319910939,"postText":"Well here is the map: http://www.minecraftforum.net/topic/191908-ctmcollection-%E2%98%A0-vechs-super-hostile-series-%E2%98%A0/#AnchorRace2         \n\nIts called Race For Wool #2 Direct fire and i was hoping we could have a tournament with 4 or 8 teams of 4 people per team to compete in a tournament I don't have any prize or anything but i would be willing to put up the max pain bundle as a prize for one of the winners .\n\nThere is a plugin out there for bukkit that can let you host more than one world so that way people can still join Goldcraft without interrupting the match. Anything else you want me to provide more info for?"},{"postId":36708,"topicId":4679,"posterId":456,"postTime":1319990055,"postText":"this has been noted and will likely be implemented when we do our multiworld update we have been trying to do for some time now, but NPC quests takes priority ;)"}]}