{"topicId":1442,"forumId":14,"topicTitle":"Khazar Light - Unban Request","topicTime":1293599331,"topicViews":58,"topicReplies":5,"topicStatus":0,"topicFirstPosterName":"KhazarLight","topicFirstPosterColor":"","topicLastPosterName":"Kryzoid","topicLastPosterColor":"000099","topicLastPostTime":1293646694,"posts":[{"postId":12898,"topicId":1442,"posterId":400,"postTime":1293599331,"postText":" Your In-Game name: \n    Khazar Light\n\n Your Steam ID: \n     STEAM_0:0:20222645\n\n Reason: \n    I was not informed of the ban prior to the action but I think it was because I killed (falsely accused of RDM) one or two traitors with minimal proof and large suspicion. Although I was right it was still considered RDM even though I proved that I had proof and justified my actions.\n\n Length of Ban: \n    A week, I believe.\n\n What server were you playing?: \n    I was playing on the TTT server with the IP: 69.197.189.125:27015\n\n Who banned you?: \n    Not sure, I was banned without warning or contact of admin.\n\n Why should we unban you?: \n    I believe I should be unbanned because I wish to participate on the NNJG TTT server and within the community. I have learned from my actions and would like to show that I have. I hope this can all be resolved. I will give more information and debate my case as needed. Thank you for your time."},{"postId":12902,"topicId":1442,"posterId":101,"postTime":1293599955,"postText":"To help fill you in: Pharaoh banned you and you were banned for ghosting and rdming. And Pharaoh usually takes his bans pretty carefully."},{"postId":12903,"topicId":1442,"posterId":400,"postTime":1293601511,"postText":"Thanks for filling me in. As I already justified the so-called \"RDM\" I will continue on to the ghosting. \n\nThe circumstances were this;\n\nOne detective,\nOne innocent,\nand one traitor.\n\nI'm sure that the innocent and I were accused of ghosting because we knew where he was coming up, but I had a radar and the innocent found the C4 that the traitor had planted. Even under these circumstances I do not know how one can ghost if they are both alive."},{"postId":12905,"topicId":1442,"posterId":377,"postTime":1293603880,"postText":"You rdmed me as a traitor with 16 people left (give or take 4) and killed another traitor with no proof as well.  You also had a string of rdms before that too.  You specifically rdmed traitors and no one else that last game, whether it was ghosting or not RDMing 2 traitors with no proof and only two traitors seems a bit suspicious.  I support the Ban and say you should have to wait the week to teach you a lesson about NOT RDMING!!!"},{"postId":12915,"topicId":1442,"posterId":112,"postTime":1293627485,"postText":"You rdmed for three maps straight, you were trolling, and you were ghosting earlier. Everytime I died I watched you play and you killed traitors for no reason. You and Blaine were even room claiming one round."},{"postId":12929,"topicId":1442,"posterId":4,"postTime":1293646694,"postText":"I hate to intrude, but i feel it is related. I also had to slay you on epic_city (i beleive) or some other map yesterday or the day before for rdming. I say keep the ban, it's only week and you HAVE been rdming."}]}