{"topicId":1276,"forumId":122,"topicTitle":"Admin abuse - [NNJG]๖ۣۜBewmShaka","topicTime":1291778669,"topicViews":115,"topicReplies":5,"topicStatus":1,"topicFirstPosterName":"Dimento","topicFirstPosterColor":"660066","topicLastPosterName":"Dimento","topicLastPosterColor":"660066","topicLastPostTime":1291865612,"posts":[{"postId":11630,"topicId":1276,"posterId":347,"postTime":1291778669,"postText":"Offender name?: BewmShaka\nWhich Server?: Jailbreak NNJG\nOffender's Steam ID?: STEAM_0:0:3262464\nWhat the Offender did?: Admin Abused with the following (Ignited himself while in spec and another person and began flying around the server, and remaining in the air, he also did a rave party thing for fun, i admit it was really awesome and i think everyone enjoyed it, so it wasnt really a problem. I would like the administrative staff to address this as a minor issue, he didnt do anything terrible but it was unnecessary and needs to be corrected, i have no problems with Bewm.)\nAdmins on?: Mabey Dum, he may of left at the time\nProof?:\nVideo proof that upon requested from me will be given"},{"postId":11634,"topicId":1276,"posterId":4,"postTime":1291780586,"postText":"Please be sure to have proof ready in all ban requests or staff abuse reports before posting the thread, and include them. You seem to not be doing so recently."},{"postId":11642,"topicId":1276,"posterId":347,"postTime":1291816751,"postText":"Well allow me to explain, the last ban request were for two people and i was uploading the video after i posted it and the upload failed so i decided to do it the following day because it was late, but then i found out it was already handled do there was no need to and for this one all you hade to do is request the video and i would give you it, the one problem is i recorded over the majority of the evidence, you see everytime i join a server i type \"record [insert number here]\" just in case, so i wasnt really organized, this however taught me to actually name my demos instead of using random numbers because this makes me look bad. Im sure if you talked with Bewmshaka he would tell you that he did do it because he sounds like a nice and fun guy to play with.\n\nTL;DR: I recorded over my evidence, excuse this thread."},{"postId":11671,"topicId":1276,"posterId":142,"postTime":1291854552,"postText":"Aside from it being unnecessary, that's true but people didn't mind as I didn't do it to burn them all purposely. Now I shouldn't have done it but hell, where's the fun in that? I don't wanna be boring, I try to make it fun on the server without harassing the hell out of players. (Except Bird Flu AKA Striped Sweater, RAVEBREAK CRASH! >:D) Anyway it's not just me that does this sort of stuff. It could've been worse like Ben or someone spawning a shit load of jihads (trololol)"},{"postId":11689,"topicId":1276,"posterId":153,"postTime":1291862815,"postText":">> Aside from it being unnecessary, that's true but people didn't mind as I didn't do it to burn them all purposely. Now I shouldn't have done it but hell, where's the fun in that? I don't wanna be boring, I try to make it fun on the server without harassing the hell out of players. (Except Bird Flu AKA Striped Sweater, RAVEBREAK CRASH! >:D) Anyway it's not just me that does this sort of stuff. It could've been worse like Ben or someone spawning a shit load of jihads (trololol) \nI don't light myself on fire because I don't want to be boring.\n-__-"},{"postId":11694,"topicId":1276,"posterId":347,"postTime":1291865612,"postText":"Thanks for understanding Bewm, You guys can lock this thread now, nothing else needs to be said."}]}