{"topicId":638,"forumId":24,"topicTitle":"Contest for Borderlands","topicTime":1282181766,"topicViews":171,"topicReplies":16,"topicStatus":0,"topicFirstPosterName":"Magicnachoz","topicFirstPosterColor":"","topicLastPosterName":"DethSlayr","topicLastPosterColor":"990000","topicLastPostTime":1282438049,"posts":[{"postId":5719,"topicId":638,"posterId":109,"postTime":1282181766,"postText":"Im having a contest best knock knock joke gets borderlands I will not announce who won but I will make a post which means the contest is over. Anyone who does not have it can enter leave your steam login names.\n\nWays you can win\n1: Make a great knock knock joke\n\n2: Make a great comic (Easier to win this way unless it sucks)\n\n3: Make a mindless stupid joke (Unless it really sucks you lose)\n\n4: Write a good story (Chance I might not read but if I do your better then the jokes) DONT MAKE IT TO LONG\n\n5: Make a funny video\n\nMUST BE ORIGNAL DO NOT STEAL IDEAS\n\nDLC NOT INCLUDED\n\n\n\n\nIf less then 10 people enter no prize for anyone\n\n\nContest ends in 2 days"},{"postId":5720,"topicId":638,"posterId":3,"postTime":1282183495,"postText":"4: EVERYBODY DIED\n\nThe end\n\nP.S. IF I WON, JUST PM ME THE NEWS"},{"postId":5721,"topicId":638,"posterId":4,"postTime":1282184373,"postText":"A short time ago, the essence is spring, the temperature is pleasent, the waters ring.\nThe sky is clear, the birds chirp near, everything is beautiful to it's finest degree...\nUNTIL A BEAUTIFUL PRINCESS NAMED BOB THE BUILDER SHOWS UP AND SAYS \"HYOOK\" AND THEN STARTS RAPING EVERYONE WHEN ALL OF THE SUDDEN RAPTOR JESUS COMES OUT OF NOWHERE AND STARTS HUMPING A WALL. BOB THE BUILDER SAYS: YOU FOOL, YOU CANNOT STOP MY REIGN. THEN THERE WAS THIS EPIC BATTLE OF EXTREME INTENSITY AND SOMEWHERE INTHE BACKGROUND MAGICNACHOZ WAS SITTING DOWN UNDER A TREE SIGNING \"HAKOONA-MATATA\" WHILE EATING PEANUT BUTTER FROM A JAR WITH HIS FINGERS.\n\n3 days later.\n\nThe city lays in ruins, down and forgotten.\nThe shops closed, the roads destroyed, all food rotten.\nThe sky is dark, millions dead...\n\nAND THEN THE HUGE MECHA KRYZOID EXPLODED FROM UNDERGROUND.\nTHE SKIES TURNED BLACK, LIGHTNING SHOKE THE EARTH...but something was wrong.\n\nsomething that should never have happened....\n ever. \n\nThe lightning was red.\n THE GROUND SHOOK AS THE SUN AND MOON'S ECLIPSE CREATED A TWILIGHT EFFECT ON THE EARTH, WHILE MECHA KRYZOID'S FIST OF SUPER PEN0R ALIGNED WITH THE SUN, WHEN.... \n\nimma firin mah lazor.\n BAHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \n\nden everytin wuz destroy3d and now tudei in de worled people is be makin clothes so they can dressed themselves.\n\nmy ID is kryzoid.\ncall me :D"},{"postId":5723,"topicId":638,"posterId":2,"postTime":1282189650,"postText":" NO ONE ENTER SO KRYZOID DOESN'T GET A FREE GAME. "},{"postId":5749,"topicId":638,"posterId":109,"postTime":1282233764,"postText":"No one wins because not enough people entered sorry kryzoid"},{"postId":5760,"topicId":638,"posterId":4,"postTime":1282241797,"postText":">> No one wins because not enough people entered sorry kryzoid \n\n http://filebox.me/files/1hsjbjyh6_imagemqn9.png "},{"postId":5763,"topicId":638,"posterId":48,"postTime":1282242365,"postText":"Knock knock\n\nWhos there?\n\nFuck.\n\nFuck who?\n\nI didn't know you were a prostitute.\n\nTROLOLOL\n\nMy id is dethslayr btw, cuz i obviously win."},{"postId":5810,"topicId":638,"posterId":6,"postTime":1282272169,"postText":"You said you would give to me on TTT >:C"},{"postId":5844,"topicId":638,"posterId":82,"postTime":1282323348,"postText":">> No one wins because not enough people entered sorry kryzoid \nBut it hasn't even been a day >:( I want Borderlands so I can play with BoomShaka and if I don't get it I will cry... but here is my joke if it is still open because it hasn't been 2 days yet and if it is closed I will sue you. \n\nThree guys, stranded on a desert island, find a magic lantern containing a genie, who grants them each one wish. The first guy wishes he was off the island and back home. The second guy wishes the same. The third guy says \"I’m lonely. I wish my friends were back here.\"\n\nbut wait theres more!\n\nA newlywed couple moves into their new house. One day the husband comes home from work and his wife says, \"Honey, you know, in the upstairs bathroom one of the pipes is leaking, could you fix it?\" The husband says, \"What do I look like, Mr. Plumber?\" A few days go by, and he comes home from work and his wife says, \"Honey, the car won't start. I think it needs a new battery. Could you change it for me?\" He says: \"What do I look like, Mr. Goodwrench?\" Another few days go by, and it's raining pretty hard. The wife finds a leak in the roof. She says, \"Honey, there's a leak on the roof! Can you please fix it?\" He says, \"What do I look like, Bob Vila?\" The next day the husband comes home, and the roof is fixed. So is the plumbing. So is the car. He asks his wife what happened. \"Oh, I had a handyman come in and fix them,\" she says. \"Great! How much is that going to cost me?\" he snarls. Wife says: \"Nothing. He said he'd do it for free if I either baked him a cake or slept with him.\" \"Uh, well, what kind of cake did you make?\" asks the husband. \"What do I look like,\" she says, \"Betty Crocker?\"\n\nPlease don't make me cry :D and my id is domineeto"},{"postId":5846,"topicId":638,"posterId":4,"postTime":1282323823,"postText":"3 nuns and 1 priest meet up at the local chapel.\nthe priest says, alright women, you all have been practicing good faith for so many years, so for today, i will allow each of you to do one bad deed.\nso the 3 nuns leave the chapel to go have some fun.\n\n\nat the end of the day, all 3 nuns come back to the chapel to meet up with the priest.\nthe priest asks the first nun, what did you do today?\n\"i stole an ice cream from a small child\" says the first nun\nalright, that's a bad deed, go drink from the holy water.\n\nthe priest turns to the second nun.\nwhat did you do today?\n\"i sprayed graffiti on the mayor's bulding.\"\nalright, that's a bad deed, go drink from the holy water.\n\nby this time, the third nun is laughing her ass off.\nthe priest turns to her\nalright alright, calm down, what bad deed did you do, huh?\n\n\n\n i peed in the holy water. "},{"postId":5855,"topicId":638,"posterId":48,"postTime":1282334804,"postText":"I'm thinking some of those jokes aren't original, tbh\n>.>\n<.<"},{"postId":5874,"topicId":638,"posterId":82,"postTime":1282355694,"postText":"If its on the first page of google it must be pretty original :P also I'm posting a comic later tonight and then I will be victorious!"},{"postId":5897,"topicId":638,"posterId":82,"postTime":1282408623,"postText":"Why did Cinderella get kicked off the soft ball team?\n  Because she ran away from the ball!  \n\nWhat do you do with epileptic lettuce?\n  You make a seizure salad!  \n\nWhat did the monkey say when he caught his tail in the revolving door?\n  It won't be long now!  \n\nWhat did the mother Buffalo say when her boy left for college?\n  BYE-SON!  \n\nWhy did the elephants get kicked out of the public pool?\n  THEY KEPT DROPPING THEIR TRUNKS!  \n\nWhat's brown and sticky?\n  A stick!  \n\nWhat do you call a guy with a rubber toe?\n  Roberto  \n\nWhat do you call a psychic midget who has escaped from prison?\n  A SMALL MEDIUM AT LARGE!  \n\nThere’s two fish in a tank. One turns to the other and says \n  ‘You man the guns, I’ll drive’  "},{"postId":5909,"topicId":638,"posterId":26,"postTime":1282418193,"postText":">> Im having a contest best knock knock joke gets borderlands I will not announce who won but I will make a post which means the contest is over. Anyone who does not have it can enter leave your steam login names.\n\nWays you can win\n1: Make a great knock knock joke\n\n2: Make a great comic (Easier to win this way unless it sucks)\n\n3: Make a mindless stupid joke (Unless it really sucks you lose)\n\n4: Write a good story (Chance I might not read but if I do your better then the jokes) DONT MAKE IT TO LONG\n\n5: Make a funny video\n\nMUST BE ORIGNAL DO NOT STEAL IDEAS\n\nDLC NOT INCLUDED\n\n\n\n\nIf less then 10 people enter no prize for anyone\n\n\nContest ends in 2 days \n\n\n\nMeh, Two racist jokes i'v used before on the go\n\n\nIf your driving down the street and you see a mexican driving his bike, Do you run him over yes or no?\n\n  No because it might be YOUR bike \n\n\nWhy are all african americans so tall?\n\n  Because their Kneegreos "},{"postId":5911,"topicId":638,"posterId":109,"postTime":1282418249,"postText":"SINCE NONE OF YOU WERE ORIGNAL I PICKED THE WINNER AND the 2nd place winner gets to rape pharaoh whenever they want the 2nd place winner is dethslayr"},{"postId":5936,"topicId":638,"posterId":112,"postTime":1282429927,"postText":"I dont remember me agreeing to be part of this =.="},{"postId":5942,"topicId":638,"posterId":48,"postTime":1282438049,"postText":">> I dont remember me agreeing to be part of this =.= \n\nBitch, get raped.\n\n:3"}]}