{"topicId":2750,"forumId":1,"topicTitle":"i would like to point out something here","topicTime":1305603225,"topicViews":262,"topicReplies":21,"topicStatus":0,"topicFirstPosterName":"SMOOGLY","topicFirstPosterColor":"","topicLastPosterName":"Destar","topicLastPosterColor":"","topicLastPostTime":1305853943,"posts":[{"postId":22030,"topicId":2750,"posterId":397,"postTime":1305603225,"postText":"Dear all of nnjg\n\nsomething about ban requests that should change.\nyou all know crisis posting ban requests on here which in my eyes is doing nnjg a huge favor on cracking down on trolls.\nbut with all his credit towards his name i feel it is wrong to see that  12  of his recent ban requests have been out of pharoahs format of\nOffender name?:\nWhich Server?:\nOffender's Steam ID?:\nWhat the Offender did?:\nAdmins on?:\nProof?:\nbut not only that but also accepted. Do to this matter, though some of the bans were legit and the people being banned were wrong in the first place, i believe a ban is a serious thing that is perfectly enforced by an admin and that a ban request from a regular player should take the serious time to place each of his or her ban requests in correct format. if you want me to post links to those 12 recent ban request i will gladly take the time to do so. \n\nsmooglez"},{"postId":22037,"topicId":2750,"posterId":79,"postTime":1305603935,"postText":"Lets see here, i only play TTT server. So everyone knows that. I post the name AND steamid all the time, if no admins on i dont bother putting that in there. Proof i give through my steam account. I also say what the person did. So all the info is given, i dont see why id have to say no admins were on. If none were on, i dont post anything. All of my ban requests follow the format. I just dont copy paste the format INTO my ban requests cause theres really no need. If you wanna bitch about it. Please do a decent job at saying i dont follow the template."},{"postId":22040,"topicId":2750,"posterId":612,"postTime":1305604224,"postText":"For fuck sake crisis? He was simply stating that ban requests should be professionalized. Shit. Pull the fork outta your ass"},{"postId":22043,"topicId":2750,"posterId":79,"postTime":1305604588,"postText":"To be fair, he's trying to say all my bans should be undone for no reason. I followed the format with just not putting in that it was on TTT and saying no admins on. He had no reason to make this post, if admins/s.admins thought it was out of format, i would have had to redo it. He's not ONLY questioning my posts but there judgment on the bans. If i had to have those 2 things added in, then they would have been requested in the ban requests.\n\nAlso, he made this request AFTER he got me rdm'd and Kilroy banned from what he did."},{"postId":22045,"topicId":2750,"posterId":612,"postTime":1305605096,"postText":"To be fair? Fuck that man. You are being an asshole here. He said it should follow format, Which it usually doesn't. And you know what. He didn't question any judgment. However i will.   You do post bullshit ban requests sometimes. Even when its an accidental rdm. ( mouse slides into keyboard causing a shot to be fired into a crowd of people ) sometimes they even explain themselves. You still call bullshit and post frivolous ban requests. Id say maybe 25% of the people you requested should get pardoned. Accidents happen. But still. You need to recognize when you are wrong. Smoog had every right to suggest professionalization of ban requests. However crisis has never been wrong before."},{"postId":22047,"topicId":2750,"posterId":397,"postTime":1305605314,"postText":">> Lets see here, i only play TTT server. So everyone knows that. I post the name AND steamid all the time, if no admins on i dont bother putting that in there. Proof i give through my steam account. I also say what the person did. So all the info is given, i dont see why id have to say no admins were on. If none were on, i dont post anything. All of my ban requests follow the format.  I just dont copy paste the format INTO my ban requests cause theres really no need.  If you wanna bitch about it. Please do a decent job at saying i dont follow the template. \n\n\nmost of your post was stating how lazy you are.\n\nbut the underlined is clearly out of hand \nEVERY ban request should be done with respect to the admins reading them and the people being banned and especially farow who took the time making the ban request rules.\n\nyou dont follow template so yes it is more than ideal way on stating your incompetence.\nThere really isn't any reason for you to abruptly attack me when i have not done anything to you that has anything to do with you not using farow's template."},{"postId":22048,"topicId":2750,"posterId":397,"postTime":1305605454,"postText":">>  To be fair, he's trying to say all my bans should be undone for no reason . I followed the format with just not putting in that it was on TTT and saying no admins on. He had no reason to make this post, if admins/s.admins thought it was out of format, i would have had to redo it. He's not ONLY questioning my posts but there judgment on the bans. If i had to have those 2 things added in, then they would have been requested in the ban requests.\n\nAlso, he made this request AFTER he got me rdm'd and Kilroy banned from what he did. \n\ni didnt say anything in my post on that i just want this to be changed in the future on anyone's ban requests"},{"postId":22051,"topicId":2750,"posterId":79,"postTime":1305605744,"postText":"So lets see, if i dont copy paste the template its not following the format. Then half the ban requests ANYONE makes is not following the format. And Corey, most of my ban requests are from trolls or blatant rdmers. I dont post ban requests lightly. You both just dislike me, and im fine with that. But dont go trying to say i post ban requests on every little thing that happens. When EVERYONE is joking around, i dont care and let them do whatever they want. But if theres 10+ people, i expect them to follow rules and if not, its better they not on the server."},{"postId":22052,"topicId":2750,"posterId":2,"postTime":1305605935,"postText":"Get back on topic or bans will be given."},{"postId":22057,"topicId":2750,"posterId":397,"postTime":1305606451,"postText":" Get on topic.  Only warning  "},{"postId":22058,"topicId":2750,"posterId":79,"postTime":1305606893,"postText":"If the Format needs to be copy pasted. Let a admin tell me, I'm also a member for a long time, maybe even before some of the admins. If they want the format copy pasted, then let them tell me that it needs to be. I've been posting with info that's needed and I don't see how it's not following the format. So if it NEEDS to be copy pasted. It's more up to the admins/mods to tell me then a normal player.\n\nGash, that was relatively on topic. It told why the post was initially made and what happened right prior to the post at hand."},{"postId":22059,"topicId":2750,"posterId":397,"postTime":1305607445,"postText":"my reasons for posting this arent for crisis but for nnjg itself\ni have made my point i am not saying anything more. i dont want this to turn into some flamewar post so please unless an admin contributes to my post i wont get cuaght up into this drama any further."},{"postId":22066,"topicId":2750,"posterId":153,"postTime":1305629587,"postText":"The format is more \"guidelines\" for what needs to be in your post.\nBut if you write it like\nburdddd rdmsd me wen i wus doing nuthings so banhammer himz.\nThen It'll be denied."},{"postId":22072,"topicId":2750,"posterId":112,"postTime":1305643022,"postText":"Tbh I don't understand the admins online.\nIn theory, if an admin was on then he would ban the guy.\nIf he doesn't ban him and a ban request is made, I don't see how the admin not doing anything contributes to the ban at all"},{"postId":22159,"topicId":2750,"posterId":397,"postTime":1305688643,"postText":">> Tbh I don't understand the admins online.\nIn theory, if an admin was on then he would ban the guy.\nIf he doesn't ban him and a ban request is made, I don't see how the admin not doing anything contributes to the ban at all \n\ni like where this is going but what did it have to do with my first post on forums. also i see what ben is talking about how it shouldn't be a mess of whiny petty things. i would like to state that not once have i wronged you directly in my posts, crisis. so please post stuff that isnt being unnecessarily RUDE back at me. i am just pointing out that you of all people are experienced with moderation and understand that most of nnjg doesnt ban request useing the template, and that it should be used for cleanliness as if the person banned were to a fair trial. \n\ni would like this problem fixed for all nnjg members so that our clan/group becomes more professional through the years on its way to become a highly respected clan.\n\nif and Admin complete agrees with your statement that it isnt necessary them have them post it. \n\nGash so help me god this is on topic"},{"postId":22169,"topicId":2750,"posterId":612,"postTime":1305692000,"postText":"@crisis- why cant you just use the template. Is it so hard? Seriously. It is unprofessional. \n\n@ pharaoh- he said if theres no admins on then he requests. Is an admin is on an isn't doing anything about it then its probably ok or the admin is technically trucing with badguys"},{"postId":22173,"topicId":2750,"posterId":153,"postTime":1305717820,"postText":"I get yelled at for trying to make NNJG professional. But really, if it is written well and includes the info on the template, then it's fine."},{"postId":22176,"topicId":2750,"posterId":612,"postTime":1305720521,"postText":">> So lets see, if i dont copy paste the template its not following the format. Then half the ban requests ANYONE makes is not following the format. And Corey, most of my ban requests are from trolls or blatant rdmers. I dont post ban requests lightly. You both just dislike me, and im fine with that. But dont go trying to say i post ban requests on every little thing that happens. When EVERYONE is joking around, i dont care and let them do whatever they want. But if theres 10+ people, i expect them to follow rules and if not, its better they not on the server. \n\nIf you ban request trolls and rdm ers, could you please use the template for requesting a ban. Thats all smoogly was saying."},{"postId":22192,"topicId":2750,"posterId":397,"postTime":1305754159,"postText":">> Ben\":tfaea6y7]I get yelled at for trying to make NNJG professional. But really, if it is written well and includes the info on the template, then it's fine. \n\naww i didnt mean it that way\nim terribly sorry if you took it that way i was agreeing to you seeing your point that the templates was created cause of people acting like your example of bird flu rdming you :3\ni would never say anything wrong to an admin."},{"postId":22194,"topicId":2750,"posterId":153,"postTime":1305755853,"postText":">> >> Ben\":u00wf1gm]I get yelled at for trying to make NNJG professional. But really, if it is written well and includes the info on the template, then it's fine. \n\naww i didnt mean it that way\nim terribly sorry if you took it that way i was agreeing to you seeing your point that the templates was created cause of people acting like your example of bird flu rdming you :3\ni would never say anything wrong to an admin. \nI'm not mad lol"},{"postId":22296,"topicId":2750,"posterId":397,"postTime":1305843149,"postText":"so what is everyone's opinion besides crisis and mine.\ni would like this resolved before its gets prune juiced"},{"postId":22308,"topicId":2750,"posterId":634,"postTime":1305853943,"postText":"I thought you wanted only admin's opinions but if youre asking \"everyone's\" i believe that the template should be used. I think that is what it is made for. I think your \"reputation\" shouldn't matter for a ban request at all. Those are my thoughts."}]}