{"topicId":850,"forumId":22,"topicTitle":"Traitor Shotgun","topicTime":1284998069,"topicViews":226,"topicReplies":18,"topicStatus":0,"topicFirstPosterName":"Brando8850","topicFirstPosterColor":"","topicLastPosterName":"gaurdian889","topicLastPosterColor":"","topicLastPostTime":1287083744,"posts":[{"postId":8015,"topicId":850,"posterId":47,"postTime":1284998069,"postText":"Seeing as Meathook had success with creating the asssassinator I thought that it would be a great idea to have a traitor shotgun. You could use the shotgun from Hl2 and make it slightly more powerful than the normal shotgun. Also you have to name it the BOOMSTICK!"},{"postId":8021,"topicId":850,"posterId":101,"postTime":1285009558,"postText":"As long as it is not as powerful as the boomstick in zombie survival (XD) I'm up for it! It only had 2 shells put it was fucking powerful"},{"postId":8040,"topicId":850,"posterId":113,"postTime":1285021520,"postText":"The problem is, we have to find something to change.  The shotgun is already brutal at close range.  Widening the bullet spread a little would change almost nothing, and widening it a lot would make it waayy overpowered. Rate of fire could be a possiblility, but I don't know if it'd be worth the credit.  Then again, if it has limited ammo, a higher rate of fire would be pointless.  I don't think that upping the damage would make it neccessarily much better though.\n\nI think our traitor weapons should be more complex than \"This weapon, but with higher damage and less ammo.\"  That's what we've done for the betrayl, assassinator, mp5, etc.  We should code something differently.\n\nIf you guys have any other suggestions or if you guys want to use Brando's idea, I'd be more than happy to code the weapon."},{"postId":8045,"topicId":850,"posterId":101,"postTime":1285024233,"postText":"Kind of off topic: A ammo refill for all guns (except for betrayl)\n\nOr....\n\nA thing that gives you an option when you select it to get one free normal gun, and keep that so you have 2 primaries."},{"postId":8046,"topicId":850,"posterId":82,"postTime":1285024591,"postText":"Exactly what I think, we need weapons that traitors can use for a singular purpose, encouraging teamwork. It is what I had in mind when I was making the flamthrower, one traitor could block exits with the flames and another could plant a c4. If traitors have more powerful weapons it gives them too much power over the innocents.\n\n1. They aren't known most of the time and\n2. The will be able to 1-hit the innocents from nowhere.\n\n The manhack remote is also a good example of forcing traitors to work together: one traitor could create a distraction while the rest kill all the innocents from behind. Unfortunately I couldn't get any of the weapons to work and lost the lua files when I reformatted my computer :("},{"postId":8063,"topicId":850,"posterId":113,"postTime":1285028407,"postText":">> Kind of off topic: A ammo refill for all guns (except for betrayl)\n\nOr....\n\nA thing that gives you an option when you select it to get one free normal gun, and keep that so you have 2 primaries. \n\nThe ammo refil would work, but someone would have to code a new ammo type into TTT (Possibly AR2?)  And then Gash would have to recode ALL the traitor weapons to use that type of ammo.   I liked the 2 primaries idea, but I doubt we could get it to work.  We would have to take the code for every single normal weapon and alter it to make it available in the traitor menu.  Plus, if you accidentally bought the wrong primary, you can't swap it with another one.  You'd be stuck with it.   So, in short, both are doable, but it would require a shitload of time to code and would fill up our traitor menu even more than it already is."},{"postId":8087,"topicId":850,"posterId":26,"postTime":1285072763,"postText":">> >> Kind of off topic: A ammo refill for all guns (except for betrayl)\n\nOr....\n\nA thing that gives you an option when you select it to get one free normal gun, and keep that so you have 2 primaries. \n\nThe ammo refil would work, but someone would have to code a new ammo type into TTT (Possibly AR2?)  And then Gash would have to recode ALL the traitor weapons to use that type of ammo.   I liked the 2 primaries idea, but I doubt we could get it to work.  We would have to take the code for every single normal weapon and alter it to make it available in the traitor menu.  Plus, if you accidentally bought the wrong primary, you can't swap it with another one.  You'd be stuck with it.   So, in short, both are doable, but it would require a shitload of time to code and would fill up our traitor menu even more than it already is. \n\n\nOr the ammo thing could just be a spamspawner that spawns 4 of every ammo type on you"},{"postId":8110,"topicId":850,"posterId":113,"postTime":1285111583,"postText":"I think me meant more ammo for the Traitor weapons. Since they don't have any ammo at the moment, we could use AR2 ammo (Which I don't think is being used)  and then have it spawn AR2 ammo in your inventory.  Anyways, circling back to the Boomstick, does anyone else have any opinions or ideas on that?"},{"postId":8118,"topicId":850,"posterId":2,"postTime":1285117967,"postText":"Boomstick baaad\nAmmo spawner gooood\n\nI could decrease the assassinator ammo and increase the damage, and make you able to buy ammo for it. :V"},{"postId":8122,"topicId":850,"posterId":26,"postTime":1285119806,"postText":">> I think me meant more ammo for the Traitor weapons. Since they don't have any ammo at the moment, we could use AR2 ammo (Which I don't think is being used)  and then have it spawn AR2 ammo in your inventory.  Anyways, circling back to the Boomstick, does anyone else have any opinions or ideas on that? \n\n\nYeah, And when someone dies by a traitor weapon, Rather then it blatantly saying what weapon, It says \"Special traitor bullets were found on the corpse\""},{"postId":8130,"topicId":850,"posterId":101,"postTime":1285123400,"postText":"Also an idea: A detective ammo dispenser, kind of like the health station, but it dispenses ammo =P"},{"postId":8141,"topicId":850,"posterId":6,"postTime":1285129234,"postText":">> Also an idea: A detective ammo dispenser, kind of like the health station, but it dispenses ammo =P \nSPAAAH SAPPIN MAH DISPENSER!\n\nTraitor Sapper: Saps HP Station, and Dispenser(if made), NOW!"},{"postId":8143,"topicId":850,"posterId":82,"postTime":1285130161,"postText":"Wouldn't a ammo dispenser do more harm than good?\n\"Here traitors! You can now kill more people!\" Why would innocents need more ammo in the first place if they aren't RDMing?\n\nAlso instead of just ammo traitors could buy a thing that opens a menu to select any standard gun with full ammo."},{"postId":8156,"topicId":850,"posterId":113,"postTime":1285163196,"postText":"I like the idea for extra ammo.  But again, it would require all of our custom traitor weapons to be re-coded to whatever ammo gash decides to use.  Just saying.  I also like the \"They were killed by special traitor bullets\" idea.  I think the ammo station is going too far, but Detectives do need more shit to choose from..."},{"postId":8168,"topicId":850,"posterId":101,"postTime":1285184454,"postText":"Not to mention on the menu there is a body armor/whatever it is that the traitors can also purchase. You can select it as detective but you cant buy it. Not like anyone ever used it as traitor anyways.\n\nOn a side note:\n\nPuked, theres a thing called crowbar. Theres a thing called Mouse1. There is your sapper.\n\nMeat, you already pick up things like 9MM and Shotgun ammo, you can just have it spawn on top of your head.\n\nDom, what if you want self defense, or you just like randomly firing? I often kill traitors then are like \"Shit, where's the ammo?\"\n\n\nAnd on a different topic:\n\nHealth vials for detectives. (Kinda crappy, but if a health station is destroyed...)"},{"postId":8186,"topicId":850,"posterId":113,"postTime":1285193879,"postText":">> Meat, you already pick up things like 9MM and Shotgun ammo, you can just have it spawn on top of your head. \n\nI thought you meant more ammo for traitor weapons.  That's what I thought would be cool.   Not for primaries.  And that type of system is what I had in mind.  But the lua code for the traitor weapons doesn't have any set ammo type, because since you can't get more ammo for them, there's no point."},{"postId":8214,"topicId":850,"posterId":153,"postTime":1285240715,"postText":"I Say Yes."},{"postId":8223,"topicId":850,"posterId":101,"postTime":1285267829,"postText":">> >> Meat, you already pick up things like 9MM and Shotgun ammo, you can just have it spawn on top of your head. \n\nI thought you meant more ammo for traitor weapons.  That's what I thought would be cool.   Not for primaries.  And that type of system is what I had in mind.  But the lua code for the traitor weapons doesn't have any set ammo type, because since you can't get more ammo for them, there's no point. \n\n\n\nOh, I was talking about just a regular refill, not for traitor weapons =P"},{"postId":9094,"topicId":850,"posterId":95,"postTime":1287083744,"postText":">> I know this isnt what your thinking of but we could use this and edit it \na little bit\n http://www.garrysmod.org/downloads/?a=view&id=82197  \nLOL I downloaded that about a month or two ago, upped the rate of fire, spread, damage, and Capacity just because I wanted an unnecessarily powerful weapon(Other than nukes) to destroy stuff with."}]}