{"topicId":4757,"forumId":124,"topicTitle":"Demotions","topicTime":1320260423,"topicViews":34,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"๖Mr. Gash","topicFirstPosterColor":"000000","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1320706537,"posts":[{"postId":36946,"topicId":4757,"posterId":2,"postTime":1320260423,"postText":"I'm thinking we need to demote a few of our admins for inactivity. I know that people have School, but that doesn't mean they should be completely useless for most of the year. What are your opinions on this? For the few admins that check this... :P\n\nEdit: I'd like to point out, I'm only suggesting demotions for those that are inactive on the servers  and  the forums.\n\nMainly talking about DethSlayr, Chopper, Overclocking and possibly Balenti. Not sure about Balenti, he's active at times but doesn't do much. I also think promoting Playerhata to admin would be a good idea.\n\nEdit2: Opening up TTT apps would also be a good idea if we demote these people, or even checking over some already denied applications that were denied with the only reason being we didn't need more at the times they were on."},{"postId":36947,"topicId":4757,"posterId":101,"postTime":1320260531,"postText":"Eh, the only one who's really inactive is Dethslayr. Any people in particular you're directing this to?"},{"postId":36949,"topicId":4757,"posterId":2,"postTime":1320261027,"postText":"Edited post, answered your question."},{"postId":36956,"topicId":4757,"posterId":4,"postTime":1320268474,"postText":"Sadly, i have to agree."},{"postId":37194,"topicId":4757,"posterId":4,"postTime":1320531039,"postText":">> checking over some already denied applications that were denied with the only reason being we didn't need more at the times they were on. \ndoes destar fall under that category? or was he denied for another reason?"},{"postId":37235,"topicId":4757,"posterId":2,"postTime":1320553041,"postText":">> does destar fall under that category? or was he denied for another reason? \nHe doesn't take time to look over all the information; from what I've seen, he would most likely make false bans or punishments. There are people who make less mistakes that we could promote."},{"postId":37270,"topicId":4757,"posterId":153,"postTime":1320585121,"postText":">> >> does destar fall under that category? or was he denied for another reason? \nHe doesn't take time to look over all the information; from what I've seen, he would most likely make false bans or punishments. There are people who make less mistakes that we could promote. \nDestar seemed(and still seems) like the most qualified person for TTT staff."},{"postId":37334,"topicId":4757,"posterId":2,"postTime":1320618266,"postText":">> Ben\":8xd6atfc]\nDestar seemed(and still seems) like the most qualified person for TTT staff. \nI completely disagree, based on what I've seen of him on the server. He isn't someone who causes a lot of trouble and be banned, but he is someone who shouldn't be promoted."},{"postId":37442,"topicId":4757,"posterId":4,"postTime":1320705583,"postText":"I don't think Chopper is that inactive anymore, but i wouldn't say the same thing for Balenti."},{"postId":37444,"topicId":4757,"posterId":101,"postTime":1320706537,"postText":"I wouldn't say that Balenti is inactive. I see him once in a while. He's just bad with administration, I almost never see him use admin commands to gag/ban/kick/etc people."}]}