{"topicId":2607,"forumId":1,"topicTitle":"I haz an idea","topicTime":1304633933,"topicViews":153,"topicReplies":12,"topicStatus":0,"topicFirstPosterName":"MZP.inferno","topicFirstPosterColor":"","topicLastPosterName":"MZP.inferno","topicLastPosterColor":"","topicLastPostTime":1304786251,"posts":[{"postId":20895,"topicId":2607,"posterId":521,"postTime":1304633933,"postText":"Since sohi has an idea, I might as well have one too. Seems easy enough to code, but what do i know. Borrow the phases from flood and add some stuff.\n\nHERE IT IS:\n\nThe gamemode would be called build to survive. You would create a small fortress/house/shack of where to hide and survive in. Maybe a new tool would be made for the building, because i have a small feeling that the phys gun would be used to make invincible houses. A menu for the props could be added, and they could cost points. Once you are done building your place of residence, you enter the surviving phase. There would be multiple disasters that would happen at this stage that you and your place of residence would have to survive. Some examples would be meteor shower (meteors destroy props over time/set them on fire, prop health mod would be needed) and zombie attack (zombies would also need to do damage to props). After this stage, maybe 60 seconds of surviving the said disaster, it would re-enter the build phase and the survivors would gain points. The players that died during the disaster would also respawn.\n\nGood idea for a gamemode? I gots money."},{"postId":20901,"topicId":2607,"posterId":586,"postTime":1304637567,"postText":"This SEEMS much like FLOOD"},{"postId":20906,"topicId":2607,"posterId":115,"postTime":1304641270,"postText":"Add 10 slots to flood server.\n\nUpdate the flood menu.\n\nThere you go."},{"postId":20913,"topicId":2607,"posterId":521,"postTime":1304645290,"postText":"FLOOD FUCKING BLOWS\n\nIM TALKING ABOUT BUILD TO SURVIVE NUKES AND METEORS NOT FLOOD\n\nBut easily modded from flood, is why im suggesting it, and its new"},{"postId":20916,"topicId":2607,"posterId":595,"postTime":1304647405,"postText":"Flood could easily be changed, I would so play this. I hardly play flood. :/ Cool idea at first. But it needs more. Like floods+tornados+ meteors+zombie virus+ God knows what. This could be a great idea. And then you could also have little side fights. PvP with natural disasters."},{"postId":20929,"topicId":2607,"posterId":521,"postTime":1304649689,"postText":"YES\nNOLSKEYS KNOWS WHERE ITS AT\n\nI was gonna see if someone could do some custom disasters.  Cool addition to this would be if people could pick the next disaster and band together to make a big fort"},{"postId":20935,"topicId":2607,"posterId":373,"postTime":1304653126,"postText":"So I come in my room to see my little brother playing this; http://www.roblox.com/Build-and-Survive-Natural-Disasters-Beta-v2-2-item?id=25647153 \n\nThis seems SURPRISINGLY familiar, but in blox f0rm"},{"postId":20947,"topicId":2607,"posterId":740,"postTime":1304660687,"postText":">> So I come in my room to see my little brother playing this; http://www.roblox.com/Build-and-Survive-Natural-Disasters-Beta-v2-2-item?id=25647153 \n\nThis seems SURPRISINGLY familiar, but in blox f0rm \n\nLawl Roblox Sucks."},{"postId":20952,"topicId":2607,"posterId":521,"postTime":1304676755,"postText":"Yeah i used to play roblox 5-6 years ago, exactly where i got this idea from."},{"postId":21044,"topicId":2607,"posterId":693,"postTime":1304733517,"postText":">> Yeah i used to play roblox 5-6 years ago, exactly where i got this idea from. \n\nMy first thought when I saw this topic was Roblox actually.\n\nRegardless, I say we do it, it's actually a lot of fun from what I've played on Roblox when I was younger."},{"postId":21056,"topicId":2607,"posterId":521,"postTime":1304739935,"postText":"Yeah and with gmods improved gfx and a cool Prop system We cOuld do this. Also the meteors and shit could unfreeze props maybe but not unweld. They'd still need healthmod or something for the prophealth"},{"postId":21083,"topicId":2607,"posterId":3,"postTime":1304780272,"postText":"http://www.garrysmod.org/downloads/?a=view&id=80179"},{"postId":21086,"topicId":2607,"posterId":521,"postTime":1304786251,"postText":"We should mod that and change flood to it"}]}