{"topicId":3812,"forumId":124,"topicTitle":"TTT Application Discussion","topicTime":1314498943,"topicViews":642,"topicReplies":87,"topicStatus":0,"topicFirstPosterName":"Quack","topicFirstPosterColor":"000099","topicLastPosterName":"๖Mr. Gash","topicLastPosterColor":"000000","topicLastPostTime":1316471723,"posts":[{"postId":31053,"topicId":3812,"posterId":115,"postTime":1314498943,"postText":"I'm just going to keep on adding to the list of people who have applied HERE ON THE FIRST POST. \n\nCurrent Applications:\nLuamerava\nPlayerhata\nChevy\nUdane\nMongo\nGeneral Falcon\nCtrl Alt Defeat\nCorey w Rogerson\nUnnamed\nDomineeto\nJames\nDestar\nHuman Aimbot\nPopl\nMoon\nNinjaBreadMan\nSohisohi\n__Crisis\nLuigi\nPost your opinions on who should/shouldnt be mod. Speak your mind, this discussion will be deleted once we promote new members (so no hurt feelings)."},{"postId":31060,"topicId":3812,"posterId":101,"postTime":1314499989,"postText":"Luame - No opinion, not a bad player but can have some problems.\nPlayer - Yes. HOWEVER, a few days ago while on DarkRP (even though technically it isn't an official NNJG server) he was propkilling then banned someone Chevy for prop killing even though he was (he is admin on DarkRP).\nChevy - No, not here long enough and has self-control issues.\nMongo - Yes, a very good player. No problems here.\nUdane - No, discussed in other thread."},{"postId":31062,"topicId":3812,"posterId":4,"postTime":1314500392,"postText":"All i will really say for now is that even though i have never played with him in-game, i think Chevy is a very poor choice."},{"postId":31063,"topicId":3812,"posterId":243,"postTime":1314500659,"postText":"I would have to say Mongo, Udane, and Playerhata would be a good choice, Chevy and Lua seem like good players, but not for moderation.\n\nEDIT: The others.\nof all the ones on the list other than the ones I said, I would have to go with domineeto,  Maybe  corey"},{"postId":31066,"topicId":3812,"posterId":153,"postTime":1314501701,"postText":"I think Udane would be a good choice."},{"postId":31071,"topicId":3812,"posterId":112,"postTime":1314503666,"postText":">> Ben\":2loxnhji]I think Udane would be a good choice. \nHonestly. Have you ever even played with him?\n\n\n\nLuamerava- No. She literally ragequit the server numerous times because she was getting knifed.\nPlayerhata- The best choice out of them, but I really don't think we need more mods right now.\nChevy- No. Just No.\nUdane No. Nothing against him personally, but I don't think he's fit for admin.\nMongo- I've never seen him do anything bad, but on the other hand I've never seen him to anything particularly good :/"},{"postId":31073,"topicId":3812,"posterId":153,"postTime":1314504506,"postText":"1) Yes, I've played with Udane. He'd be a good admin because he is active during the night, and can get people on 24/7 and keep it moderated all day.\n2) Why do you think we don't need more admins? TTT is admin-less most of the day....."},{"postId":31083,"topicId":3812,"posterId":735,"postTime":1314506268,"postText":"(Anyone who I have not posted I do not have an opinion on.\nLuamerava-No, Jokes around a lot and she hasn't been on for the past 1-2 weeks.\nPlayerhata- A good choice except he can get a bit too overboard sometimes.\nChevy-No, this kid trolls and I don't think hes mature enough for it.\nUdane-No, see other thread.\nMongo-No, he always calls people faggots and makes fun of kids who have high voices. \nCtrl Alt Defeat- I have to say no, hes rarely on.\nGeneral Falcon-No, rarely on\nCorey w Rogerson-Leaning towards yes, He has shown improvement in his headbutting with crisis.\nUnnamed-No rarely on.\nDomineeto, Leaning towards yes, He can be a troll on the forums sometimes, but he is showing worth in himself\nJames-No, rarely on."},{"postId":31115,"topicId":3812,"posterId":153,"postTime":1314535158,"postText":"Corey-no, I don't think he can handle being mod.\nEdit: Although, his recommendations are impressive."},{"postId":31121,"topicId":3812,"posterId":115,"postTime":1314544861,"postText":">> Ben\":2x3k6fe7]1) Yes, I've played with Udane. He'd be a good admin because he is active during the night, and can get people on 24/7 and keep it moderated all day.\n2) Why do you think we don't need more admins? TTT is admin-less most of the day..... \n\n1) There's plenty of people playing during the night, and Udane has showed mistakes in the past in a VERY short amount of time. His judgement is terrible, and that is KEY when being an admin.\n2) Then this is an obvious wakeup call to re-evaluate our current administration team. I mean, the solution isnt adding more, it's replacing them. Whats the point in keeping inactive or not willing admins?\n\nLuamerava - No. She has bad judgement, and can rage hard.\nPlayerhata - Yes, although he can sometimes attack members personally and can take things too far.\nChevy - No. Just not a good choice, and can have trouble controlling himself.\nUdane - No. I already explained why.\nMongo - Yes. He has potential and good judgement. Giving him a chance to show himself as moderator will surely pay off.\nGeneral Falcon - No. Not active enough.\nCtrl Alt Defeat - No. Not active enough, havent been with us for a long time.\nCorey w Rogerson - No. He takes things way to personally.\nUnnamed - No. He's probably the most inactive member to post a application.\nDomineeto - Maybe. I still cant tell if he just came back to troll."},{"postId":31131,"topicId":3812,"posterId":142,"postTime":1314551045,"postText":"Luamerava - No, good player but not able to control herself when stabbed/etc.\nPlayerhata - Yes, He's done pretty good so far, and is respected.\nChevy - Maybe, just saying he could change, not saying give it to him, but test him. (even tho I might get shit from this)\nUdane - No, Nothing against him, just how he is in power.\nMongo - Yes, \nGeneral Falcon - No, not active enough.\nCtrl Alt Defeat - No, Same reason as Falcon\nCorey w Rogerson - Maybe, he has trouble controlling himself at times but proves to be good.\nUnnamed - No, Just haven't seen him on at all\nDomineeto - Maybe, He does a bit of trolling but still shows good at NNJG."},{"postId":31132,"topicId":3812,"posterId":6,"postTime":1314551623,"postText":"Luamerava - Maybe, I just, really don't know here.\nPlayerhata - Yes, The best choice of all the applicants.\nChevy - No, I heavily doubt he can handle it.\nUdane - Yes, I've already posted my thoughts on him.\nMongo - Yes, I think he could handle it well.\nGeneral Falcon - No, Has been inactive for months, just recently came back.\nCtrl Alt Defeat - Yes, if he gets more active.\nCorey w Rogerson - Maybe, If he can improve on his drama-starting then yes, but until then, No.\nUnnamed - I have no idea who this is.\nDomineeto - Yes, He was a good mod last time, and he seems serious about it."},{"postId":31145,"topicId":3812,"posterId":2,"postTime":1314557505,"postText":"Luamerava:  Unsure , she seems like more of the type who would rather play, and is only applying so she can get rid of the people bothering her.\nPlayerhata:  Unsure , he takes jokes too far at times but would still seem like a good choice.\nChevy:  No . He would not represent NNJG well.\nUdane:  Yes , as shown in the other thread.\nMongo:  Unsure , I don't often see him playing when I'm on, so I haven't been able to make an opinion.\nGeneral Falcon:  No , if he's the guy who used to have a name spelled with only characters from the Character Map, he used to be active but RDMed at times. He was inactive for awhile, and doesn't talk much.\nCtrl Alt Defeat:  No , he doesn't seem \nCorey w Rogerson:  No , he's a good player at time but also causes drama.\nUnnamed:  Unsure , I haven't been on the server with him enough to get an opinion.\nDomineeto:  No , he easily causes drama and as Quack said I am also unsure if he just came back to troll.\nJames:  No , he's a nice guy but he doesn't seem to take things seriously at times. Also, his grammar."},{"postId":31160,"topicId":3812,"posterId":112,"postTime":1314559953,"postText":"Chevy quit, so that parts done."},{"postId":31176,"topicId":3812,"posterId":101,"postTime":1314562646,"postText":"Chevy rejoined. So obviously he's raging hard about him over-exaggerating people hating him.\n\nUpdate on my list:\nMongo: Yes. He is a pretty active user and whenever he asks me to slay or ban someone he always has a good reason.\nGeneral Falcon: Unsure, could be a bit more active.\nCtrl Alt Defeat: No. Not that active, doesn't socialize with players much, and I remember banning him and his buddy a LONG time ago for ghosting.\nCorey w Rogerson: No, he's a good player at time but also causes drama. (Trolol copy) He also seems to troll once in a while.\nUnnamed: No, he's been here for about a month.\nDomineeto: No. Check half of his posts on the forums, he's just trying to troll and derails threads too often.\nJames: Unsure. Nothing too bad about him, just not active enough."},{"postId":31179,"topicId":3812,"posterId":4,"postTime":1314563109,"postText":"I'd suggest putting Playerhata & Mongo on trial mod and accepting Destar. The rest, i would decline."},{"postId":31181,"topicId":3812,"posterId":272,"postTime":1314563915,"postText":"Current Applications:\nLuamerava - Neutral\nPlayerhata - Good player, follows the rules and gets admins when needed\nChevy - Fuck no\nUdane - Neutral\nMongo - Trial \nGeneral Falcon - who?\nCtrl Alt Defeat - Who?\nCorey w Rogerson - Likes to troll just a little bit too much\nDomineeto - Possibly\nJames - Neutral\nDestar - Yes, good choice\nBreadman - Trial\nEDIT:\nCrisis - No. \n\nHow many mods are we looking at picking up?"},{"postId":31187,"topicId":3812,"posterId":115,"postTime":1314566198,"postText":"Destar although he is a great player and knows the rules, always needs to be right, and often attempts to come to me with requests to ban members of nnjg with no other proof other than his word.\n\nAlso seems too cocky. I think he's a better player than part of administration."},{"postId":31189,"topicId":3812,"posterId":252,"postTime":1314566377,"postText":"Luamerava: Neutral, seen her rage but she follows all the rules.\nPlayerhata:  Active, never abused would be a good candidate.\nChevy: No.\nUdane: I like Udane and his maps he created but I think I'm going to have to say no when he leaves for being targeted and comes back wanting mod back.\nMongo: I'm with Koboold, trial moderator.\nGeneral Falcon: Not active enough.\nCtrl Alt Defeat: Not active enough.\nCorey w Rogerson: Neutral, he starts up a ton of shit with crisis and other players but will post ban request and get a admin if there is something important on the server.\nUnnamed: Leaning toward no, He joined not that long ago but is a great player and follows the rules.\nDomineeto: No, he is a huge troll.\nJames: Neutral.\nDestar: Like playerhata, good candidate and gets a admin if there is something really important."},{"postId":31200,"topicId":3812,"posterId":101,"postTime":1314570135,"postText":"Quick tally:\n\n1 point for a yes\n1 point for a \"trial moderator\"\n1/2 for a maybe\n0 for a no\n\nLuamerava: 2.5 out of 10\nPlayerhata: 9.5 out of 10\nChevy: 0.5 out of 10\nUdane: 5.5 out of 11\nMongo: 7 out of 9\nGeneral Falcon: 0.5 out of 9\nCtrl alt defeat: 1 out of 9\nCorey: 2.5 out of 11\nUnnamed: 1 out of 7\nDomineeto: 4.5 out of 10\nJames: 1.5 out of 5\nDestar: 4 out of 5 (I say yes as well)\n\nOur top candidate right now is Playerhata, followed by Mongo and Destar, Udane, then finishing with Domineeto. Anyone with a less of a ratio than Domineeto I'm pretty sure we can all agree to deny."},{"postId":31201,"topicId":3812,"posterId":101,"postTime":1314570350,"postText":"I added Popl to the main post (forgive this double post.)\n\nI say MAYBE to him. He's a good player but there's a lot more PeOPLe in line before him for mod."},{"postId":31204,"topicId":3812,"posterId":153,"postTime":1314571075,"postText":"I think we should test Player and Chevy, and make Udane mod.\nThat is my final input.\nGash, you've got the choice.\nAnd I know that I'm gonna get shit for the Chevy thing too, but I'm with Bewm. He at least deserves to be tested.\nHe's a nice player, and just because you guys don't like him doesn't mean he doesn't deserve a chance."},{"postId":31206,"topicId":3812,"posterId":6,"postTime":1314571806,"postText":">> Ben\":2a9ya0lf]I think we should test Player and Chevy, and make Udane mod.\nThat is my final input.\nGash, you've got the choice.\nAnd I know that I'm gonna get shit for the Chevy thing too, but I'm with Bewm. He at least deserves to be tested.\nHe's a nice player, and just because you guys don't like him doesn't mean he doesn't deserve a chance. \nSo, wait, you think we should do that, and deny the rest? If Chevy deserves to be tested, doesn't the others have just as much as a right as he does? I'm all for giving people a chance, but if it's only person, and mainly because he's disliked, isn't it only fair for the others to get chances too?"},{"postId":31207,"topicId":3812,"posterId":153,"postTime":1314572524,"postText":">> >> Ben\":2uwljc1z]I think we should test Player and Chevy, and make Udane mod.\nThat is my final input.\nGash, you've got the choice.\nAnd I know that I'm gonna get shit for the Chevy thing too, but I'm with Bewm. He at least deserves to be tested.\nHe's a nice player, and just because you guys don't like him doesn't mean he doesn't deserve a chance. \nSo, wait, you think we should do that, and deny the rest? If Chevy deserves to be tested, doesn't the others have just as much as a right as he does? I'm all for giving people a chance, but if it's only person, and mainly because he's disliked, isn't it only fair for the others to get chances too? \nHypothetically, yes.\nHowever, We cannot test everyone. Thats why I posted who I think should be tested at the time.\nDo you think testing EVERYONE who applied is a good idea?"},{"postId":31208,"topicId":3812,"posterId":6,"postTime":1314572716,"postText":">> Ben\":yr4xf2dz]>> >> Ben\":yr4xf2dz]I think we should test Player and Chevy, and make Udane mod.\nThat is my final input.\nGash, you've got the choice.\nAnd I know that I'm gonna get shit for the Chevy thing too, but I'm with Bewm. He at least deserves to be tested.\nHe's a nice player, and just because you guys don't like him doesn't mean he doesn't deserve a chance. \nSo, wait, you think we should do that, and deny the rest? If Chevy deserves to be tested, doesn't the others have just as much as a right as he does? I'm all for giving people a chance, but if it's only person, and mainly because he's disliked, isn't it only fair for the others to get chances too? \nHypothetically, yes.\nHowever, We cannot test everyone. Thats why I posted who I think should be tested at the time.\nDo you think testing EVERYONE who applied is a good idea? \nNo, not at all, that would a horrible idea, What I'm trying to say is, there are others who deserve to be tested ABOVE Chevy IMO, I highly doubt he can handle it, and I'm not one of the ones who hate him, as well."},{"postId":31209,"topicId":3812,"posterId":101,"postTime":1314572780,"postText":"In the past few days, Chevy has SPAMMED me to get a recommendation. Chevy quit then rejoined all in 1 day, and it seems like he is TRYING to start drama (but ultimately failing.) Every day in some way I hear a complaint from Chevy that goes \"Everyone hates me.\" or before we opened it every week \"Does everyone hate me?\" He is a nervous wreck and I can just imagine if we give him mod then some troll will get him angry and he'll go on a perma-ban spree. Am I immature for saying this? Slightly.\n\nIn fact, I thought Destar WAS a mod before this."},{"postId":31210,"topicId":3812,"posterId":101,"postTime":1314573206,"postText":"Sorry again for the double post, but put the person with the FEWEST votes mod and just ignore the other people (Mongo/Destar) who have been here 4 times longer than him, doesn't make drama, and have been good loyal players?\n\nAlso, Moonrakeone is a yes for me.\n\n\nEDIT: Not to mention Chevy JUST joined the forums, probably just for the fact of applying for mod. He doesn't even meet the requirements to even have his application CONSIDERED. To be honest if I were Mongo and I didn't get mod but Chevy did, I'd bonk someone."},{"postId":31214,"topicId":3812,"posterId":142,"postTime":1314574317,"postText":"I see how you guys would deny Chevy and I can agree but watch him for a few days, if anything changes from him, then he has a shot, if not then by all means deny him. People can have a quick change of pace, along with him being young, he's probably still learning, and he's just doing what's been done to him. I'm not saying to deny the others, for they have more right if not less than Chevy but that doesn't mean Chevy will never be able to control himself. If he messes up then I'll take the punishment and blame for it, since I am the first one to say that he should have a shot. Anyway even if it isn't now, at least help him be ready for it in the future instead of ignoring him and thinking that he will always be bad. Get calm and talk to him. I'm with Ben on what he said for the most part anyway, just because you don't like someone doesn't mean that they don't have what it takes or whatever. \n\nSorry for the long rant but yeah TL;DR version: Don't go denying him just because you don't like him. Just watch him, he could be better if actually helped through it along with getting talks from our staff."},{"postId":31215,"topicId":3812,"posterId":153,"postTime":1314574469,"postText":">> I see how you guys would deny Chevy and I can agree but watch him for a few days, if anything changes from him, then he has a shot, if not then by all means deny him. People can have a quick change of pace, along with him being young, he's probably still learning, and he's just doing what's been done to him. I'm not saying to deny the others, for they have more right if not less than Chevy but that doesn't mean Chevy will never be able to control himself. If he messes up then I'll take the punishment and blame for it, since I am the first one to say that he should have a shot. Anyway even if it isn't now, at least help him be ready for it in the future instead of ignoring him and thinking that he will always be bad. Get calm and talk to him. I'm with Ben on what he said for the most part anyway, just because you don't like someone doesn't mean that they don't have what it takes or whatever. \n\nSorry for the long rant but yeah TL;DR version: Don't go denying him just because you don't like him. Just watch him, he could be better if actually helped through it along with getting talks from our staff. \nWell said. Much better than what I wrote XD.\nAnd btw, I know what was said to him on TTT, if you were one of the admins who trolled him on TTT, don't even think about posting; and next time, follow the do's and don'ts."},{"postId":31220,"topicId":3812,"posterId":4,"postTime":1314576019,"postText":"I have to agree with what Dum said."},{"postId":31221,"topicId":3812,"posterId":101,"postTime":1314577061,"postText":"Chevy has been here for about 1 month. Mongo and Destar have been for 8+ months.\n\nHonestly, if we test Chevy, we have to test pretty much everyone else too. If we only test him then like Playerhata, that would make it completely unfair to everyone in between. Look at the tallies again.\n\n0.5 out of 11. That is the worst ratio there.\n\nI don't care if Chevy is a little kid. I don't mind little kid admins at all in any way, as long as they have good judgement. Chevy's judgement to get a recommendation if they don't immediately reply: Spam them. He LITERALLY earlier was just clicking on the voice call then the hang up over and over to get my attention. He was also starting to spam the in game chat, disrupting the community AND breaking the rules."},{"postId":31224,"topicId":3812,"posterId":272,"postTime":1314578465,"postText":"With the way Chevy conducts himself from what I've seen, he doesn't deserve mod, and if he continues, he never will."},{"postId":31230,"topicId":3812,"posterId":153,"postTime":1314579888,"postText":">> With the way Chevy conducts himself from what I've seen, he doesn't deserve mod, and if he continues, he never will. \nMay I ask for your reasoning?"},{"postId":31231,"topicId":3812,"posterId":4,"postTime":1314580264,"postText":">> Ben\":2qcnum2z]>> With the way Chevy conducts himself from what I've seen, he doesn't deserve mod, and if he continues, he never will. \nMay I ask for your reasoning? \nI could ask you the same question, Ben."},{"postId":31235,"topicId":3812,"posterId":153,"postTime":1314581393,"postText":">> >> Ben\":318uk8bi]>> With the way Chevy conducts himself from what I've seen, he doesn't deserve mod, and if he continues, he never will. \nMay I ask for your reasoning? \nI could ask you the same question, Ben. \nRead page 2 me and bewm."},{"postId":31239,"topicId":3812,"posterId":4,"postTime":1314582428,"postText":">> Ben\":1xa30cwt]Read page 2 me and bewm. \nI did.\nYou may say he's a nice player, but that's pretty much the only arguement i saw. Some of our other applicants are extremely nice people as well, and appear more suitable.\nTTT needs good moderators, not a young person who could use a life lesson. (Based on what Bewm said)"},{"postId":31245,"topicId":3812,"posterId":272,"postTime":1314583551,"postText":">> Ben\":n9jjmr5z]>> With the way Chevy conducts himself from what I've seen, he doesn't deserve mod, and if he continues, he never will. \nMay I ask for your reasoning? \n\n\nHe has an extremely short temper, he left and rejoined NNJG in the same day, (extremely impulsive) and he thinks that people hate him. (He asks me as well as others if we hate him on a regular basis) Giving someone like that power is ultimately a bad decision."},{"postId":31253,"topicId":3812,"posterId":6,"postTime":1314585173,"postText":"James - Undecided.\nDestar - Yes, He could handle it.\nHuman Aimbot - Maybe, I haven't played enough with him.\nPopl - Yes, been here long enough, good choice.\nMoon - Undecided.\nNinjaBreadMan - YES YES YES YES YES YES."},{"postId":31256,"topicId":3812,"posterId":101,"postTime":1314585805,"postText":"NinjaBreadMan - YES\nHuman Aimbot - Yes."},{"postId":31264,"topicId":3812,"posterId":2,"postTime":1314588095,"postText":"Personally I think NinjaBreadMan is too immature and unprofessional to be considered as a Moderator."},{"postId":31268,"topicId":3812,"posterId":115,"postTime":1314589791,"postText":">> Personally I think NinjaBreadMan is too immature and unprofessional to be considered as a Moderator. \nThis.\n\nI also havent seen him on as much as he use to be."},{"postId":31270,"topicId":3812,"posterId":54,"postTime":1314590270,"postText":"Luamerava - No opinion really\n\nPlayerhata - Yes. Very active, knows the rules, NEVER banned, deserves it.\n\nChevy - No (will post the reason below.)\n\nUdane - No. Don't get me wrong, he IS a good guy. But he left because he was demoted from mod, then came back because he was made a deal to get a prop. And if he didn't get either mod or that prop, he would leave the community again. That's not a good member or mod IMO, I don't think we should give in.\n\nMongo - Possibly. I've seen him troll younger kids, leaning towards no.\n\nGeneral Falcon - Not that active, no.\n\nCtrl Alt Defeat - not active, no.\n\nCorey w Rogerson - No. Causes drama, can rage easy, assumes a lot.\n\nUnnamed - inactive as fuck, no.\n\nDomineeto - Yes, he's been mod, he can handle it, and it seems like he can again.\n\nJames - No, he's not active\n\nDestar - Yes. Very active, deserves it.\n\nHuman Aimbot - No. He should focus on jail more, not TTT.\n\nPopl - Yes. knows the rules, and he's been with us for a long ass time.\n\nMoon - Yes. Knows the rules, active, very good player.\n\nNinjaBreadMan - no opinion.\n\nREASON FOR NO FOR CHEVY:\n>> Chevy: Mark\nCaptain Mark: wat\nChevy: u dont think i deserve mod\nChevy: dont u\nChevy: Tell the truth please\nCaptain Mark: 1. I haven't seen you on enough\nCaptain Mark: 2. No, I don't think you can handle it.\nChevy: i dont handle it ?\nChevy: D:\nChevy: ....\nCaptain Mark: I said I don't think you CAN handle it\nChevy: ooooooooo]  \n\n>> 11:25 PM - Chevy: u lucky ass\n11:25 PM - Chevy: Its so obvious u deserve <od\n11:25 PM - Chevy: Mod\n11:25 PM - Playerhata: Thank you?\n11:25 PM - Chevy: not fair >:O\n11:25 PM - Playerhata: How?\n11:26 PM - Chevy: i've been here long too\n11:26 PM - Chevy: im not imature\n11:26 PM - Chevy: i dont troll\n11:26 PM - Playerhata: That doesn't qualify someone for mod :\\\n11:26 PM - Chevy: they say i rdm\n11:26 PM - Chevy: when they killed an inno\n11:26 PM - Chevy: they say i prop push when i dont mean to\n11:27 PM - Playerhata: Who does?\n11:27 PM - Chevy: They say I\n11:27 PM - Chevy: prop push\n11:27 PM - Chevy: when i dont\n11:28 PM - Playerhata: Who does.\n11:28 PM - Chevy: Udane\n11:28 PM - Chevy: thinks that\n11:28 PM - Playerhata: That is good for Udane.\n11:28 PM - Chevy: tell me i prop push?\n11:28 PM - Chevy: UDANE?\n11:28 PM - Chevy: TELL ME I PROP PUSH\n11:28 PM - Chevy: WHEN I DONT?\n11:33 PM - Playerhata: Please stop\n11:33 PM - Chevy: wat?\n11:33 PM - Chevy: O.o\n11:33 PM - Playerhata: Playing the victim.\n11:33 PM - Chevy: What are u talking about\n11:33 PM - Chevy: Is udane saying\n11:33 PM - Chevy: he doesnt\n11:34 PM - Playerhata: No God Dammit, stop playing the victim.\n11:34 PM - Chevy: what are u talking about\n11:34 PM - Chevy: I dont prop push\n11:34 PM - Chevy: and udane says i do it\n11:35 PM - Playerhata: Chevy, please, for now on no longer come to me with your problems or I will block you. Interpret this as you wish.\n11:35 PM - Chevy: D:\n11:35 PM - Chevy: did u actually hate me?\n11:35 PM - Chevy: the whole time?\n11:35 PM - Chevy: this isnt a problem\n11:35 PM - Chevy: this is a question\n11:37 PM - Chevy Sighs \n\nnuff said."},{"postId":31271,"topicId":3812,"posterId":101,"postTime":1314590916,"postText":"And he does that to every single one of us."},{"postId":31272,"topicId":3812,"posterId":2,"postTime":1314592256,"postText":"Updated, without details:\n\nLuamerava: No\nPlayerhata: Yes\nChevy: No\nUdane: Yes\nMongo: No\nGeneral Falcon: No\nCtrl Alt Defeat: No\nCorey w Rogerson: No\nUnnamed: No\nDomineeto: No\nJames: No\nDestar: Yes\nHuman Aimbot: No\nPopl: No\nMoon: Yes\nNinjaBreadMan: No\n\nAnd about Chevy, Mark, wow."},{"postId":31276,"topicId":3812,"posterId":54,"postTime":1314596615,"postText":"with no details as well:\n\nLuamerava: no opinion\nPlayerhata: yes\nChevy: no\nUdane: no\nMongo: no opinion\nGeneral Falcon: no\nCtrl Alt Defeat: no\nCorey w Rogerson: no\nUnnamed: no\nDomineeto: yes\nJames: no\nDestar: yes\nHuman Aimbot: no\nPopl: no\nMoon: yes\nNinjaBreadMan: no"},{"postId":31282,"topicId":3812,"posterId":115,"postTime":1314631961,"postText":"Luamerava-No\nPlayerhata-Yes\nChevy-No\nUdane-NO\nMongo-Yes\nGeneral Falcon-No\nCtrl Alt Defeat-No\nCorey w Rogerson-No\nUnnamed-No\nDomineeto-No opinion\nJames-No\nDestar-Maybe, leaning to no\nHuman Aimbot-No opinion\nPopl-Yes\nMoon-No opinion\nNinjaBreadMan-No"},{"postId":31287,"topicId":3812,"posterId":153,"postTime":1314648027,"postText":"Crisis, yes.\nBefore you bitch, read what I write.\nCrisis was a good mod, until he got demoted unfairly. He knows the rules better than anyone.\nHe is extremely active. He has fun. Why does this matter?\nPeople like admins who HAVE FUN on the server. Admins who have fun tend to be better and more active admins.\nHe also has good judgement, an although he may take things too personally sometimes, it wouldn't get in the way of him being a good admin."},{"postId":31306,"topicId":3812,"posterId":101,"postTime":1314654037,"postText":"Crisis seems to occasionally make up his own rules."},{"postId":31311,"topicId":3812,"posterId":735,"postTime":1314654565,"postText":">> Ben\":2p0ubmbu]Crisis, yes. although he may take things too personally sometimes, it wouldn't get in the way of him being a good admin. \n>> Corey w Rogerson - No. He takes things way to personally. \nIf you take things too personal it changes the outcome for that person if they broke a rule. e.g A longer ban. I know these are 2 different people, but, they both equally take things too personal."},{"postId":31317,"topicId":3812,"posterId":153,"postTime":1314655966,"postText":">> >> Ben\":tzhkq5xb]Crisis, yes. although he may take things too personally sometimes, it wouldn't get in the way of him being a good admin. \n>> Corey w Rogerson - No. He takes things way to personally. \nIf you take things too personal it changes the outcome for that person if they broke a rule. e.g A longer ban. I know these are 2 different people, but, they both equally take things too personal. \nIf you noticed i said \"sometimes\" and \"it would not get in the way of him being a good admin\"\nthese were not said for corey, because they do not hold true for him"},{"postId":31324,"topicId":3812,"posterId":2,"postTime":1314656649,"postText":"He takes things too personally and overreacts to the slightest issue. He may enforce the rules strictly, but he also enforces  his  rules strictly. He tries to make ban requests for the people he doesn't like, by finding the smallest bit of evidence for any offense, which usually doesn't work out. I don't trust or support Crisis in any way as a Moderator."},{"postId":31325,"topicId":3812,"posterId":153,"postTime":1314656860,"postText":">> He takes things too personally and overreacts to the slightest issue. He may enforce the rules strictly, but he also enforces  his  rules strictly. He tries to make ban requests for the people he doesn't like, by finding the smallest bit of evidence for any offense, which usually doesn't work out. I don't trust or support Crisis in any way as a Moderator. \nYou shouldn't have demoted him in the first place. You need to learn to trust him. He would be one of the best mods.\nI have no idea why you don't like him."},{"postId":31327,"topicId":3812,"posterId":735,"postTime":1314657804,"postText":">> Ben\":1t2vjq60]If you noticed i said \"sometimes\" and \"it would not get in the way of him being a good admin\"these were not said for corey, because they do not hold true for him \nProof he takes everything too personal imo\nhttp://nonerdsjustgeeks.com/forum/viewtopic.php?f=122&t=3322"},{"postId":31335,"topicId":3812,"posterId":101,"postTime":1314660110,"postText":"Crisis: No\nWeegee:  NO "},{"postId":31336,"topicId":3812,"posterId":735,"postTime":1314660498,"postText":">> Crisis: No\nWeegee:  NO  \nYeah both of them are both a definite no imo."},{"postId":31342,"topicId":3812,"posterId":4,"postTime":1314661084,"postText":"  I think it's about time to accept/deny some of the applications. Ben? Gash?  "},{"postId":31346,"topicId":3812,"posterId":54,"postTime":1314662224,"postText":">> Ben\":epfa16ab]>> He takes things too personally and overreacts to the slightest issue. He may enforce the rules strictly, but he also enforces  his  rules strictly. He tries to make ban requests for the people he doesn't like, by finding the smallest bit of evidence for any offense, which usually doesn't work out. I don't trust or support Crisis in any way as a Moderator. \nYou shouldn't have demoted him in the first place. You need to learn to trust him. He would be one of the best mods.\nI have no idea why you don't like him.  The slaying of the whole server because he got mod might have something to do with it."},{"postId":31357,"topicId":3812,"posterId":115,"postTime":1314663562,"postText":"Crisis-no\nLuigi-no\n\nCan someone add up the yes/nos/maybes please?"},{"postId":31566,"topicId":3812,"posterId":84,"postTime":1314826303,"postText":"Current Staff Approval of  Applications:\nLuamerava - Yes:       No:  4     Maybe: 5\n\nPlayerhata - Yes: 10     No:       Maybe: 1\n\nChevy - Yes:       No: 10      Maybe: 2\n\nUdane - Yes:  4     No:  7     Maybe: 1\n\nMongo - Yes: 8     No: 1      Maybe: 3(Putting Pharaoh's answer as maybe, and Kob's/Over's as yes.)\n\nGeneral Falcon - Yes: 1      No: 7    Maybe: 1\n\nCtrl Alt Defeat - Yes: 1       No: 8     Maybe:\n\nCorey w Rogerson - Yes: 1      No: 6     Maybe: 5 (Putting Kob's answer as No, correct if wrong)\n\nUnnamed - Yes:       No: 7      Maybe: 1(No opinion from Gash)\n\nDomineeto - Yes: 4      No: 3      Maybe: 3\n\nJames - Yes:       No:  4     Maybe: 4\n\nDestar - Yes: 5      No:       Maybe: 1\n\nHuman Aimbot - Yes: 1      No: 2      Maybe: 1\n\nPopl - Yes: 3      No:  1     Maybe: 1\n\nMoon - Yes: 2      No:       Maybe: 1\n\nNinjaBreadMan - Yes: 3      No: 2      Maybe:\n\nSohisohi - Yes:       No:       Maybe:\n\n__Crisis - Yes: 1      No: 4      Maybe:\n\nLuigi - Yes:       No: 3      Maybe:\n\nIf I made a mistake in this, please let me know where so I can edit it( or you edit it yourself)\n\nEDIT: I also put the Unsures as maybe, since I myself was unsure about where to put them."},{"postId":31643,"topicId":3812,"posterId":735,"postTime":1314848454,"postText":"@Chopper Do those include admins in recommendations?"},{"postId":31659,"topicId":3812,"posterId":84,"postTime":1314874529,"postText":"What do you mean do those include admins in recommendations? The way it's worded kinda confuses me :|"},{"postId":31667,"topicId":3812,"posterId":735,"postTime":1314882746,"postText":">> What do you mean do those include admins in recommendations? The way it's worded kinda confuses me :| \nIn the 15 recommendations, some people got admins to recommend them."},{"postId":31678,"topicId":3812,"posterId":84,"postTime":1314892981,"postText":"I didn't count those recommendations. I never thought about that actually. If you want any of you want, I probably could go ahead and do that."},{"postId":31773,"topicId":3812,"posterId":373,"postTime":1314950323,"postText":"Luamerava No\nPlayerhata Yes\nChevy No GOD no\nUdane Unsure\nMongo Unsure\nGeneral Falcon No\nCtrl Alt Defeat No\nCorey w Rogerson No\nUnnamed No\nDomineeto Yes\nJames No\nDestar Yes\nHuman Aimbot No, stick to jb pl0x\nPopl Unsure\nMoon No\nNinjaBreadMan No\nSohisohi Unsure\n__Crisis Unsure, leaning toward no\nLuigi No"},{"postId":31838,"topicId":3812,"posterId":101,"postTime":1315009278,"postText":"Alright, it's time to accept or deny people now."},{"postId":31891,"topicId":3812,"posterId":4,"postTime":1315023709,"postText":">> Alright, it's time to accept or deny people now. \n7 people denied so far."},{"postId":31892,"topicId":3812,"posterId":115,"postTime":1315023795,"postText":"I'm assuming this is just the first round of denied members?"},{"postId":31893,"topicId":3812,"posterId":4,"postTime":1315023878,"postText":">> I'm assuming this is just the first round of denied members? \nCorrect. Excluding Chevy & Unnamed [ON HOLD], these were the more unpopular choices."},{"postId":31994,"topicId":3812,"posterId":4,"postTime":1315097452,"postText":"About how many new TTT mods are we looking to pick up?"},{"postId":32002,"topicId":3812,"posterId":153,"postTime":1315098401,"postText":"Chevy has been denied."},{"postId":32025,"topicId":3812,"posterId":373,"postTime":1315111037,"postText":">> Ben\":3d1ofckt]Chevy has been denied. \n\nThank you. And what Kry said, how many are we lookin'' to promote?"},{"postId":32057,"topicId":3812,"posterId":153,"postTime":1315142443,"postText":">> >> Ben\":kyxuoh08]Chevy has been denied. \n\nThank you. And what Kry said, how many are we lookin'' to promote? \nI don't think we have a set number, but if they are qualified they will most likely be accepted."},{"postId":32605,"topicId":3812,"posterId":101,"postTime":1315442726,"postText":"Purple: Maybe, I haven't really seen her on much. When I do, she doesn't seem to really talk much or anything.\n\nAlso, when we finally do start to accept people, how about we get through all the applications first before actually adding them to the forum administration. Once we accepted/denied everybody, delete this topic THEN add them. Basically adding on to before: Add everyone at once after deleting this topic."},{"postId":32606,"topicId":3812,"posterId":4,"postTime":1315442830,"postText":"I don't know about Purple either. To me, it's more about the harassment, and that she is quite silent."},{"postId":32637,"topicId":3812,"posterId":115,"postTime":1315448431,"postText":"Purple I'd say yes.\n\nI honestly think the fact that she's a girl may affect how people view her, but at the same time I do believe she handles insults and teasing very well and does not get angry very easily.\n\nShe's silent most likely because she's a girl, and she doesn't like to use it when she doesn't have to (more of a chat person). \n\nShe is active a lot of the time, and although it shouldn't affect our decisions, I think a girl on the administration would be good."},{"postId":32639,"topicId":3812,"posterId":101,"postTime":1315449137,"postText":">> She's silent most likely because she's a girl  \n\nSlightly stereotypical."},{"postId":32641,"topicId":3812,"posterId":115,"postTime":1315450053,"postText":"No, I meant more like there's no other girls on the server so she doesn't feel as comfortable to use her mic."},{"postId":32692,"topicId":3812,"posterId":101,"postTime":1315508474,"postText":">> No, I meant more like there's no other girls on the server so she doesn't feel as comfortable to use her mic. \n\nExcept for Luam. Makes sense."},{"postId":32696,"topicId":3812,"posterId":115,"postTime":1315513759,"postText":"Well obviously some girls feel comfortable, others dont. You get the point, stop making a big deal about it. It wasn't meant to be sexism, and you know it."},{"postId":32697,"topicId":3812,"posterId":101,"postTime":1315514029,"postText":"\"Makes sense\" wasn't sarcasm for once."},{"postId":32736,"topicId":3812,"posterId":115,"postTime":1315531653,"postText":"The way you worded it made it sound weird and sarcastic :S my bad"},{"postId":32887,"topicId":3812,"posterId":54,"postTime":1315691893,"postText":"I think Purple would make an excellent mod/admin. I vote yes for her. Her and Player would be the best choices imo.\n\n(no, I don't like purple, and i'm not saying that for a reason like that :| ) I think she's cool, that's all."},{"postId":33349,"topicId":3812,"posterId":142,"postTime":1316149276,"postText":"Uhh any word on the apps? Nothing so far."},{"postId":33352,"topicId":3812,"posterId":373,"postTime":1316151025,"postText":"Yeah.. Cause they've just been sitting there. Nothing really being discussed"},{"postId":33693,"topicId":3812,"posterId":101,"postTime":1316462774,"postText":"Don't we have to delete this once we let Playerhata have admin on the forums?"},{"postId":33708,"topicId":3812,"posterId":2,"postTime":1316468266,"postText":"It was moved to Top-Level Administration, derp.\n\n>> Here's a list of who has access:\n[NNJG]Ben\nMr. Gash\nBird Flu\nKryzoid\nPunkedmind\nDum "},{"postId":33711,"topicId":3812,"posterId":101,"postTime":1316469320,"postText":">> It was moved to Top-Level Administration, derp.\n\n>> Here's a list of who has access:\n[NNJG]Ben\nMr. Gash\nBird Flu\nKryzoid\nPunkedmind\nDum  \n\nI responded to it when it was still in Staff-Section, I believe."},{"postId":33717,"topicId":3812,"posterId":2,"postTime":1316471723,"postText":"Nope."}]}