{"topicId":4943,"forumId":24,"topicTitle":"What is your favorite nostalgic game?","topicTime":1321797993,"topicViews":32,"topicReplies":7,"topicStatus":0,"topicFirstPosterName":"Domineeto","topicFirstPosterColor":"","topicLastPosterName":"Mimeyy","topicLastPosterColor":"","topicLastPostTime":1321824341,"posts":[{"postId":38146,"topicId":4943,"posterId":82,"postTime":1321797993,"postText":"Mine is Sonic Adventure 2 Battle, that was the only game me and my brothers played for years, I easily put 1000-2000 hours into the Chao garden, I had the best Chao in school. Until I sent my Chao away to see what would happen, never played game again."},{"postId":38149,"topicId":4943,"posterId":735,"postTime":1321808744,"postText":"Console:Goldeneye, I still play it when ever my brother from Georgetown comes over for something. Funnest game ever.\nHandheld: Pokemon Red and Blue: Almost 9 years of just playing it. Fun with the missingno glitch, About 700 hours on each of them."},{"postId":38157,"topicId":4943,"posterId":517,"postTime":1321812955,"postText":"Sonic 2 adventure battle was great but I loved pikmen with passion, I actually got sad when my little pikmen died"},{"postId":38158,"topicId":4943,"posterId":4,"postTime":1321812977,"postText":"Super Mario 64, the original smash bros, james bond: agent under fire (the multiplayer)\nsonic adventure 2 battle as well. Maybe even LOZ: WW"},{"postId":38167,"topicId":4943,"posterId":812,"postTime":1321816867,"postText":"Fucking Halo 2 on the original Xbox Live.\n\nI picked up that shit right when I got into Junior High. It was really the first ever gaming online experience I've had, and I still feel it was the best. Such a simple game, yet tons and tons of fun. I seriously get pretty depressed when I think about all the memories I have, and all the friends I made. Sucks that Microsoft shut down all the original Live games, and still hasn't extended the Friend's List limit. \n\nR.I.P Halo 2"},{"postId":38172,"topicId":4943,"posterId":634,"postTime":1321823143,"postText":"Starcraft, Halo 1, and Super Smash Bros, that pretty much sums up my childhood right there."},{"postId":38177,"topicId":4943,"posterId":243,"postTime":1321824033,"postText":"Anything Gamecube/N64\n (OoT, Mario 64, DonkeyKong 64, Super Mario sunshine, Pikmin, Pikmin 2, SSB, SSBM, Sonic Adventure 2 Battle FTW. Pikmin will last FOREVER) \nOh and to NBLCKK, Its \"Pikmin\" And they are making Pikmin 3."},{"postId":38180,"topicId":4943,"posterId":769,"postTime":1321824341,"postText":">> Fucking Halo 2 on the original Xbox Live.\n\nR.I.P Halo 2 This. I also have tons of memories from that game, it truely was much much more than just an \"Alien shooting game\". The community was fantastic, I miss playing on LIVE very much."}]}