{"topicId":4314,"forumId":4,"topicTitle":"What would you guys think of this?","topicTime":1316992520,"topicViews":301,"topicReplies":26,"topicStatus":0,"topicFirstPosterName":"[NNJG]Ben","topicFirstPosterColor":"000000","topicLastPosterName":"nicholsml","topicLastPosterColor":"","topicLastPostTime":1319821867,"posts":[{"postId":34293,"topicId":4314,"posterId":153,"postTime":1316992520,"postText":"Hey,\nI got an idea for what would be called \"premier\" servers, and I'm wondering what you guys would think of this.\nKeep in mind this would not affect our current servers in any way.\n\nBasically,\nWe have a set of premier servers(darkrp, perp, CS:S deathmatch, ect.)\nThese servers are basically the same as the normal servers\nexcept:\n-There is better administration\n-We will hire coders and mappers much more often to improve these servers.\n-Almost all(if not all) players will be dedicated and will follow the rules(as you need to pay, people won't pay to be able to troll a server.)\n-We will be able to do fun giveaways and stuff(because we'll have the money to get prizes and such.)\n\nIt would cost like $5 a month per person.\n\nWhat would you guys think?"},{"postId":34294,"topicId":4314,"posterId":634,"postTime":1316992826,"postText":"IF you could convince people that the monthly payment was worth it, then I think it would be fantastic, but you would have to have some really unique traits in he server that set it apart from the rest. \nAlso make the payment for standard playing on the server 3 dollars a month and a VIP membership 5 dollars a month, and maybe throw in an elite membership for 10 dollars a month."},{"postId":34299,"topicId":4314,"posterId":112,"postTime":1316996180,"postText":">> Ben\":1hv3brwy]Hey,\n\n-There is better administration\n \n\nI'm sure current admins will take no offense to this. \n-.-"},{"postId":34300,"topicId":4314,"posterId":1094,"postTime":1316997296,"postText":"I guess it could be okay.  I personally can't afford to take part since I have no income in college, and the one thing that worries me is that it will split up the regulars, with some going over to the premier servers while others who can't/won't pay have to play without their friends on the regular ones.  But it really isn't my place."},{"postId":34303,"topicId":4314,"posterId":153,"postTime":1316998401,"postText":">> >> Ben\":2razlt85]Hey,\n\n-There is better administration\n \n\nI'm sure current admins will take no offense to this. \n-.- \nI never said our administration was bad."},{"postId":34336,"topicId":4314,"posterId":243,"postTime":1317010138,"postText":"I'd like to say...\nThis would last about.. one month.\nPlus we would need more admins.\nWhy not hire coders for the normal servers, and actually add good VIP benefits?"},{"postId":34342,"topicId":4314,"posterId":237,"postTime":1317011617,"postText":"No. Monthly fees are a turn off, and the servers would suffer from emptyness."},{"postId":34348,"topicId":4314,"posterId":612,"postTime":1317027662,"postText":"I'm down, if we get a modeler."},{"postId":34355,"topicId":4314,"posterId":373,"postTime":1317033616,"postText":"I like the general idea of having a premium server.. But who would pay 5$ to play on a server when you can join a free one?\nI've read the benefits and how amazing the servers would be, but I could imagine\nonly a couple of our regulars actually doing it. Then there would probably be \nlike 3-4 people alone in the servers, not including the \"Pro Administrative Team\" .  Juuust putting my opinion out there.\n\nIf there's several people willing to pay 5$ for a premium server, then by all means step forward!\nLet your voice be heard!"},{"postId":34356,"topicId":4314,"posterId":153,"postTime":1317037671,"postText":"We can't hire coders all the time because we don't have the money. Think about it this way:\n25 people.\nPremium RP Server\n$5 A month per person.\n$125 a month to hire coders/server fees.\nImagine the server with a monthly budget for coders. It'd be incredible."},{"postId":34359,"topicId":4314,"posterId":612,"postTime":1317063736,"postText":"What would coders do any way. What are the benefits."},{"postId":34360,"topicId":4314,"posterId":812,"postTime":1317063871,"postText":"If we don't have coders......we'd being paying for a default RP server with absolutely nothing original lol? Definitely not alot of servers like that out there -.-"},{"postId":34361,"topicId":4314,"posterId":634,"postTime":1317070106,"postText":">> What would coders do any way. What are the benefits. \nCustom items, interface, maybe even  custom NPCs, stuff like that.\nHaving a professional coder(s) makes a server very individual in the fact that it will most likely contain many extra features that a normal server would not."},{"postId":34382,"topicId":4314,"posterId":82,"postTime":1317081802,"postText":"Or we could become friends with the coders and ask them for a \"few\" favors, or just learn how code ourselves"},{"postId":34392,"topicId":4314,"posterId":634,"postTime":1317086957,"postText":">> learn how code ourselves Ok. Why not, how much different from c++ can it be?"},{"postId":34423,"topicId":4314,"posterId":115,"postTime":1317142348,"postText":"Sounds terrible. It's a good idea, but I can't imagine many people agreeing to it."},{"postId":34580,"topicId":4314,"posterId":735,"postTime":1317350676,"postText":"Looks good on paper, but, when it all boils down to it, not many people are going to do that.(pay)"},{"postId":34619,"topicId":4314,"posterId":945,"postTime":1317453277,"postText":"I don't think this is a good idea. It would likely further split the community."},{"postId":34657,"topicId":4314,"posterId":272,"postTime":1317514600,"postText":"I wouldn't pay for it. Besides, you'd have 3-7 people on AT MOST at peak hours of the day."},{"postId":35006,"topicId":4314,"posterId":456,"postTime":1317962203,"postText":"[troll_face] while we are at it, premium goldcraft sub-world with 10 admins instead of 3, and mushrooms everywhere![/trollface]\n\nNot that my opinion matters that much since I rarely venture out of Goldcraft these days, but I personally, if a lot of people did it, I would probably join too."},{"postId":35689,"topicId":4314,"posterId":101,"postTime":1318965257,"postText":"Well if we made VIP a monthly payment (Or at least an increased VIP for monthly, standard for 1 time) we'd be rich already."},{"postId":35729,"topicId":4314,"posterId":1099,"postTime":1318997306,"postText":"Instead of trying to create other servers, how about we just take that money and effort on the servers that NNJG already have? Not many people are going to want to pay $5 a month. NNJG's fan base isn't big enough to support this."},{"postId":35730,"topicId":4314,"posterId":101,"postTime":1318997640,"postText":"It isn't going to get bigger if we just improve our current ones, since all that does is just make the experience better for the regulars, not get more people to join."},{"postId":35769,"topicId":4314,"posterId":1099,"postTime":1319064535,"postText":">> It isn't going to get bigger if we just improve our current ones, since all that does is just make the experience better for the regulars, not get more people to join. \n\nMore people would join if the server size wasn't so small. We have a small player slot count compared to other servers."},{"postId":35779,"topicId":4314,"posterId":1097,"postTime":1319068019,"postText":">> >> It isn't going to get bigger if we just improve our current ones, since all that does is just make the experience better for the regulars, not get more people to join. \n\nMore people would join if the server size wasn't so small. We have a small player slot count compared to other servers. \n\nWell the reason small slot count is:\n1. To Prevent Rdm/ Amount of Trolling\n2. Most of our map was created for the size of 22 players"},{"postId":35816,"topicId":4314,"posterId":1087,"postTime":1319082495,"postText":"I like not having alot of people, becuase then it helps new poeple (I.E me) get to know people and become a regular easier. Its like a 22 person capacity family (Of lies and jailbreaking >.>)"},{"postId":36629,"topicId":4314,"posterId":1140,"postTime":1319821867,"postText":"It would definitely keep people more in-line, because I know I wouldn't want to get banned after spending money on something. However, I don't know how many people would want to do that. I personally would just stick with regular servers. Maybe if they payed like 5 dollars for a 1-time fee like VIP? Idk."}]}