{"topicId":2034,"forumId":122,"topicTitle":"Goldfish'' abooz","topicTime":1299112052,"topicViews":220,"topicReplies":10,"topicStatus":1,"topicFirstPosterName":"Balenti","topicFirstPosterColor":"990000","topicLastPosterName":"Pharaoh","topicLastPosterColor":"","topicLastPostTime":1299159867,"posts":[{"postId":16670,"topicId":2034,"posterId":373,"postTime":1299112052,"postText":"Offender name?: Goldfish16\nWhich Server?: Jailbreak\nOffender's Steam ID?: STEAM_0:1:28783115\nWhat the Offender did?: LoL he called freekill and slapped me. I shot him because he went into the armory and he got mad :l\nYou'll notice that another VIP was usin'' his power, he was punishing a freekiller that murdered 3 players while Mario was afk nd such, he also\nmuted himself because of the recent errors in hopes to fix it, which it did not. Screenie of abooze below :3\nAdmins on?: I think Mario is a Mod\nProof?:"},{"postId":16673,"topicId":2034,"posterId":496,"postTime":1299112935,"postText":"i vouch for this user, i showed goldfish the ropes yesterday and warned him to not abuse but since then it has been horrible.please limit his commands or something till he grows up."},{"postId":16681,"topicId":2034,"posterId":3,"postTime":1299116857,"postText":"This situation seems vaguely  familiar..."},{"postId":16682,"topicId":2034,"posterId":373,"postTime":1299118296,"postText":">> This situation seems vaguely  familiar... \n\nHmm? There are good VIPs that do what they do and help the community, and there are some that are immature and rage.  Mainly the community under the age of 12, they proceed to use their power to get back at the people for stupid reasons..  Then there are some that buy it for power (These people are mostly 12 year olds and below that demand respect >_>) which they use to act like mini-mods!  As a community member I daresay cannot tolerate this sort of behavior. I post these Ban/Abuse reports so bullshit doesn't happen where people get PO'd :3\n\nProblem?"},{"postId":16684,"topicId":2034,"posterId":112,"postTime":1299118788,"postText":"This picture doesn't prove abuse, it shows him slaying you with no other information. I really don't understand what the other VIP using his powers has to do with anything.\n\nA video would have been better proof in this situation.\n\nEdit: That picture doesn't even show him being muted."},{"postId":16690,"topicId":2034,"posterId":373,"postTime":1299120386,"postText":">> This picture doesn't prove abuse, it shows him slaying you with no other information. I really don't understand what the other VIP using his powers has to do with anything.\n\nA video would have been better proof in this situation.\n\nEdit: That picture doesn't even show him being muted. \n\nHe muted himself, you can see at the top.  I didn't know at the time that he'd get angry and slay me for killing him because he was in the armory, forgives me for thinking a rage slay was abuse."},{"postId":16692,"topicId":2034,"posterId":569,"postTime":1299121287,"postText":"I was not in fact in the armory!I was atleast ten feet away from the door!If I must,I will talk to you in game, face to face,probably next to an admin!I'll be on Thursday afteroon!Either you be there,or I'll tell them the real story on what happened!See you there!"},{"postId":16694,"topicId":2034,"posterId":373,"postTime":1299123012,"postText":">> I was not in fact in the armory!I was atleast ten feet away from the door!If I must,I will talk to you in game, face to face,probably next to an admin!I'll be on Thursday afteroon!Either you be there,or I'll tell them the real story on what happened!See you there! \n\nLOL your 10 feet away is being inside of the armory getting shot at by the fucking Guards.  See you when I see you lol\n\nEdit: Preferably when the chatbox is working, or in steamchat."},{"postId":16695,"topicId":2034,"posterId":569,"postTime":1299123754,"postText":"I was never in the armory that round! If an Admin could listen to this part of the writing!             The reason I slapped you is because you freekilled me! No I was not in the armory,I didn't even go in the armory that round! What happened is I was standing atleast ten feet away from the armory door!then what happened is you started tranking me for no reason! Then,when I only had about 30,mabe 40 health or less,you took out your primary weapon,and started unloading on me! This is what happened!!!"},{"postId":16697,"topicId":2034,"posterId":373,"postTime":1299124936,"postText":"Yea, you were. I'd ask some people to vouch for me but witnesses don't count, and I don't want to argue on the forums. \nAlso the reason you couldn't see is because while you were in the armory a guard was tranqing you.\nI opened fire after I saw you inside of the armory, now stop raging and let's talk on steamchat whenever an admin may be on =-=\n\nEdit: Don't doublepost, just edit the post you've posted before making another."},{"postId":16707,"topicId":2034,"posterId":112,"postTime":1299159867,"postText":">> >> This picture doesn't prove abuse, it shows him slaying you with no other information. I really don't understand what the other VIP using his powers has to do with anything.\n\nA video would have been better proof in this situation.\n\nEdit: That picture doesn't even show him being muted. \n\nHe muted himself, you can see at the top.  I didn't know at the time that he'd get angry and slay me for killing him because he was in the armory, forgives me for thinking a rage slay was abuse. \n\nThat's Dalek muting himself. The only thing goldfish does is slay you.\n\nThere is no proof of abuse here IMO. Just him slaying you. I'm going to lock and deny this. Another admin can unlock it and comment if he thinks there is sufficient proof."}]}