{"topicId":4882,"forumId":12,"topicTitle":"Questions","topicTime":1321066737,"topicViews":182,"topicReplies":16,"topicStatus":0,"topicFirstPosterName":"Destar","topicFirstPosterColor":"","topicLastPosterName":"Vasto","topicLastPosterColor":"009900","topicLastPostTime":1321763848,"posts":[{"postId":37742,"topicId":4882,"posterId":634,"postTime":1321066737,"postText":" As a guard \n\n1- When a prisoner pulls out a knife, do I have to ask them to drop it? Or can I just shoot them?\n\n2- When a prisoner punches right next to me and barely misses, can I kill them?\n\n3- When a prisoner punches a vent, can I kill them?\n\n4- When a prisoner opens the door to a restricted area, can I kill them?\n\n5- When a prisoner states that they have a weapon, can I kill them?\n\n6- If a player falsely accuses me of freekilling/other rule infractions, can I post a ban request on them for it?\n\n Answers from administrators only, please. "},{"postId":37745,"topicId":4882,"posterId":101,"postTime":1321067542,"postText":"1- If they are charging you I guess you could kill them. But if they just stand there and have it out ask them.\n\n2- I wouldn't, but again, context.\n\n3- Yes\n\n4- I guess, a bit confused on this one.\n\n5- Ask them to drop it.\n\n6- Unless they are disrespecting/trolling, no."},{"postId":37751,"topicId":4882,"posterId":634,"postTime":1321068854,"postText":"Thanks for the quick reply. \nFor number 4, restricted area refer to guard areas like the armory, or areas restricted by the warden that round.\n Example 1  A prisoner walks to the armory on Alcatraz and opens the armory door. Can you shoot them?\n Example 2  The warden specifically states that no one is aloud into the pool area. Someone opens the door to the pool area. Can you shoot them?\n\n\n More Questions \n\n7- Can I order a prisoner to move out of the way if they are blocking a door even if I am not warden?\n\n8- Can I warning shot or kill prisoners for talking me as warden?\n\n9a- Can I give orders to the other guards as well as the prisoners if I am the warden?\n9b- (If yes) What consequences should be administered to guards disobeying warden orders?\n\n10- Can I kill prisoners for throwing flash-bangs?\n\n11- Can I kill prisoners for throwing smoke-grenades?"},{"postId":37755,"topicId":4882,"posterId":101,"postTime":1321070375,"postText":">> Thanks for the quick reply. \nFor number 4, restricted area refer to guard areas like the armory, or areas restricted by the warden that round.\n Example 1  A prisoner walks to the armory on Alcatraz and opens the armory door. Can you shoot them?\n Example 2  The warden specifically states that no one is aloud into the pool area. Someone opens the door to the pool area. Can you shoot them?\n\n\n More Questions \n\n7- Can I order a prisoner to move out of the way if they are blocking a door even if I am not warden?\n\n8- Can I warning shot or kill prisoners for talking me as warden?\n\n9a- Can I give orders to the other guards as well as the prisoners if I am the warden?\n9b- (If yes) What consequences should be administered to guards disobeying warden orders?\n\n10- Can I kill prisoners for throwing flash-bangs?\n\n11- Can I kill prisoners for throwing smoke-grenades? \n\n\n4- If you want to be a strict dick, go for it.\n\n7- Yes\n\n8- I'm going to interpret that confusing sentence as talking OVER me, in which case give them a warning or say \"No prisoners are allowed to use their mic until I say so\"\n\n9a- If it's reasonable and makes sense.\n\n9b- Not sure.\n\n10- Yes, it's rebelling.\n\n11- Yes, it's rebelling."},{"postId":37778,"topicId":4882,"posterId":735,"postTime":1321079380,"postText":"1- When a prisoner pulls out a knife, do I have to ask them to drop it? Or can I just shoot them?\n  Depends on the situation, if they aren't at a safe distance away from you, I would kill him, unless he drops it. But, if they aren't near any guards I would warn them to put it away.  \n\n2- When a prisoner punches right next to me and barely misses, can I kill them?\n  I would wait to kill him/her until he actually hits you. I say this because fists aren't exactly weapons so they can't be forced to put away. I also say this to cause less confusion of freekill to the actual prisoners wondering why they were killed.  \n\n3- When a prisoner punches a vent, can I kill them?\n  Yes  \n\n4- When a prisoner opens the door to a restricted area, can I kill them?\n  Yes and unsure, you can give orders saying do not leave blah, go near blah, or go into blah.\nBut, the actual place that guard area is should really be talked about, there have been many complaints of rdm because of the vagueness of \"Guard Area.\"  \n\n5- When a prisoner states that they have a weapon, can I kill them?\n  No, you shouldn't trust or kill prisoners just based on what they say.\nEX:Player 1: (TEAM CHAT) I GOT A GUN! NICE\nPlayer 2: PLAYER 1 HAS A GUN KILL HIM!  \n\n\n6- If a player falsely accuses me of freekilling/other rule infractions, can I post a ban request on them for it?\n  Unless it is borderline disrespect, trolling, or any other rule that was broken, I would only ignore it. They can say whatever they want but they most likely have the evidence to back it up.  \n\n\n7- Can I order a prisoner to move out of the way if they are blocking a door even if I am not warden?\n  Yes. On that note, can noclip for prisoners be added back?  \n\n8- Can I warning shot or kill prisoners for talking me as warden?\n  If you mean talking over you? then, Yes, if you want to be strict as hell.  \n\n9a- Can I give orders to the other guards as well as the prisoners if I am the warden?\n9b- (If yes) What consequences should be administered to guards disobeying warden orders?\n  This would give warden too much power, so no.  \n\n10- Can I kill prisoners for throwing flash-bangs?\n  Yes  \n\n11- Can I kill prisoners for throwing smoke-grenades?\n  Yes  "},{"postId":37996,"topicId":4882,"posterId":372,"postTime":1321413725,"postText":"1. When a prisoner pulls out a knife, do I have to ask them to drop it? Or can I just shoot them?\n\nYou can always shoot a prisoner for having a weapon out.  No questions asked.\n\n2. When a prisoner punches right next to me and barely misses, can I kill them?\n\nNo, they must hit you.\n\n3. When a prisoner punches a vent, can I kill them?\n\nYes.\n\n4- When a prisoner opens the door to a restricted area, can I kill them?\n\nNo, they must enter.\n\n5- When a prisoner states that they have a weapon, can I kill them?\n\nYes.  No weapons is a default rule, and if they state it, you can take it as if you have seen it.\n\n6- If a player falsely accuses me of freekilling/other rule infractions, can I post a ban request on them for it?\n\nUnless it somehow results in the breaking of a server rule, then no.\n\n7- Can I order a prisoner to move out of the way if they are blocking a door even if I am not warden?\n\nYes.  I don't know what you could do if they didn't move though, since only the warden has the power to order kills.\n\n8- Can I warning shot or kill prisoners for talking me as warden?\n\nIf you have a rule that says they cannot talk over you, then yes.  Otherwise, they are free to talk as much as they want, as long as they do not spam.\n\n9a- Can I give orders to the other guards as well as the prisoners if I am the warden?\n\nYes, your guards are there to assist you.\n\n9b- (If yes) What consequences should be administered to guards disobeying warden orders?\n\nYou cannot do anything about it.\n\n10- Can I kill prisoners for throwing flash-bangs?\n\nYes, no weapons are allowed of any kind.\n\n11- Can I kill prisoners for throwing smoke-grenades?\n\nYes, no weapons are allowed of any kind."},{"postId":38002,"topicId":4882,"posterId":634,"postTime":1321415379,"postText":"Ok. I see mixed answers which is bad. Post what will actually be enforced once you have come to a consensus.\n\nAnother question. \n12. When I give an order for prisoners to go to an area. Is it implied that they have to stay there?\n\n13. No detours or delays means I can shoot any prisoner that is not moving or any that is not moving at the standing running speed correct?\n\n14. Is it freekill if I shoot a prisoner in crossfire?\n\n15. Is it freekill if I kill a person for disobeying orders they could not hear due to a mic-cut out?\n\n16. If a prisoner does not know the way to a location they were ordered to move to, can I just shoot them and tell them to follow the crowd next time?\n\n\nSide note: I don't care if I'm classified as a \"strict\" warden or not on these. I just want to know what the boundaries are on some events regarding the rules."},{"postId":38005,"topicId":4882,"posterId":101,"postTime":1321416753,"postText":"12. Yes\n\n13. Just trank them and tell them to run, not walk\n\n14. Kind of\n\n15. If it was on his end, no. If everyone could hear the mic cut, kind of. Seriously, just repeat it.\n\n16. Umm, just escort them I guess. If they're dicking around and doing it for the lulz feel free to shoot them."},{"postId":38017,"topicId":4882,"posterId":812,"postTime":1321482729,"postText":"Something that I was wondering was this:\n\n1.Can a prisoner give orders to other prisoners. Like \"Today is a pool day, all Prisoners to the pool no detours or delays\".\n1a. If the above is acceptable, can a said prisoner then act like a warden and continue to give orders?\n\nI would find it the players own fault if they were to listen to said prisoner giving orders, as they really have no power. But I can understand if it's not allowed being it could confuse more....'slow'' players.\n\nEdit: And rather, an easy way to stop this confusion would just having the warden to not allow prisoners to use their microhpone. Anyway lol I'll try and stop defending this and wait for an admin's response."},{"postId":38021,"topicId":4882,"posterId":1016,"postTime":1321491688,"postText":"I'd think your question for prisoners giving orders is pretty obvious, no they are not in charge nor are they warden, most of the time this happens is when prisoners are constantly winning and guards just end up throwing in the towel."},{"postId":38024,"topicId":4882,"posterId":812,"postTime":1321492244,"postText":">> I'd think your question for prisoners giving orders is pretty obvious, no they are not in charge nor are they warden, most of the time this happens is when prisoners are constantly winning and guards just end up throwing in the towel. \nI'm not saying that a prisoner giving orders should be followed, but if it's acceptable for a prisoner to give orders when it's apparent they are joking."},{"postId":38032,"topicId":4882,"posterId":1016,"postTime":1321499806,"postText":"I guess you could sum it up with \"talk is talk\" just cause they talk and say things doesn't mean anything. Ultimately its up to guard team - mic or no mic. I hope this answered your question."},{"postId":38066,"topicId":4882,"posterId":372,"postTime":1321589627,"postText":"12. When I give an order for prisoners to go to an area. Is it implied that they have to stay there?\n\nYes\n\n13. No detours or delays means I can shoot any prisoner that is not moving or any that is not moving at the standing running speed correct?\n\nYes.\n\n14. Is it freekill if I shoot a prisoner in crossfire?\n\nYes, killing with out reason is always freekill.\n\n15. Is it freekill if I kill a person for disobeying orders they could not hear due to a mic-cut out?\n\nControversial, but technically yes, since orders that are not heard are no orders at all.  \n\n16. If a prisoner does not know the way to a location they were ordered to move to, can I just shoot them and tell them to follow the crowd next time?\n\nNo, Show them the way.\n\nAlso, I have some comments on the views of others.\n\nPlease, never tranquilize prisoners.  If you do, prisoners do not have to follow any orders that require them to move around until their screen is de-blurred.\n\nAlso, if find it odd that Dum states you can kill people for not knowing the way if they are \"dicking around and doing it for the lulz\".  Server rules state that all prisoners should be treated equally, basically meaning you have to accept any player, new or old, saying they do not know the way to a location."},{"postId":38075,"topicId":4882,"posterId":634,"postTime":1321648175,"postText":">> Also, if find it odd that Dum states you can kill people for not knowing the way if they are \"dicking around and doing it for the lulz\".  Server rules state that all prisoners should be treated equally, basically meaning you have to accept any player, new or old, saying they do not know the way to a location. Exactly the reason I brought up the topic. I don't feel like having to show the way every round. It's much faster to just kill them and then they can look at the map and learn the locations of places in spectator. If you enforce what you're saying, then I can get out of my cell on mars when ordered to go to the Simon Says wall and say \"Where is that?\" (even though it is completely obvious) and play dumb, wasting everyone else's time, and if any guard shoots me for delaying I can just call it freekill because I claimed I did not know where it is.\n\n>> Please, never tranquilize prisoners. If you do, prisoners do not have to follow any orders that require them to move around until their screen is de-blurred. Honestly there is no point for even having them except to give guards a temptation to break the rules. Freetranqing is a big problem and it's hard to catch those responsible all the time, I think the usp serves as a better warning gun anyways. Almost anything you can \"warn\" people for in Jailbreak, you can kill them for.\n\nMore Questions.\n\n17. Can the term \"as fast as possible\" replace the term \"no detours or delays\", when giving orders?\n\n18. How long must you be in the armory before it is armory camping?\n\n19. Can you re-enter the armory immediately after leaving it just to avoid armory camping as defined by question 18?\n\n20a. For Simon Says, do you have to say \"Simon says I am Simon\" before you can begin playing the game and issuing orders as Simon?\n20b. For Simon Says, do you have to say \"Simon says we are playing Simon Says\" before you can begin playing the game and issuing orders as Simon?\n20c. For Simon Says, do you have to say \"Simon says we are no longer playing Simon Says\" before the game is over."},{"postId":38076,"topicId":4882,"posterId":372,"postTime":1321651351,"postText":"17. Can the term \"as fast as possible\" replace the term \"no detours or delays\", when giving orders?\n\nAs warden, I simply say \"No delays\".  This means that any action that would cause their progress to the wall to be hindered, including crouching, holding ALT, or detouring.  I have changed my opinion on this since I do not actually play the way I originally stated the rule was.\n\n18. How long must you be in the armory before it is armory camping?\n\nThis is one thing I cannot stand.  Guarding the armory and hiding in it are two different things.  As a general rule, as long as prisoners can see you in the armory, you are not camping.\nYou are camping if you are\n1. Hiding in a location where prisoners cannot see you, waiting for them to enter so you can kill them. This is what camping truly is.\n2. No orders are given at the beginning of the round and all of the guards stay in the armory waiting for someone to run in or attack.\n\nGuarding the armory is allowed.\n\n19. Can you re-enter the armory immediately after leaving it just to avoid armory camping as defined by question 18?\n\nThis should be covered by my answer to 18.\n\n20a. For Simon Says, do you have to say \"Simon says I am Simon\" before you can begin playing the game and issuing orders as Simon?\n\nNo, you simply have to state who is Simon.\n\n20b. For Simon Says, do you have to say \"Simon says we are playing Simon Says\" before you can begin playing the game and issuing orders as Simon?\n\nNo.\n\n20c. For Simon Says, do you have to say \"Simon says we are no longer playing Simon Says\" before the game is over.\n\nAll that must occur for the game to end is for the Simon to state \"Simon says is over/done/ended\""},{"postId":38101,"topicId":4882,"posterId":634,"postTime":1321732207,"postText":"21. Is baiting against the rules on our server?\nBaiting is going near prisoners to try and lure them into taking a weapon out or something like that.\nI never thought it was enforced but the other day an admin threatened to slay me if I didn't stop baiting the prisoners.\n\n22. When a prisoner gives the last request of a \"pool day\" or other variants of such. Does that signify a default day constricted to the pool area or a regular day constricted to the pool area?"},{"postId":38131,"topicId":4882,"posterId":916,"postTime":1321763848,"postText":"21: Ive recently slayed and blacklisted a guard for baiting me and rdming me after i warned him multiple times,If baiting is not against the rules then it SHOULD Be it Prevents Rdm\n\n22: Ive never heard of that"}]}