{"topicId":2307,"forumId":12,"topicTitle":"MarioDJW Abuse","topicTime":1302037362,"topicViews":449,"topicReplies":33,"topicStatus":1,"topicFirstPosterName":"Nolskeys","topicFirstPosterColor":"","topicLastPosterName":"Nolskeys","topicLastPosterColor":"","topicLastPostTime":1302228651,"posts":[{"postId":18484,"topicId":2307,"posterId":595,"postTime":1302037362,"postText":"Hello, sorry i couldn't find the right place to put this.\nMarioDJW (Kagami Tsukasa) abused today, and yesterday, i was going to forget about yesterday but he abused again today. Yesterday he changed his Steam name so my LR would change useless. He also noclipped away from scene before he changed name. Then today, my friend DDOG claimed Warden via mic, before Mario claimed it over text. DDOG said to go to backwall. And Mario said to stay in cells, I told everybody to go to backwall since DDOG claimed it first, and Mario had no mic. I have a picture of the freekills by Mario.\nHe then proceeded to ban me for slapping him, because i needed to stop the freekilling."},{"postId":18485,"topicId":2307,"posterId":646,"postTime":1302037857,"postText":"That's right he's doing what ever he wants... he RDMed me like 3times or smth."},{"postId":18487,"topicId":2307,"posterId":648,"postTime":1302038254,"postText":"that guy rdmed and 9 or 11 other people kagami should not be a admin"},{"postId":18490,"topicId":2307,"posterId":595,"postTime":1302038818,"postText":"Mario told me to post that he cant reply."},{"postId":18493,"topicId":2307,"posterId":112,"postTime":1302041789,"postText":">> Mario told me to post that he cant reply. \n\nHe can't see the forums.\nA video would be better proof, although that many kills in a row with no interuptions is suspicious"},{"postId":18503,"topicId":2307,"posterId":595,"postTime":1302044477,"postText":"I wish i had video... I dont sporatically record my gameplay though."},{"postId":18512,"topicId":2307,"posterId":112,"postTime":1302052555,"postText":"I don't mean to be a neighsayer, but this \"proof\" is faked. And badly.\n\nLets compare between two.\nAs you can see, they both look pretty similar, obvious quality differences because of the resizes and programs used, but two main things stick out to me, as shown in the picture.\n\nFirst problem in  blue. \nSecond in  Red. \n http://i41.photobucket.com/albums/e285/umean123/realconsole.png \n\nI guess somebody didn't read rule 8 of the ban requests. I rest my case. Quit your shit."},{"postId":18514,"topicId":2307,"posterId":2,"postTime":1302052767,"postText":">> I don't mean to be a neighsayer, but this \"proof\" is faked. And badly.\n\nLets compare between two.\nAs you can see, they both look pretty similar, obvious quality differences because of the resizes and programs used, but two main things stick out to me, as shown in the picture.\n\nFirst problem in  blue. \nSecond in  Red. \n http://i41.photobucket.com/albums/e285/umean123/realconsole.png \n\nI guess somebody didn't read rule 8 of the ban requests. I rest my case. Quit your shit. \n\nPharaoh failed hard as he did not realize I removed the chat box which made everyone's color white, today.\n\n Edit: \n\nlololololol"},{"postId":18515,"topicId":2307,"posterId":112,"postTime":1302053259,"postText":">> >> I don't mean to be a neighsayer, but this \"proof\" is faked. And badly.\n\nLets compare between two.\nAs you can see, they both look pretty similar, obvious quality differences because of the resizes and programs used, but two main things stick out to me, as shown in the picture.\n\nFirst problem in  blue. \nSecond in  Red. \n http://i41.photobucket.com/albums/e285/umean123/realconsole.png \n\nI guess somebody didn't read rule 8 of the ban requests. I rest my case. Quit your shit. \n\nPharaoh failed hard as he did not realize I removed the chat box which made everyone's color white, today.\n\n Edit: \n\nlololololol \n\nWell fine then. Ignore reason two, but still reason one."},{"postId":18518,"topicId":2307,"posterId":101,"postTime":1302054241,"postText":"Not to mention the \"supporting\" posts are only a few minutes apart from each other, each with just 1 post."},{"postId":18521,"topicId":2307,"posterId":112,"postTime":1302054826,"postText":">> Not to mention the \"supporting\" posts are only a few minutes apart from each other, each with just 1 post. \n\nSorry for posting again, on this xD\nBut none of his story has proof either, he has no steam ID, and no proof of anything (even if it is real). I t just shows him kicking an afk and killing people, with no context on either."},{"postId":18522,"topicId":2307,"posterId":595,"postTime":1302055175,"postText":"Kay, I use a mac, that changes my console log. Tons. My \"j\" are skinny slivers\" look at any mac users console log. It will show it, But that dosent change it. This was not faked. Ask anyone from the game today that was on in that time, they will all see those murders just like that. Still, does it seem a bit sketchy that he shot that many people in like 15 seconds, and that wasn't only him, notice how no guards shot but him? Those two supports were made by people on the server, i told them i made this, and they asked for link so they could support. I gave it out."},{"postId":18523,"topicId":2307,"posterId":112,"postTime":1302055661,"postText":">> Kay, I use a mac, that changes my console log. Tons. My \"j\" are skinny slivers\" look at any mac users console log. It will show it. I know i have SteamID and shit on that, because i disabled it, I can enable it, but that dosent change it. This was not faked. Ask anyone from the game today that was on in that time, they will all see those murders just like that. Still, does it seem a bit sketchy that he shot that many people in like 15 seconds, and that wasn't only him, notice how no guards shot but him? Those two supports were made by people on the server, i told them i made this, and they asked for link so they could support. I gave it out. \n\nYou say it seems a bit sketchy that he made all those kills. The point is we are saying he might not have* We think its fake and he didn't make those kills\nI meant you don't have His steamID\n\nEdit: Made a type don't feel like making a new post"},{"postId":18524,"topicId":2307,"posterId":595,"postTime":1302055921,"postText":"? You confused me in those \"lines\"\n\nEdit: Oh, well, if it has to do with my console thing, check a mac users console, his steamID didn't come with the killings (if thats what you mean) Because i disabled them for they took up much room in my console, and flat out just confused me after trying to find something in console.\nPlus - If you think im lying ask tuna, Mr.fat monkey, Manic, Suppentopl, STEALTH. svezvez, and darkslayer."},{"postId":18527,"topicId":2307,"posterId":112,"postTime":1302060810,"postText":"Eh fuck I was wrong xD\nIts legit. Sorry bout dat. I thought I had a solid case."},{"postId":18530,"topicId":2307,"posterId":54,"postTime":1302062106,"postText":">> Eh fuck I was wrong xD\nIts legit. Sorry bout dat. I thought I had a solid case.  Fail.\nanyways, where's mario when he's needed.."},{"postId":18532,"topicId":2307,"posterId":112,"postTime":1302062967,"postText":">> >> Eh fuck I was wrong xD\nIts legit. Sorry bout dat. I thought I had a solid case.  Fail.\nanyways, where's mario when he's needed.. \n\nNot able to see the forums. \nAs stated before.\nHe's online now though and I talked to him"},{"postId":18537,"topicId":2307,"posterId":54,"postTime":1302067085,"postText":"k, so what did he say"},{"postId":18539,"topicId":2307,"posterId":521,"postTime":1302086376,"postText":"I'm pretty sure he killed all of you because you weren't following orders... And I don't think you can claim warden while marios on, because he likes being warden. He does have a mic too, he decides not to use it.\n\nMario isn't an abuser. This happened a while ago with me and etrius when we said go to the backwall and some kid told everyone to go to the pool. The prisoners of course liked the pool better than the backwall, so they obeyed him. We had to shoot 3 or 4 before they understand we meant bizness. They were calling freekill. Point is that people will call freekill if you kill them, claiming they were obeying another guard's orders.\n\nEveryone isn't a warden."},{"postId":18540,"topicId":2307,"posterId":595,"postTime":1302088698,"postText":"Farrow your all good. Woulda said the same thing. and Inferno, the rule is, who ever calls out directions, or says warden first, is warden. For DDOG called it out before Mario hit enter, he is warden. I dont really care that Mario likes to be warden, so do others. Therefore by saying DDOG was warden we all went to the back wall like he said."},{"postId":18550,"topicId":2307,"posterId":569,"postTime":1302117995,"postText":"I was there to! I saw everything! Nolskeys is telling the truth. Honest! Sorry Mario :("},{"postId":18554,"topicId":2307,"posterId":521,"postTime":1302122906,"postText":"Maybe mario did not like ddog at the time\n\nEDIT: someone check if those first three accounts that posted have the same IP address."},{"postId":18557,"topicId":2307,"posterId":595,"postTime":1302123843,"postText":"And? Disliking someone is no reason to free kill, and abuse. Sorry MZP but its true. And yeah check the IP they are from different people. I mean, I like the guy and all, but its just.... Bad to abuse/free kill"},{"postId":18559,"topicId":2307,"posterId":521,"postTime":1302124684,"postText":"He told me the story, and its legit. He is going to talk it over with bird before he posts it here. No more on this please..."},{"postId":18560,"topicId":2307,"posterId":595,"postTime":1302124973,"postText":"Okay. Sounds good.\nIf I may I suggest just a demote to mod."},{"postId":18564,"topicId":2307,"posterId":112,"postTime":1302126601,"postText":">> Maybe mario did not like ddog at the time\n\nEDIT: someone check if those first three accounts that posted have the same IP address. \n\nLol thats the first thing I checked when I saw it, no offence >.>\nDifferent emails, different IPs.\n\nMario DID do the kills, but he couldn't hear anybody. It happened to me before, you have to rejoin or relaunch gmod, I can't remember which.\nHe didn't know somebody else called warden and he said he thought Nolskeys was just trolling when he said it.\n\n\nI'm not defending or arguing either side in this post, I'm just telling what I know >.>"},{"postId":18569,"topicId":2307,"posterId":521,"postTime":1302131293,"postText":"Yeah thats what he told me. He also said that he wanted to tell everyone himself tho >.>\nIf you unplug your speakers any running programs will not register sound on your headphones or headset until you restart said programs."},{"postId":18571,"topicId":2307,"posterId":595,"postTime":1302134080,"postText":"Mmmm. I can see how that could make a difference. I thought he was just trolling and free killing. He said something about this about hwo he couldnt even see our names pop up when we chatted, but i thought he was lying. Then this happened."},{"postId":18574,"topicId":2307,"posterId":521,"postTime":1302136488,"postText":"Mario doesn't lie or freekill daz why i knew something waz up"},{"postId":18579,"topicId":2307,"posterId":651,"postTime":1302139532,"postText":"He usually abuses when I play also like no killei.g the freekillers and freekilling himself? Thats just wrong......... >:V"},{"postId":18581,"topicId":2307,"posterId":3,"postTime":1302140700,"postText":"Please do not post unless you have something important to say. (Or you will be banned for shitposting)"},{"postId":18602,"topicId":2307,"posterId":595,"postTime":1302207587,"postText":">> Mario doesn't lie or freekill daz why i knew something waz up \nThere is a first time for everything. Does he have any proof?"},{"postId":18605,"topicId":2307,"posterId":521,"postTime":1302208271,"postText":"Well, he's been with NNJG for like 3 months, he wouldn't lie..."},{"postId":18613,"topicId":2307,"posterId":595,"postTime":1302228651,"postText":"I now see why he would do this. I would like to resign my case in this, all a mis-understanding. Sorry."}]}