{"topicId":3092,"forumId":24,"topicTitle":"[Community Game Project] Platania","topicTime":1308764354,"topicViews":457,"topicReplies":40,"topicStatus":0,"topicFirstPosterName":"The Ungrateful Dead","topicFirstPosterColor":"","topicLastPosterName":"James","topicLastPosterColor":"","topicLastPostTime":1309206797,"posts":[{"postId":24629,"topicId":3092,"posterId":693,"postTime":1308764354,"postText":"Hello fellow NNJG players and administration. I have recently begin working on a PC game and have made this thread to propose that it become a community project. That being said, as a community project, every member who wishes to help in some way through out the development course will be able to. I will need assistance in a variety of different fields, which we shall get to in a minute, so that everyone may feel as though they are a part of a project.\n\n So what the hell is Platania? \nPlatania is an Action-RPG, with beat-um up elements thrown in. The game takes place in an alternate timeline, in which tensions between Russia and the United States escalate during the Cold War, leading to all-out nuclear war. The events of the game take place a few hundred or so years after the war and society has rebuilt itself. The G.E.P.E. (Government Enforcement for the Protection of Earth) is the governement that has been set into place since the war. It's a monarchy lead by a man by the name of Caesar (Pronounce Kai-Zer.) Caesar, as it turns out, as a power-hungry, and corrupt leader who oppresses the people under his rule, sending civilians to death camps for speaking out against him. You will be playing as Jacob Landaro, a commander in a sub-division of the G.E.P.E. called the Inner Sanctum. You are tasked with the recovery of a rare artifiact, a mineral called Platania. Upon reciveving the mineral, your ship will be boarded by G.E.P.E. soldiers and you and your task force will ultimately be betrayed. Without spoiling too much of the story, after your escape from the ship, you will band together a group of super-naturally gifted individuals in a revolution against the government.\n\nThe game will be open-ended in that all the decisions made in the game will impact the grand finale. This can include who survives, who wins, and how the world is affected at the end of the final battle. Who you recruit and who you assign to do what will ultimately impact the final battle with the G.E.P.E. Think Mass Effect 2's Suicide Mission.\n\n Alright, so what do you need me to do? \nYou can volunteer for almost any position you want at any giving time if you want to help in the community project. I will be the lead writer and character developer, although if you want you may also help out with these fields as well. Just keep in mind that giving that this game is based on a story I am writing, it is my final descision on the matters of writing and character design. Below is a list of all the fields and who has volunteered for what.\n\n Writers \nWriters will be incharge of writing and contributing to the plot. This includes the main story, side missions, character origins, codexs {Similar to that of Bioware games or Assassin's Creed,) and Dialogue.\n\nHead: Ungrateful Dead\nContribution: Kryzoid\nContribution: FunnyRaff\nContribution: SohiSohi\n\n Programmers \nThe programming language will be the choice of however steps forward as the lead programmer. By default we will be using Game Maker 8 should no one step up to the task, although I would profer if someone with programming skill in a more professional language would volunteer.\n\nProgramming Language as of Last Edit: GML\nHead: Destar\n\n Graphics \nGraphic designers will be in charge of translating concept art and the like into ingame graphics. Cutscenes are NOT covered by the graphics division. All graphic artists should have some sort of communication so that all graphics are the similar, if not the same, art style.\n\nHead:\n\n Concept Art and Character Design \nConcept artists and character designers will be in charge of making rough drafts of level design, develop new characters, and draw storyboards for cutscenes.\n\nHead: Ungrateful Dead\nContributor: SohiSohi\n\n Music \nThis is self-explanitory. Music will be incharge of composing the soundtrack for the game. Please keep in mind that the game is in a semi-futuristic setting very similar to Steam-Punk.\n\nHead:\nContributor: Ungrateful Dead\nContributor: SohiSohi\n\n Cutscenes \nCutscenes contributors will be incharge of translating storyboards into moving cutscenes. You will have the choice of making them full animated, or in still, comic-book esque style, similar to Infamous.\n\nHead:\nContributor:\n\n Voice Actors \nVoice actors will be in charge of voicing the characters in the game. You may voice as many character as you want, but do please try to make them sound different from each other. This is the field that we hope to have as many contributors as possible. When you volunteer please check with character design to see what characters are available and who you would like to voice act. The characters and the people voice-acting them will be listed here.\n\nUngrateful Dead - Caesar and Diablo\nDethSlayr - Undecided\nNolskeys - Undecided\nBoomShaka - The Conduit\nPharaoh - Undecided\nSohisohi - Undecided\nDum - Undecided\nPirate - Undecided\n\n Beta Testers \nBeta Testers will be in charge of checking for glitches and and helping with the development of gameplay mechanics. Please note, however, that as important as Beta Testers are, you will need to also volunteer in another position if you want to recieve any of the gifts the other contributors recieve.\n\nKryzoid\nDethSlayr\nNolskeys\nMoonrakerone\nBoomShaka\nPharaoh\nMongo\nBalenti\nFunnyRaff\nSmooglez\nPirate\n\n Wait, what was that about gifts? \nEach contributor will recieve some form of compensation for their time and contribution. While I may or may not be able to pay in cash (A friend of mine stated that he is willing to help me sell the finished game on his website for $19.99, so it all depends whether he comes through or not.) you will recieve the following by helping out.\n\n -Platania - Ultimate Edition:  In addition to the regular Platania game, which is planned to be sold at $19.99, it is planned that an ultimate edition will also be sold for $10 more. The ultimate edition includes additional content and a free DLC pass which will allow free access to all DLC released in the future. By helping in any field that isn't Beta Testing, you will receive the Ultimate Edition absolutely free. The Ultimate Edition is planned to include: Platania, The Complete Soundtrack, The DLC Pass, the Ultimate Edition Costume Pack, and additional Special Features.\n\n -A not yet disclosed exclusive DLC for contributors  This exclusive DLC for contributors has not yet been decided yet but will only be released here on NNJG, and will only be free for those who contribute.\n\n -The Rogue Character  The Rogue Character is a free downloadable character for contributors. Information on this dlc will be released periodically. This character will not be available for download at any time unless you contribute.\n\n -Potentially a small sum of money  If my friend, or NNJG, is willing to sell the game for the planned $19.99, contributors will recieve a small portion of all the money from the sales. All money will be dived up evenly amongst contributors.\n\nFeel free to discuss and ask any questions in this topic, or feel free to begin contributing at any point."},{"postId":24634,"topicId":3092,"posterId":4,"postTime":1308769212,"postText":"I can help out with writing and beta-testing.\nhttp://www.steamcommunity.com/id/kryzoid"},{"postId":24635,"topicId":3092,"posterId":634,"postTime":1308771630,"postText":"Fuck yes! I love Gamemaker i can do pretty much any of those things. Heres what me and 3 buddies of mine made at the Global game Jam with GM7 in 2010.\n\nhttp://www.yoyogames.com/games/114892-bafafz/download\n\nEDIT: The Global Game Jam is only 48 hours long so be noted that we made this game in 2 days."},{"postId":24636,"topicId":3092,"posterId":48,"postTime":1308772303,"postText":"Voice acting and beta testing.\nIf I learn to program at all this summer (which I hope to) then that too.\n\nhttp://www.steamcommunity.com/id/dethslayr"},{"postId":24637,"topicId":3092,"posterId":693,"postTime":1308773696,"postText":">> Fuck yes! I love Gamemaker i can do pretty much any of those things. Heres what me and 3 buddies of mine made at the Global game Jam with GM7 in 2010.\n\nhttp://www.yoyogames.com/games/114892-bafafz/download\n\nEDIT: The Global Game Jam is only 48 hours long so be noted that we made this game in 2 days. \n\nSo would you like me to pencil you in for programming?"},{"postId":24638,"topicId":3092,"posterId":595,"postTime":1308774364,"postText":"Im up for beta testing, maybe some voice.\n\n\n http://www.steamcommunity.com/id/Nolskeys \n\nEdit: Maybe some music or writing. Not the best at both but. I will try."},{"postId":24639,"topicId":3092,"posterId":237,"postTime":1308775446,"postText":"Definitely up for testing, but i'm not sure you want to use my voice :P\nhttp://www.steamcommunity.com/id/moonrakerone"},{"postId":24641,"topicId":3092,"posterId":693,"postTime":1308777986,"postText":">> Definitely up for testing, but i'm not sure you want to use my voice :P\nhttp://www.steamcommunity.com/id/moonrakerone \n\nHey, you can always send a voice sample and I can see if there are any characters suited for you."},{"postId":24643,"topicId":3092,"posterId":142,"postTime":1308779729,"postText":"Perhaps beta testing, and voicing if anything else."},{"postId":24645,"topicId":3092,"posterId":112,"postTime":1308780093,"postText":"Voicing if you need anybody else.\nBeta tester for sure."},{"postId":24648,"topicId":3092,"posterId":665,"postTime":1308780906,"postText":"Beta test."},{"postId":24650,"topicId":3092,"posterId":373,"postTime":1308785018,"postText":"Beta tester ftw"},{"postId":24662,"topicId":3092,"posterId":243,"postTime":1308795391,"postText":"I would love to beta test, but I can also *attempt* any scene writing/character scripts."},{"postId":24673,"topicId":3092,"posterId":101,"postTime":1308801848,"postText":"This for some reason sounds a lot like Fallout NV......\n\n\nI can do Beta testing and/or Voice acting."},{"postId":24674,"topicId":3092,"posterId":634,"postTime":1308802023,"postText":"No Graphics yet? I'm surprised we don't have more artistic types here. Also, is it safe to assume there will be sky pirates involved since it is steampunk? Cause sky pirates are cool."},{"postId":24681,"topicId":3092,"posterId":605,"postTime":1308825994,"postText":">> No Graphics yet? I'm surprised we don't have more artistic types here. \nI take offense :O! I'm artistic dangit ;~;... just not with sprites or the likes XD\n\nOn topic, but being off topic in a way, I'm shocked no one has tried to get me to voice some form of sinister laugh, then oddly splice it in after someone else's dialouge >.>;"},{"postId":24684,"topicId":3092,"posterId":364,"postTime":1308843493,"postText":"I hear you need a lot of voice actors. I'm guessing you want the person to at least have a mic, right. Because if I have to drive anywhere to do this recording... I'll most likely lazy out.\n\nhttp://steamcommunity.com/id/SirKnightSohisohi\n\nOn a side note., I have started taking classes for programing (That was before I heard of this) but it's unlikely I would be able to help out considering I have not yet finished them all (or even any of them... Well I got one so far)... So ya... v.v"},{"postId":24685,"topicId":3092,"posterId":693,"postTime":1308843976,"postText":">> This for some reason sounds a lot like Fallout NV...... \n\nAside from taking place after nuclear warfare and the bad guys name being caesar, there isn't going to be any similarities between the two. In fact, if you were to just jump into the middle of the game without any explanation, you wouldn't even notice it was after a nuclear war. Society rebuilt and improved rather quickly.\n\n\nAlso, a note to all voice actors, as said previously you will need a mic, but you are free to record with whatever program you see fit, such as audacity. It is best that you post a voice sample so that the character designers and writers can try to match you up accordingly.\n\nSome concept art will be posted later on today to give you an idea of some of the characters.\n\nAnd Destar, there probably won't be sky pirates, but there are raiders on hover bikes. That's close right?\n\nEDIT: @Udane I haven't heard your sinister laugh, but if it's as good as people say your more than welcome to voice Caesar instead of me."},{"postId":24688,"topicId":3092,"posterId":397,"postTime":1308844895,"postText":"i call the job of smooglez\n\nbeta tester"},{"postId":24689,"topicId":3092,"posterId":456,"postTime":1308847887,"postText":"I'd like to volunteer for voice actor and beta tester.\nhttp://steamcommunity.com/id/Pirate43/"},{"postId":24690,"topicId":3092,"posterId":364,"postTime":1308852707,"postText":">>  Writers \nWriters will be incharge of writing and contributing to the plot. This includes the main story, side missions, character origins, codexs {Similar to that of Bioware games or Assassin's Creed,) and Dialogue.\n\n Concept Art and Character Design \nConcept artists and character designers will be in charge of making rough drafts of level design, develop new characters, and draw storyboards for cutscenes.\n\n Music \nThis is self-explanitory. Music will be incharge of composing the soundtrack for the game. Please keep in mind that the game is in a semi-futuristic setting very similar to Steam-Punk. \n\nI'd love to help out with Writing (Such as side missions and even character origions) and Concept art (But it's been some time since I did any major drawing v.v)\n\nAdded... Will you have any custom sound-track for any music needed or do you have some songs/music in mind?"},{"postId":24691,"topicId":3092,"posterId":693,"postTime":1308853096,"postText":">> \nAdded... Will you have any custom sound-track for any music needed or do you have some songs/music in mind? \n\nI don't really have anything in mind, but everything must be custom. No copyrighted songs.\n\nALSO\n\nThe first pieces of concept art are here.\n\nThe first is for Jacob's default appearnace. I'm not sure if I'm going to add the ability to change his appearances or not. It all depends on how many graphics designers we get.\n http://i1196.photobucket.com/albums/aa403/necromancer14/001.jpg \n\nSecond\nThis is Caesar's current appearance. This is subject to change, although I do believe that the mask and hood are going to be part of his appearance regardless.\n http://i1196.photobucket.com/albums/aa403/necromancer14/002.jpg \n\nThird\nThis is the Conduit. I'm not done with the concept art for him, if that wasn't obvious, but he is Caesar's second in command. This is being posted here because Bewm may or may not be voicing him. This is so he can decide.\n http://i1196.photobucket.com/albums/aa403/necromancer14/003.jpg "},{"postId":24694,"topicId":3092,"posterId":488,"postTime":1308856076,"postText":"There is a rather small chance that I could maybe POSSIBLY do the programming. I know a good deal of C++ and have been learning OpenGL, but I don't think I feel practiced enough to take on a game like this. So I guess it depends on how much more I learn by the time actual production starts."},{"postId":24699,"topicId":3092,"posterId":235,"postTime":1308861531,"postText":"i would like to be a beta-tester and voice actor (if you would like my voice) and possible graphics designer (if you mean pixel art)\n\nEdit: http://steamcommunity.com/id/thedemon09"},{"postId":24707,"topicId":3092,"posterId":634,"postTime":1308865381,"postText":"Anyone can program in Gamemaker it has a drag and drop system if you can't do GML(coding for GM).\n\n\n@Ungrateful, How big are characters going to be during game-play?\n\n http://www.racketboy.com/images/metalslug3-xbox.jpg \nSmall little chubby characters with a classic pixely feel like this? (Easier for artists probably)\n\n http://www.differentvideos.info/wp-content/uploads/2010/06/Shank-Gameplay-Train-vs-Jeep-E3-2010.jpg \nOr bigger, more realistic, like this. (Minus motion blur)\n\n\nAlso, any idea on gameplay information besides action RPG?\nAll I get from this is non-turn based game with some leveling and maybe special skills.\n\nIs it going to have mostly gun-combat with some fighting elements?\nA fighting game with some gun wielding enemies?\nSpecial magic abilities thrown in?\nThe possibilities are endless. And apart from the story I'm just guessing on what the gameplay will be like.\n\nA reference game would be most helpful, is there any game you would like to base it off of gameplay-wise/ make similar to?"},{"postId":24722,"topicId":3092,"posterId":586,"postTime":1308870475,"postText":"I'll do some beta and MAYBE some voice acting if a child with a deeep voice is needed :3"},{"postId":24730,"topicId":3092,"posterId":760,"postTime":1308875465,"postText":">> \nProgramming Language as of Last Edit: GML\n \n\ngl selling this for 19.99\nor anything for that matter\n\nIs this planned to be 2D or 3D"},{"postId":24735,"topicId":3092,"posterId":634,"postTime":1308878133,"postText":">> >> \nProgramming Language as of Last Edit: GML\n \n\ngl selling this for 19.99\nor anything for that matter\n\nIs this planned to be 2D or 3D \nYeah, I thought this as well but there are some Gamemaker Games that could be worth like maybe 5 - 10, but you have to put a lot of time into them."},{"postId":24741,"topicId":3092,"posterId":665,"postTime":1308880855,"postText":"If you need like a last resort person to do voice acting, i'm here."},{"postId":24753,"topicId":3092,"posterId":464,"postTime":1308888517,"postText":"What's the estimated pixel count for the characters?\n\nSomething like 32x32 would be hell to design for, but 64x64 or 128x128 would be easy as all hell.\n\nSign me up as a graphic designer, and a voice actor if you're short on them.\n\nEdit: Embedding what is essentially a shrunken-down, 64X64 colorized version of your concept art as a draft piece.\nColors can be changed without a problem, I just needed some way to tell the body parts and armour apart.\n\nLet me know what resolution you need the actual ones, and I can get those together quickly.\n\n http://i.min.us/ibrWYE.jpg "},{"postId":24774,"topicId":3092,"posterId":693,"postTime":1308917820,"postText":">> \nA reference game would be most helpful, is there any game you would like to base it off of gameplay-wise/ make similar to? \n\nI'm very glad that you mention Shank, because it's VERY similar both graphically and gameplay wise.\nThe main problem we face, however, is that some characters have superpowers, and others have weapons. So there must be a control scheme that accommodates a free-flow combat between the two. Where as Shank's control scheme would fit perfectly for the weapon wielding characters, it wouldn't for the super-powered once. My suggestion would be to use a power wheel, similar to Marvel Ultimate Alliance. This way you could map aa power or weapon to each button so long as, assuming this is played on the 360 controller, the right trigger button is held.\n\nGraphically speaking, Shank is the closest thing to what I was expecting when I started to develop the game. HOWEVER, all the graphics in Shank are hand-drawn per frame. That will take a really long time, and I don't expect are graphic artists will want to spend that much time with graphics, considering the huge amount of characters they will have to sprite. While I would appreciate a larger graphic so that it looks good with HD resoulution, JUS style is a good-starting point. \n\n@TinFoil I assume that's just you trying to figure out a color scheme at the moment. The color scheme looks nice, but just shrunken down versions of the concept art doesn't really look good. But then like I said, I REALLY like the color scheme so far. I few things though. The legs I think should be white to match with the torso. Also the circle on the middle of his chest is the Inner Sanctum Logo, and should be blue. I would suggest making it a darker blue than the blue you used for the cloth. Finally, the hair looks good, but can you try experimenting for a reddish-brown? I want to see how it looks and if not we can go back to this shade of brown.\n\n@Storm Imma ignore your douchey comment, k?"},{"postId":24782,"topicId":3092,"posterId":101,"postTime":1308933765,"postText":"And I'm assuming the storyline is a lot like Fallout? Caesar...his corruptness...his inability to pronounce his name like the actual ruler and the salad...."},{"postId":24789,"topicId":3092,"posterId":112,"postTime":1308937773,"postText":">> And I'm assuming the storyline is a lot like Fallout? Caesar...his corruptness...his inability to pronounce his name like the actual ruler and the salad.... \n You already asked this and he already answered\n>> >> This for some reason sounds a lot like Fallout NV...... \n\nAside from taking place after nuclear warfare and the bad guys name being caesar, there isn't going to be any similarities between the two. In fact, if you were to just jump into the middle of the game without any explanation, you wouldn't even notice it was after a nuclear war. Society rebuilt and improved rather quickly.\n "},{"postId":24790,"topicId":3092,"posterId":101,"postTime":1308939289,"postText":"Im not sure how I didnt see that post o.o"},{"postId":24834,"topicId":3092,"posterId":636,"postTime":1308978787,"postText":"I would like to be for sure a beta tester and writer.\n\nhttp://steamcommunity.com/id/James27049\n\n\nI told two of my friends in my clan because one is good with concept art and one with writing."},{"postId":24853,"topicId":3092,"posterId":902,"postTime":1309036948,"postText":"I would like to apply for Concept Artist, Graphics, Writer, and/or Beta Testing. ^-^\nI was referred by Sir James the Awesome. :3\n http://steamcommunity.com/id/gkangroo "},{"postId":24854,"topicId":3092,"posterId":905,"postTime":1309038625,"postText":"Sorry if I'm late to the party. I was reffered here by my good friend James. Anyways if I'm not too late maybe a Voice Actor position, I'm only 13 but I don't have a squeaky voice. I could throw it to sound like a girl or maybe make it deep enough to be a male. And If not that, possibly could I be a writer? Early thanks for any responses Charlie Scene<3 :P\nAnd how will this all be put together? Like through a ventrilo or what? Because if it's through a vent or something I'll need the vent into ^^\nhttp://steamcommunity.com/id/CharlieSceneBITCH\n\nI'm in the same clan as James and GlowyKangaroo :D"},{"postId":24861,"topicId":3092,"posterId":693,"postTime":1309106329,"postText":">> Sorry if I'm late to the party. I was reffered here by my good friend James. Anyways if I'm not too late maybe a Voice Actor position, I'm only 13 but I don't have a squeaky voice. I could throw it to sound like a girl or maybe make it deep enough to be a male. And If not that, possibly could I be a writer? Early thanks for any responses Charlie Scene<3 :P\nAnd how will this all be put together? Like through a ventrilo or what? Because if it's through a vent or something I'll need the vent into ^^\nhttp://steamcommunity.com/id/CharlieSceneBITCH\n\nI'm in the same clan as James and GlowyKangaroo :D \n\nOnce the writers are done with the scripts, the voice actors will be able to record their individual lines using a recording program such as Audacity. If the voice actors would like, they could also record their lines with other voice actors over skype or ventrilo, although it isn't neccesary."},{"postId":24909,"topicId":3092,"posterId":456,"postTime":1309155511,"postText":"@Ungrateful Dead\nI'm assuming we will be contacted once we are needed amirite?"},{"postId":24925,"topicId":3092,"posterId":693,"postTime":1309191830,"postText":">> @Ungrateful Dead\nI'm assuming we will be contacted once we are needed amirite? \nCorrect"},{"postId":24930,"topicId":3092,"posterId":636,"postTime":1309206797,"postText":"Whats yours steam name ungrateful?"}]}