{"topicId":3714,"forumId":18,"topicTitle":"Jail Applications Discussion","topicTime":1313890102,"topicViews":397,"topicReplies":52,"topicStatus":0,"topicFirstPosterName":"Kryzoid","topicFirstPosterColor":"000099","topicLastPosterName":"Human Aimbot","topicLastPosterColor":"009900","topicLastPostTime":1314834270,"posts":[{"postId":30132,"topicId":3714,"posterId":4,"postTime":1313890102,"postText":"This thread is for discussion regarding current & future applicants for Jail administration."},{"postId":30133,"topicId":3714,"posterId":4,"postTime":1313890189,"postText":"Personally, i don't think Vasto is too good of a choice for a jail moderator.\nI know i don't get on jail that much so i wouldn't know how he is ingame, but i just dislike his typing style and overall person.\n\nAlso,\n 10) Do you have any past experience with the position you're applying for:   No \n 11) Do you own a decent microphone, and do you frequently utilize it:   i Dont Own a Mic "},{"postId":30135,"topicId":3714,"posterId":115,"postTime":1313890832,"postText":"Vasto is very active on jail. He seems to know the rules correctly, he is liked by the jail community, and even as VIP he seems to give out the proper punishments to rulebreakers.\n\nI didnt own a mic either when I got admin on NNJG, and unlike TTT (chat if often ignored to a certain point) the chat is what a majority of the playerbase uses.\n\nOn a side note, I was talking to Tweekie today and he was very upset because he came 5 recommendations short of applying for admin."},{"postId":30164,"topicId":3714,"posterId":372,"postTime":1313900586,"postText":"Vasto's grammar is horrible, but he is one of the most active and trustworthy players on the Jailbreak server.  He knows a lot of the players and knows all of the rules, and I think it is time for him to be able to take care of his own stuff.\n\nAs for Aimbot, He has also been around for a while, knows all of the rules, and has a microphone.  \n\nBoth have not abuse their VIP powers, and give out what punishments that can when appropriate."},{"postId":30312,"topicId":3714,"posterId":153,"postTime":1313967619,"postText":"I approved them all. Jail needs mods bad and they all seem qualified.\nI'm also closing Staff Apps for now."},{"postId":30320,"topicId":3714,"posterId":801,"postTime":1313969562,"postText":"Yeah, Vasto is way more active then me. if not me, vasto NEEDED to be mod. im glad he is mod, and same as me. Thank you all."},{"postId":30327,"topicId":3714,"posterId":153,"postTime":1313970048,"postText":"Own3r PM'd me an application literally 10 seconds after I locked it. Anyone know about him?"},{"postId":30328,"topicId":3714,"posterId":801,"postTime":1313970315,"postText":"he plays JB a lot, but recently wasn't because he was gone for 1 week. he isn't just a random player, he is a VIP as well. i think If you think its necessary to get more moderators he would be a great choice. he was active on JB as long as i can remember. He enforces the rules even though he isn't part of staff."},{"postId":30337,"topicId":3714,"posterId":3,"postTime":1313971545,"postText":"Own3r's a very active VIP, I think he deserves a chance"},{"postId":30343,"topicId":3714,"posterId":372,"postTime":1313972167,"postText":"I agree. Apps were opened and closed so fast, owner said he didn't even have time to post his application that met all of the requirements.  He deserved to be considered too."},{"postId":30352,"topicId":3714,"posterId":735,"postTime":1313975424,"postText":"Owner should be given a chance."},{"postId":30362,"topicId":3714,"posterId":115,"postTime":1313977437,"postText":"I personally dont like Owner, he does deserve a chance yes, but I definitely dont think he would be as suitable of a moderator as the members we just promoted."},{"postId":30430,"topicId":3714,"posterId":153,"postTime":1314035932,"postText":">> I personally dont like Owner, he does deserve a chance yes, but I definitely dont think he would be as suitable of a moderator as the members we just promoted. \nWhy is that?"},{"postId":30482,"topicId":3714,"posterId":735,"postTime":1314056008,"postText":"I change what I said about Owner. I don't think he can handle it. http://steamcommunity.com/groups/Premonitionoffate/announcements/detail/1261225110290697146"},{"postId":30490,"topicId":3714,"posterId":373,"postTime":1314057114,"postText":"That's because he said. \"this server sucks nnjg's is better LOLOLOL\" \nthey also said to show all hate to NNJG members after that.  \nDeleted the post, though. Still lol"},{"postId":30518,"topicId":3714,"posterId":372,"postTime":1314060477,"postText":"I don't see how badmouthing a bad server would discredit him in any way."},{"postId":30521,"topicId":3714,"posterId":735,"postTime":1314061174,"postText":"Never mind that. I wasn't thinking when I read it"},{"postId":30595,"topicId":3714,"posterId":801,"postTime":1314120932,"postText":"lol, but in all seriousness, it doesnt mean that we Need owner, its up to the owners (gash ben) if they think it would be necessary to get more mods. or even maguroni, bird, and quack."},{"postId":30602,"topicId":3714,"posterId":153,"postTime":1314124751,"postText":"I'm open to adding one more, IF you think he can handle it.\n\nIf you think he can, edit this post and add your name after the yes, if not, after the no.\n\n YES, I think he can handle it at this time : Ben, Tweekie, Maguroni,Vasto\n\n\n\n NO, I do not think he can handle it at this time : Quack, Pharaoh, Bewm, Human"},{"postId":30605,"topicId":3714,"posterId":801,"postTime":1314126430,"postText":"oh sorry about not editing it, i forgot i can LOL."},{"postId":30836,"topicId":3714,"posterId":801,"postTime":1314298987,"postText":"If own3r gets 15 recommendations can he get a chance.? (we already have people saying yes, in the edit.)"},{"postId":30909,"topicId":3714,"posterId":153,"postTime":1314364612,"postText":"He has 15 recommendations."},{"postId":30917,"topicId":3714,"posterId":112,"postTime":1314373161,"postText":"If owner talks shit about the server, he really shouldn't be helping run it. \nHe comes across as extremely unprofessional in all of his posts, and he abuse commands on jail. (Not enough to really demote him for it, but he really shouldn't be promoted either)\n\n\nOn a side note: I really don't think the new mods should really be able to vote on this at this point in time. They have barely started trying to moderate the server, and barely know what its like, and at this point they are picking their friends rather than candidates that they know would do well."},{"postId":30924,"topicId":3714,"posterId":801,"postTime":1314385656,"postText":"wait wait pharoah, he wasnt talking shit about NNJG, he was calling a bad server out, saying that NNJG is a BETTER server.\n\nbut on your side note, i sorta understand you, but own3r does not abuse his powers."},{"postId":30932,"topicId":3714,"posterId":735,"postTime":1314393382,"postText":">> I don't see how badmouthing a bad server would discredit him in any way. \n\n>> wait wait pharoah, he wasnt talking shit about NNJG, he was calling a bad server out, saying that NNJG is a BETTER server \n\nHe was bashing the server. Bad server or not, you should treat the server with respect and not go talk shit about it. It is a quite an immature act, but, I don't know If I can trust him or not.\nChanging my vote to unsure.\n\n(Click on the hyperlink for full post)\nPlease Report ANY threatening/abusive behaviour to myself, Ramirez OR Ben(owner of NNJG)\nThese players is know to say bad things:\nKBz | Own3r\nmap\nAny threats/abuse made will have appropriate action taken against the aggressor, You MUST know the consiquences of your actions so be warned, you could have your account terminated. Please Remember to show respet to NNJG and vice versa, please Represent both clans as best as you can. "},{"postId":30986,"topicId":3714,"posterId":153,"postTime":1314455222,"postText":"Yeah, unfortunately he is breaking the do and don'ts.\n>> \n Do  represent [NNJG] well, even when not playing an [NNJG] server. Follow the rules of other servers too, no matter the server's relation to [NNJG].\n "},{"postId":31112,"topicId":3714,"posterId":801,"postTime":1314530680,"postText":"I don't think this is \"proof\" but this is his side of the story.\n\nhttp://i53.tinypic.com/11mcf3m.png"},{"postId":31113,"topicId":3714,"posterId":801,"postTime":1314530827,"postText":"and if you say BS, i would like to see trow, or w/e his name is, to post his proof."},{"postId":31120,"topicId":3714,"posterId":112,"postTime":1314544438,"postText":"All those admins are retarded. We just don't have to go around making it public.\nAdmins are supposed to stop drama, not start it.\nAlthough I don't even know why rtworey or whatever the fuck his name is, is even threatening owner, considering he has no power over the server."},{"postId":31122,"topicId":3714,"posterId":115,"postTime":1314544934,"postText":"he was threatening the server now owner."},{"postId":31197,"topicId":3714,"posterId":801,"postTime":1314569649,"postText":"NOOOOOO he was saying that rtow or w/e was threatening the server, and he told him to piss off and w/e his name is called him a n\"\"\"\" and left the server. own3r never said HE threatened the server, that PoF admin did."},{"postId":31223,"topicId":3714,"posterId":372,"postTime":1314578429,"postText":">> NOOOOOO he was saying that rtow or w/e was threatening the server, and he told him to piss off and w/e his name is called him a n\"\"\"\" and left the server. own3r never said HE threatened the server, that PoF admin did. \nThis is what owner told me in steam chat."},{"postId":31232,"topicId":3714,"posterId":801,"postTime":1314580430,"postText":"and we ALL know PoF where the ones DDoSing us anyways."},{"postId":31315,"topicId":3714,"posterId":735,"postTime":1314654852,"postText":"To be honest, if there is going to be all this drama about it, he shouldn't be in."},{"postId":31316,"topicId":3714,"posterId":4,"postTime":1314655238,"postText":">> To be honest, if there is going to be all this drama about it, he shouldn't be in. \nAgreed, discussion over."},{"postId":31377,"topicId":3714,"posterId":735,"postTime":1314666756,"postText":"Alright I have 1 more thing to add why he shouldn't be a moderator and one of the moderators and or admin told owner about this.\nSomeone spilled the beans and told owner about this, saying that I lied and that I ruined his chance at moderator.\nhttp://steamcommunity.com/id/Mrvictorious/screenshot/594694818273228430\nhttp://steamcommunity.com/id/Mrvictorious/screenshot/594694818273229641\nhttp://steamcommunity.com/id/Mrvictorious/screenshot/594694818273229403\nhttp://steamcommunity.com/id/Mrvictorious/screenshot/594694818273228943\n\n\nI boxed the chat between me and him for the brief time we talked.\nhttp://tinypic.com/r/155gn6g/7\nhttp://tinypic.com/r/30cyb5x/7\nhttp://tinypic.com/r/169njbc/7\nhttp://tinypic.com/r/343rgo4/7"},{"postId":31387,"topicId":3714,"posterId":801,"postTime":1314669420,"postText":"who spilled the beans...?"},{"postId":31401,"topicId":3714,"posterId":735,"postTime":1314673223,"postText":">> who spilled the beans...? \nOnly owner and the rulebreaker know."},{"postId":31481,"topicId":3714,"posterId":372,"postTime":1314756464,"postText":"I still fail to see how Own3r has done anything wrong.  I would be mad too if I thought someone had ruined my chance at becoming a Moderator, which seems justified since he says he did not say what was posted about him."},{"postId":31487,"topicId":3714,"posterId":735,"postTime":1314757915,"postText":">> I still fail to see how Own3r has done anything wrong.  I would be mad too if I thought someone had ruined my chance at becoming a Moderator, which seems justified since he says he did not say what was posted about him. \nOwner did nothing wrong in the pictures. The person that told him about this is what did the wrongdoing."},{"postId":31495,"topicId":3714,"posterId":801,"postTime":1314760601,"postText":"i think mag isn't talking about the pictures, i think its about the thing PoF w/e his name is said on him. o.o"},{"postId":31501,"topicId":3714,"posterId":735,"postTime":1314762487,"postText":">> I still fail to see how Own3r has done anything wrong.  I would be mad too if I thought someone had ruined my chance at becoming a Moderator, which seems justified since he says he did not say what was posted about him. \n>> i think mag isn't talking about the pictures, i think its about the thing PoF w/e his name is said on him. o.o \nRe-read Mag's post here. By saying I would be mad too if someone had ruined my chance at moderator which owner was talking about in the screen shots I had recently posted."},{"postId":31504,"topicId":3714,"posterId":801,"postTime":1314763261,"postText":"oooh, kk my mistake. lol"},{"postId":31509,"topicId":3714,"posterId":115,"postTime":1314768387,"postText":"I think when we get down to it, we really just don't WANT to promote anyone else. I mean, we just promoted 4 people, the necessity to promote anyone else is just not there.\n\nJail promotions are over, nobody else is getting promoted anytime soon. Unless the new jail administration fails to do their job within the next month or two, then were definitely going to have to look over this situation.\n\nIt's sorta late here. So sorry if it doesn't make sense. But I guess what I'm getting at is that even if owner deserves it, we don't need any more mods."},{"postId":31510,"topicId":3714,"posterId":801,"postTime":1314768560,"postText":"yeah. i'm just surprised how many people applied for TTT, like... WOW. lol. :) you guys have much more active players there (as in staying on forums also)"},{"postId":31511,"topicId":3714,"posterId":801,"postTime":1314769073,"postText":">> >> I still fail to see how Own3r has done anything wrong.  I would be mad too if I thought someone had ruined my chance at becoming a Moderator, which seems justified since he says he did not say what was posted about him. \n>> i think mag isn't talking about the pictures, i think its about the thing PoF w/e his name is said on him. o.o \nRe-read Mag's post here. By saying I would be mad too if someone had ruined my chance at moderator which owner was talking about in the screen shots I had recently posted. \n\noh wait, but i think mag was talking about the thing before, about PoF guy, saying that own3r went to their server and talking shit."},{"postId":31515,"topicId":3714,"posterId":735,"postTime":1314769658,"postText":">> oh wait, but i think mag was talking about the thing before, about PoF guy, saying that own3r went to their server and talking shit. \nWhy would he be talking about I would be mad too if I didnt get mod. Which is in one of my pictures. Someone broke a rule and told him about this whole thing and saying that I lied and whatnot"},{"postId":31519,"topicId":3714,"posterId":801,"postTime":1314770397,"postText":"oh i know, I'm just saying what mag said. like, own3r said b4, about how the thing about the PoF was posted about him, and plus he wont get mod anyways. because this is A WHOLE LOT OF DRAMA. over this 1 thing."},{"postId":31520,"topicId":3714,"posterId":735,"postTime":1314770579,"postText":"Which is why we ended his mod thing. But someone told him about it which is breaking a mod/admin rule and he isn't confessing, he would rather have a rule-breaking mod/admin than a truthful mod/admin."},{"postId":31541,"topicId":3714,"posterId":372,"postTime":1314807272,"postText":"Why don't we just have the person that leaked come out and tell.  Why is Own3r's responsibility any more than the people we already trust and have made staff?"},{"postId":31569,"topicId":3714,"posterId":801,"postTime":1314827539,"postText":"i only asked him if he ever went and talked shit to PoF on their, never anything about aimbot. is that leaking o.o?"},{"postId":31602,"topicId":3714,"posterId":115,"postTime":1314832813,"postText":"No, its moreso the leaking on names thats bad in this situation."},{"postId":31610,"topicId":3714,"posterId":735,"postTime":1314834270,"postText":">> Why don't we just have the person that leaked come out and tell.  Seriously, then we can finally put an end to the conversation."}]}