{"topicId":4294,"forumId":3,"topicTitle":"Admin Abuse?","topicTime":1316880203,"topicViews":264,"topicReplies":20,"topicStatus":1,"topicFirstPosterName":"Cupcake","topicFirstPosterColor":"","topicLastPosterName":"Playerhata27","topicLastPosterColor":"009900","topicLastPostTime":1317841291,"posts":[{"postId":34170,"topicId":4294,"posterId":1105,"postTime":1316880203,"postText":"Well today i was playing ttt with like 8 when i got banned so i looked for reason a little bit after when i notice 4 other people all got banned by udane. I sort of understand my week ban for \"trolling and throwing incins\" when i threw one and did no damage to anyone. And i guess for trolling i said \"why didnt you kill udane\"  like three rounds apart , I only meant it as a joke but i got banned. \nSecond i saw chowder got banned like 3 minutes after me for \"trolling\" and i was playing with him till i got banned and i never saw him troll enough to get banned but he got banned for one day. And lastly i saw Kenshiro get banned before me for \"rdm\" but he had a reason for the 1st one and then the second time he just got banned without being able to explain what happend from udane. So in total i think udane unfairly banned some people that didnt deserve it. Also either i didnt find it but can you make a rule about trolling so people know what they can get banned for. So thank you for reading"},{"postId":34171,"topicId":4294,"posterId":605,"postTime":1316882688,"postText":"When you yourself call yourself a troll, and boast about getting banned from 8 tf2 servers for griefing, things are already not looking pretty. Simply saying \"why didnt you kill udane\" doesnt cut it. The incen, did in fact do damage, otherwise I would have only went with trolling as the ban reason.\nChowder, humorously, started trolling after you got banned. Considering how much your looking into past bans, you would have noticed he has been banned for rdm and leave already, siding with him is akward.\nKen was confused around the first rdm, I let it slide for the fact he appeared newish. 2nd one, he got his slay, and warned to not do kill based off of thoughts alone. 3rd time around, he got a short ban. The later two times, I let a full blown arguement unfold from both sides. In techicality, if I didn't feel he was as new and actually trying to learn, he would have been banned for longer. Though my faith dropped in him a bit when he said \"i didnt rdm, just look at my karma\" in steam chat later after.\n\nAs for the rule itself for trolling, \"05. Do not disrespect NNJG administration or your fellow players.\" http://nonerdsjustgeeks.com/rules/ttt/\nTrolling is a form of action where you do whatever it takes to invoke a negative reaction from another person. Obviously, trolling is the opposite of being respectfull.\n\nSo, whats next? You're going to scroll down and look at how many people playerhata has banned, and assume he has to be doing something wrong as well? He and I have the most bans because we are on the most, if not the only ones on.\nOr are you just attempting to cause trouble, as you're possibly upset someone actually took action against trolling."},{"postId":34178,"topicId":4294,"posterId":1105,"postTime":1316887133,"postText":"This is what i expected but if you listened i said banned from 8 tf2 server cause of my cousin i mean you would of know that right? and my friend i never said a signal rude word the could of possibly hurt your feelings in anyway therefore there was no reason for banning chowder and I. \nAnd you assuming all the wrong things cause from the way your wrote this means you are angry I don't care how many you banned i'm saying they didn't deserve it  also looking into past bans you mean like the ones an hour apart, \nAlso care to explain about the incins you changed it back to incin now cause i'm right? I never hit anyone please care to explain whom? and if no logs i presume please get them to tell me. Also are you banning me for incin throw for 6 days trolling for 1 cause chowder  got 1 for trolling and i've seen many incin hurt people before were is there 6 day ban? And going back to 1st part i'm not siding with him but no matter how bad the person just cause they have been banned before doesn't make it right it just ban them just cause you don't like them. Also look at me i've been in nnjg for maybe a year how many times have you seen me get slayed kicked or banned cause honestly I cant remember the last slay i've been given and i have never even been kicked or banned . So lastly \"took action against trolling\" dude you ban on opinion if one of your friends did the same thing i did you do nothing and honestly i liked to say more but this isn't worth my time, I got to go to soccer so have fun reviewing what i said and make sure to write a  witty response -till next time friend-"},{"postId":34205,"topicId":4294,"posterId":605,"postTime":1316915950,"postText":"I \"sound\" angry, because you're post appears to be an attack, and I'm defending myself. Comments like \"you ban on opinion\" or \"ban him just cause you don't like him\" or \"make sure to write a witty response\" tend to make it appear to be an attack.\nYou never once said you're cousin was the one banned; you only said you were. Though you did say a couple times about how you're going to get your cousin on to rdm, wait a minute then say jk.\nIt wasnt only me you were bothering, I tend to not care what people say directly to me ingame that often, usualy taking it as jokes. On a side note, you can completely be devoid of \"rude\" words and still troll. In example, constaly spamming in mic chat \"U mad bro\" to invoke a reaction from your subject (This is an example, I am not insinutating that you did this).\nYou got a 6 day ban for trolling for being a much worse troll then chowder. Two different people, two different situations, two different bans.\nMy point about siding with him, is the fact he already is known to cause troube. As such when he does, and he did, cause more trouble, it's not surprising.\nYou've been around trolling for some time now, i'm aware of this... but many admins didn't care about punishing for trolling, for whatever reasons they choose... Hata and myself want players to enjoy their time in the server, this means the removal of rdmers, trolls, and other forms of players who ruin gameplay for others.\n\nAlso, didn't realize it said incens on the ban, it was a typo, I'm fixing that now."},{"postId":34211,"topicId":4294,"posterId":1105,"postTime":1316919349,"postText":"Once again the only way you responde is with lies so lemme fix somethings i said \"I said my cousin is going to get on my  account  watch out for rdmXD\"  one second lator jk\" not a minute and you know it ask eclispe mabye he was there. and  im sure you know that infact your response wasnt mad at me  what i siad infact you didnt even care i siad that so please if your going to make yourself seems better dont defend yourself with lies you cant back up i bet if you ask anyoen on the server when you banned me i didnt wait a minute and i was trolling bad HA that must be a joke because tell me what is your idea of trolling? being a tratior and killing people? cause honestly i dont know if saying why didnt you kill udane is trolling so tell me what i did that offended you so much to consider it trolling and again in your words you mentions \"he is know to cause trouble\" but he get lighter ban even though he does worse than me and who else was mad care to explain? cause i heard no one except you. And when did hata get in to this im sorry but i never knew hata held a grudge agaisnt me please if you do hata dont hiesitate to tell me cause you have never warned me for \"trolling\" you have never slayed me or kicked me so i cant be much worse and udane \"i've been trollign for sometime now\" huh like how 2 days ago i hadnt been in nnjg for about 2 weeks and how would you know you havn't gone on with me sense yesterday once again another lie. and also it bother me about that last comment you wrote incins for a reason to make me sound worse i mean i can't prove it but thats not a typo people make adding another s to something re-read next time instead or mabye just dont lie. P.S. I know for a fact i siad it was my cousins fault cause i sent a pm to my friend who  knew it cause he was playing with me or mabye do you want my to give you all the sever list?  And finally i was wondering have you been banned which for some reason you got karma banned which is hard to pull off without some random incin or some good rdms and i remebr another ban in the past someone was talking about they siad udane and mass rdm mabye i misheard but 2 bans thats kils my record. -till next time friend-"},{"postId":34212,"topicId":4294,"posterId":735,"postTime":1316920567,"postText":">> Once again the only way you responde is with lies so lemme fix somethings i said \"I said my cousin is going to get on my  account  watch out for rdmXD\"  one second lator jk\" not a minute and you know it ask eclispe mabye he was there. and  im sure you know that infact your response wasnt mad at me  what i siad infact you didnt even care i siad that so please if your going to make yourself seems better dont defend yourself with lies you cant back up i bet if you ask anyoen on the server when you banned me i didnt wait a minute and i was trolling bad HA that must be a joke because tell me what is your idea of trolling? being a tratior and killing people? cause honestly i dont know if saying why didnt you kill udane is trolling so tell me what i did that offended you so much to consider it trolling and again in your words you mentions \"he is know to cause trouble\" but he get lighter ban even though he does worse than me and who else was mad care to explain? cause i heard no one except you. And when did hata get in to this im sorry but i never knew hata held a grudge agaisnt me please if you do hata dont hiesitate to tell me cause you have never warned me for \"trolling\" you have never slayed me or kicked me so i cant be much worse and udane \"i've been trollign for sometime now\" huh like how 2 days ago i hadnt been in nnjg for about 2 weeks and how would you know you havn't gone on with me sense yesterday once again another lie. and also it bother me about that last comment you wrote incins for a reason to make me sound worse i mean i can't prove it but thats not a typo people make adding another s to something re-read next time instead or mabye just dont lie. P.S. I know for a fact i siad it was my cousins fault cause i sent a pm to my friend who  knew it cause he was playing with me or mabye do you want my to give you all the sever list?  And finally i was wondering have you been banned which for some reason you got karma banned which is hard to pull off without some random incin or some good rdms and i remebr another ban in the past someone was talking about they siad udane and mass rdm mabye i misheard but 2 bans thats kils my record. -till next time friend- \n>> \n I NEVER want to see you say \"My brother/cousin/mother in law broke the rules, it wasn't me.  Your account. Your responsibility. If you can't control who goes onto your account then you won't be unbanned. \n \nThis ^. This was a good laugh though. But seriously, please use proper grammar and make an attempt to make it look professional."},{"postId":34216,"topicId":4294,"posterId":373,"postTime":1316925208,"postText":"This isn't an Unban Request."},{"postId":34217,"topicId":4294,"posterId":735,"postTime":1316925695,"postText":">> This isn't an Unban Request. \nLol, My bad, but from not reading the title it looked like an unban request"},{"postId":34218,"topicId":4294,"posterId":373,"postTime":1316926641,"postText":"Yeah but it isn't an Unban Request or Abuse Report, just a rant."},{"postId":34223,"topicId":4294,"posterId":605,"postTime":1316929165,"postText":"I'm done dealing with the rant myself, if there was even a shread of an apology somewhere in there, I would have believed you were just joking around ingame and it came off really wrong, and unbanned. \nThough I do want to clarify one thing, I only brought hata up as a point that saying just because I have a lot of bans, doesnt mean they are false. He, as far as I know, does not have a grudge againt you, nor even aware of this ban itself. It's one thing to assume I'm corrupt, it's another to assume another man is as well, off of your paranoria.\nAlso, I do not like how you were defending chowder until you found a way to exploit him, to try to make your ban less."},{"postId":34266,"topicId":4294,"posterId":694,"postTime":1316978828,"postText":">> I'm done dealing with the rant myself, if there was even a shread of an apology somewhere in there, I would have believed you were just joking around ingame and it came off really wrong, and unbanned. \nThough I do want to clarify one thing, I only brought hata up as a point that saying just because I have a lot of bans, doesnt mean they are false. He, as far as I know, does not have a grudge againt you, nor even aware of this ban itself. It's one thing to assume I'm corrupt, it's another to assume another man is as well, off of your paranoria.\nAlso, I do not like how you were defending chowder until you found a way to exploit him, to try to make your ban less. \n\nfatality..."},{"postId":34269,"topicId":4294,"posterId":634,"postTime":1316980445,"postText":">> Also look at me i've been in nnjg for maybe a year \n>> huh like how 2 days ago i hadnt been in nnjg for about 2 weeks \n\nWait, did I miss something here?"},{"postId":34278,"topicId":4294,"posterId":243,"postTime":1316981591,"postText":">> Also look at me i've been in nnjg for maybe a year \n/I'll just put this here/\n http://minus.com/iZ26EfH4rjE1v.png "},{"postId":34279,"topicId":4294,"posterId":373,"postTime":1316982381,"postText":"He's been on the server since around the time Flame was promoted to Mod."},{"postId":34295,"topicId":4294,"posterId":769,"postTime":1316994939,"postText":">> >> Also look at me i've been in nnjg for maybe a year \n>> huh like how 2 days ago i hadnt been in nnjg for about 2 weeks \n\nWait, did I miss something here? He means he was gone for 2 weeks"},{"postId":34438,"topicId":4294,"posterId":1097,"postTime":1317161345,"postText":"Deal with it or Exploded (I got ban, too. But I'm not whining anymore)"},{"postId":34877,"topicId":4294,"posterId":517,"postTime":1317787203,"postText":"Sorry i didnt reliaze how old this thread was it wont happen again :("},{"postId":34878,"topicId":4294,"posterId":292,"postTime":1317787950,"postText":"You do realize you just bumped a week-old thread for no reason...?"},{"postId":34888,"topicId":4294,"posterId":612,"postTime":1317803441,"postText":"Nblckk you keep shit posting. I know that this shouldn't be here, but no one cares about post count on nnjg."},{"postId":34893,"topicId":4294,"posterId":517,"postTime":1317817398,"postText":">> Nblckk you keep shit posting. I know that this shouldn't be here, but no one cares about post count on nnjg.  Sorry i didnt relaize how old this was, it wont happen again :C"},{"postId":34903,"topicId":4294,"posterId":812,"postTime":1317841291,"postText":"I'm going to lock this thread seeing it was really just a vent by cupcake and was pretty much dealt with."}]}