{"topicId":4815,"forumId":122,"topicTitle":"mass rdm - Fuhrer fat porn","topicTime":1320614178,"topicViews":61,"topicReplies":5,"topicStatus":1,"topicFirstPosterName":"Aids Dog","topicFirstPosterColor":"","topicLastPosterName":"Dum","topicLastPosterColor":"000099","topicLastPostTime":1320616340,"posts":[{"postId":37314,"topicId":4815,"posterId":1173,"postTime":1320614178,"postText":"1) Which server: TTT\n\n2) Offender's nam: Führer Fat Porn\n\n3) Offender's SteamID: STEAM_0:1:44250157\n\n4) Explain the situation in detail: The round started and fat tossed out a random discombob and killed 4 people (check pic 1) after that he rdm'd someone with an fire granade (check pic 2). 2 rounds later the round starts and only a few seconds in he tosses another discombob and kills 3 people (check pic)\n\n5) Were any specific server rules broken: rule 1\n\n6) Any staff members on the server at the time of the offence: No\n\n7) Proof:\n\n1. http://steamcommunity.com/id/AidsDog/screenshot/649870345902185063\n\n2. http://steamcommunity.com/id/AidsDog/screenshot/649870345902188266\n\n3. http://steamcommunity.com/id/AidsDog/screenshot/649870345902457907"},{"postId":37321,"topicId":4815,"posterId":1186,"postTime":1320615650,"postText":" Having been on the recieving end of one of the RDms: Yes, Furher RDm''ed. Aids speaks the truth. "},{"postId":37325,"topicId":4815,"posterId":1083,"postTime":1320615852,"postText":"I can confirm this. I was on at the time. While I forgot to get dmg logs, he did do this. He also admitted to it, but denied some parts."},{"postId":37326,"topicId":4815,"posterId":1110,"postTime":1320615911,"postText":"The First screenshot, I threw an incendiary down the elevator shaft. Now, I assume that because I got hit markers, their deaths were put on me because of a glitch in the damage system or something super lame. I killed Hayharut because he was standing by an unID'd body for several seconds and then shot in my direction. The last one was Actually a discombobulator, and I'll take punishment for that one."},{"postId":37327,"topicId":4815,"posterId":1173,"postTime":1320616308,"postText":"Note: incendiary do not do 400 dmg. per hit."},{"postId":37328,"topicId":4815,"posterId":101,"postTime":1320616340,"postText":"Just a message to all of you that posted. We appreciate that you signed up on the forums, but we can not take witnesses (except maybe administration) and take that into account. NNJG only takes concrete evidence. Luckily, you got enough evidence for a short ban. Banned+Locked.\n\n\nEDIT: This is also your 4th ban, Val. Any further bans will probably be longer."}]}