{"topicId":79,"forumId":122,"topicTitle":"Delamore/Abraham","topicTime":1272854832,"topicViews":91,"topicReplies":3,"topicStatus":1,"topicFirstPosterName":"Stocking","topicFirstPosterColor":"","topicLastPosterName":"[NNJG]Ben","topicLastPosterColor":"000000","topicLastPostTime":1272920482,"posts":[{"postId":634,"topicId":79,"posterId":26,"postTime":1272854832,"postText":"Offender name:Mr.Delamore\nOffender's Steam ID:# 216 \"[GOKU ZONE]Delamore\" STEAM_0:0:12195950 13:51 177 0 active\nWhat the Offender did: Rdmed me twice, I dont know what this guy has against me, But hes an overall asshole against me and tries to get me killed anytime, I only have a screeny of my first death (I was detective) So at the beginning of round, i was detective and yelled out \"Im traitor\" Just for fun, As you know, anyone can see who's detective, so later on he asked \"Who said he was traitor again\" I said \"Me, but i was joking, im obv detective\" He said \"No, thats confession, Kill RainRain\" and started to repeat it over and over in mic, eventually he shot me and this other asshole did too. At the start of the next round, He said \"Ok rainrain's traitor kill him\" And within the first, 2 or 3 seconds, He said \"I SAW HIM KILL A GUY KILL RAINRAIN, HE HAD A GUN\" Which i never even PICKED UP a damn gun. So he shot me and others did too, and got me killed, I WAS TRAITOR TOO. and not a single kill due to death at start. He's an overall asshole to me, and i dont know why. A yesterday, me and punked were playing ttt too (No proof of this though, since we didnt get a screeny of event log due to rage) This asshole named abraham, decided to jihad bomb in a building with 4 traitors, including me and 2 others and he was too, we were all huddled, the detective was there and i was about to go kill him, He did the jihad, kill all of the traitors and we lost, Delamore DEFENDED abraham and abraham claimed i ran at him so i could report him, WHEN ALL 4 TRAITORS WERE HUDDLED THERE. Delamore defended him and said i have no right to complain, only the other two did because i got hit by a c4 the next round when i was traitor (I was typing alot, and didnt see the c4) then i got rdmed by some asshole, the last round (when abraham did the jihad) Abraham tried to expose me for no reason after a diff traitor had killed a person. most probobly because the round BEFORE THAT, me and abra were both detective, and he started to attack me pre-round with a crowbar, we got stuck in each other, i told him its more fair I survive rather then him because it was his fault (He rushed at me attacking me pre-round), So i killed him (We were both detective) Delamore AND him both claimed it was rdm, And even punked said it wasn't, since we were stuck, and it was either him, me or both of us to die. I have no piccys of abraham so yeah, but i do of delamore getting some other guy to kill me, WHILE I WAS DETECTIVE.\nWere there any admins on at the time?: No.\nProof: http://i40.tinypic.com/25fknki.jpg "},{"postId":636,"topicId":79,"posterId":4,"postTime":1272855176,"postText":"Bird Flu and I were on as well at that time. I left before that map though.\nAll i can say about Delamore is that he was HEAVILY disrespecting me and Bird Flu, insulting NNJG, and even causing other players to get pissed off. He pushed off several people from the top of the elevator when he was innocent on nexus, and when i said that he did that, he told people to kill me, and i got killed. After that he started being an asshole, and once or twice he rdmed people while i was online.\n\nI think im speaking for all three of us (me, you, rainrain) when i say that Delamore needs to be banned.\n\nI have nothing to say about Abraham though, i wasn't there."},{"postId":637,"topicId":79,"posterId":3,"postTime":1272855279,"postText":"I was about to ban him, then the map changed to a CS:S map"},{"postId":641,"topicId":79,"posterId":153,"postTime":1272920482,"postText":"He is now banned for two weeks."}]}