{"topicId":3214,"forumId":12,"topicTitle":"So I was declined for mod...","topicTime":1310356680,"topicViews":154,"topicReplies":6,"topicStatus":1,"topicFirstPosterName":"Evil-Dalek","topicFirstPosterColor":"","topicLastPosterName":"Quack","topicLastPosterColor":"000099","topicLastPostTime":1310389881,"posts":[{"postId":25571,"topicId":3214,"posterId":356,"postTime":1310356680,"postText":"So I waited for 3 and a half months to get an answer to my application and I was declined. I would just like to know why I was declined since there wasn't a single post on the application.\n\nhttp://www.nonerdsjustgeeks.com/forum/viewtopic.php?f=35&t=2210"},{"postId":25580,"topicId":3214,"posterId":115,"postTime":1310357831,"postText":"Edit: sorry found your app.\n\nApplications are currently closed to everyeome, it isn't that they declined just yours, were just not currently accepting new mods/admins.\n\nOnce apps reopen, I can move that thread for you"},{"postId":25583,"topicId":3214,"posterId":356,"postTime":1310358452,"postText":"I applied three and a half months ago when they were open and my application just sat there until I guess yesterday when it was moved to denied."},{"postId":25593,"topicId":3214,"posterId":142,"postTime":1310363666,"postText":"Dalek deservers a chance, at least for jail if nothing else. Even with the current amount of admins/mods, most prefer TTT and a few pop into jail like pharaoh, quack, and bird and chopper but you guys are busy sometimes where dalek could help if hes on."},{"postId":25594,"topicId":3214,"posterId":356,"postTime":1310364268,"postText":"Thanks for the support Boom. :)"},{"postId":25600,"topicId":3214,"posterId":801,"postTime":1310383710,"postText":"yeah, i dont know dalek, but i agree, there should be at least a little more mods, im not saying there is enough, but late night, when there is jailbreak almost no mods are on, and if they are, its After the mass RDMer annoys everybody. or a spammer, yes we can post a ban request, but it would be nice to be done on the spot, not to annoy the players.\n\nI dont know you dalek, But i hope you get it. <3"},{"postId":25602,"topicId":3214,"posterId":115,"postTime":1310389881,"postText":"I honestly do agree that he should be promoted. TTT needs no more mods, jail does. Dalek is perfect for this.\n\nBut for now, staff apps are closed. Approach gash/Ben about this if you can't wait."}]}