{"topicId":3511,"forumId":104,"topicTitle":"The Stanley Parable.","topicTime":1312708198,"topicViews":119,"topicReplies":9,"topicStatus":0,"topicFirstPosterName":"Dum","topicFirstPosterColor":"000099","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1312779615,"posts":[{"postId":28057,"topicId":3511,"posterId":101,"postTime":1312708198,"postText":"The Stanley Parable is a great mod of Half Life 2, so pretty much anyone can get it. It is a very unique game, where you are a man named Stanley. You work at a company doing a very simple job, pressing buttons. But one day, you come in... and everybody is gone. Your story begins here, and you are accompanied by a narrator. You do not get any guns in this game, you just follow along paths. During this game, you make decisions very quickly, and each one can lead to different endings, all very unique from each other. You can choose to obey or disobey the narrator, similar to obeying and disobeying GLaDOS.\n\nThe Stanley Parable trailer can be found here: http://www.youtube.com/watch?v=OIppRUoe70E\nThe Stanley Parable thread and download link can be found here: http://www.moddb.com/mods/the-stanley-parable\n\nThis game is not about playing it once, as it is incredibly short, with some paths taking about as few as 5 minutes if you rush through it, and taking up to 10 at most. However, there are 6 different endings, I highly recommend you try and find them all!\n\nThis game is very unique and offers a different way of gaming. It puts you into gaming better than ever before. Instead of being this rambo faceless character who doesn't lose, it reminds you that \"hey, you'd be fucked if this were real.\"\n\nOverall score: 8/10\n\n Pros: \n-Very interesting take at gaming\n-GREAT voice-overs\n-You get attached to Stanley\n-A delight to go back and find all the endings\n\n Cons: \n-Short\n\nI'll probably make more reviews soon."},{"postId":28062,"topicId":3511,"posterId":82,"postTime":1312730491,"postText":"It's a source mod, anyone can get it. There is 7 endings. It's meant to be short, the game wouldn't have nearly the same impact if it was hours long (and it isn't a bad design choice). And the game is much better when you go in knowing nothing about it, other than that, good review."},{"postId":28065,"topicId":3511,"posterId":572,"postTime":1312738469,"postText":"This sounds awesome, looks like I have something to do now."},{"postId":28068,"topicId":3511,"posterId":235,"postTime":1312740140,"postText":">> You work at a company doing a very simple job, pressing buttons. But one day, you come in... and everybody is gone. \nMaybe it was Christmas and he's Muslim."},{"postId":28070,"topicId":3511,"posterId":4,"postTime":1312743635,"postText":"I saw it a week ago or so, t''was amazing and i played one of the endings on the movie night server."},{"postId":28077,"topicId":3511,"posterId":572,"postTime":1312746697,"postText":"I got 4 endings, 2 more to go.\n\nEDIT: Found all of them."},{"postId":28096,"topicId":3511,"posterId":456,"postTime":1312762288,"postText":"Does it require half life 2?"},{"postId":28110,"topicId":3511,"posterId":101,"postTime":1312768237,"postText":">> Does it require half life 2? \n\n\nIt requires you have the stuff for HL2, but that just means you can just have TF2 or Alien Swarm and you can get it.\n\nSo...no."},{"postId":28135,"topicId":3511,"posterId":115,"postTime":1312778306,"postText":"It sounds cool, I'll try it out when I get home.\n\nI'll probably make a couple reviews as well."},{"postId":28137,"topicId":3511,"posterId":373,"postTime":1312779615,"postText":"I enjoyed this mod thoroughly, up until the point whe-snip-"}]}