{"topicId":4238,"forumId":3,"topicTitle":"Admin Abuse?","topicTime":1316481381,"topicViews":96,"topicReplies":6,"topicStatus":0,"topicFirstPosterName":"binlaninja","topicFirstPosterColor":"","topicLastPosterName":"Balenti","topicLastPosterColor":"990000","topicLastPostTime":1316495756,"posts":[{"postId":33747,"topicId":4238,"posterId":1097,"postTime":1316481381,"postText":"I was playing, and I heard a guy who say kos this guy, and the callout guy got killed, and I tell them to kos the guy get called out, turned out he's an innocent. Mark says it was false call out. I tell him that it was on microphone you can't find it. Now, I got 12 hours ban"},{"postId":33749,"topicId":4238,"posterId":812,"postTime":1316481451,"postText":"First off, it was a 12 hour ban.\n\nSecond of all, he asked you about 4 times and you didn't respond with text, or mic.\n\nAnd finally, I only saw/heard you call him out and I was there.\n\nEdit:I won't lock this to allow Mark to reply, but not responding to an admin is worse and will cause things like this."},{"postId":33751,"topicId":4238,"posterId":1097,"postTime":1316481558,"postText":">> First off, it was a 12 hour ban.\n\nSecond of all, he asked you about 4 times and you didn't respond with text, or mic.\n\nAnd finally, I only saw/heard you call him out and I was there.\n\nEdit:I won't lock this to allow Mark to reply, but not responding to an admin is worse and will cause things like this. \n\nI DID FREAKING RESPOND IN TEXT\n\nI TEXT BACK, \"THERE WAS A GUY WHO CALLOUT IN MIC, YOU CAN'T FIND IT IN THE MESSAGES\""},{"postId":33769,"topicId":4238,"posterId":54,"postTime":1316486919,"postText":"Lets see, you told me someone called him out, yet NO ONE did. I was there, and was listening the whole time. You were the only one to call him out. You also asked \"will I get banned?\" or something, aka saying you're false accusing. I then asked you again, because you obviously made that up, and you ignored me. I asked you 3-4 times, and you ignored me each time. False call outs are bannable, ignoring me makes it worse."},{"postId":33795,"topicId":4238,"posterId":1097,"postTime":1316492134,"postText":">> Lets see, you told me someone called him out, yet NO ONE did. I was there, and was listening the whole time. You were the only one to call him out. You also asked \"will I get banned?\" or something, aka saying you're false accusing. I then asked you again, because you obviously made that up, and you ignored me. I asked you 3-4 times, and you ignored me each time. False call outs are bannable, ignoring me makes it worse. \n\nI freaking answer you, someone DID CALL HIM OUT AND SAYS THAT HE GOES INTO THE TRAITOR ROOM. when you ask me, I SAY THERE WAS SOMEONE CALLED HIM OUT BUT I DIDN'T GET THE NAME. I ASK PLAYER WILL I GET BAN, BECAUSE I SAW A GUY KILLED INNOCENT, SO I SHOOT HIM AND TURNED OUT HE'S INNOCENT THAT'S RDMing (It's WHOLE OTHER BUSINESS)\n\nNO OFFENSE, BUT I THINK YOU DIDN'T LOOK AT THE CHAT, OR MAYBE DIDN'T PULL THE CHAT BAR UP. I DID WRITE A 3 LINES ABOUT WHAT HAPPEN AND PEOPLE STARTED TO SPAM AND HID ME TEXT"},{"postId":33797,"topicId":4238,"posterId":1097,"postTime":1316492545,"postText":"You know what, I'll Accept the fact that I got ban. I'll accept the fact that I false call out, because I don't want people I bitching nonsense stuff. IF, PEOPLE STARTED TO RESPECT ME AND SEE WHAT I WRITE ABOUT THE REASON THAT I RDM BY ACCIDENT. AND PEOPLE STARTED TO IGNORE ME, COMPLETELY AND I CAN'T EVEN OPEN THE DAMAGE LOG"},{"postId":33802,"topicId":4238,"posterId":373,"postTime":1316495756,"postText":"TBH I don't understand what you're trying to say, but I can tell that you are frustrated. If you want to make an abuse report with proof submit it here: http://nonerdsjustgeeks.com/forum/viewforum.php?f=123 . If you do not have proof then I doubt anything will be done. \n\nYou cannot appeal to be unbanned for bans that are under a day, incase you were thinking about making an unban request.\n\nAlso if you post a comment and you have more to say, edit the comment with whatever you are trying to say. Please do not double-post"}]}