{"topicId":3630,"forumId":122,"topicTitle":"A Second Opinion Please?","topicTime":1313400328,"topicViews":114,"topicReplies":4,"topicStatus":0,"topicFirstPosterName":"remnants3","topicFirstPosterColor":"","topicLastPosterName":"remnants3","topicLastPosterColor":"","topicLastPostTime":1313420857,"posts":[{"postId":29384,"topicId":3630,"posterId":838,"postTime":1313400328,"postText":"(JAILBREAK SERVER)\n\nAdmin Name: Maguroni.\nAbuse: Generally going out for me and nobody else. Dragging the NNJG name down.\n\nAround 2 months ago I was a cop with an AWP, as you do, and the prisoner's started rioting as usual and I shot at a prisoner who was firing directly at me, anyway Maguroni ran in-front of the fire as I shot and I killed him, He then IMMEDIATELY blacklists me without asking why!! \nAnyway it was an honest mistake and an obvious one at that yet he kept me blacklisted until I came back on the server after a week or so break, when I asked again he had even forgotten why he blacklisted me, I actual fact when asking him every half hour or so he said I added time to my blacklist.\n\nANYWAY! Yesterday I came back on the server when I heard of Freekilling cop's from a friend on steam, when I joined there was none and I decided to stay and play the game.\nThat day I witnessed 2 cop's doing the usual trick where they throw a TranqGun at a prisoner and say ''Give it back''.\nThis was called a Test of Faith / Test of Honor.\nI did not react to this as I had seen it done around 50 odd times before.\nAnyway later that day when Maguroni was on the server there were the usual blatent freekills which only ended up in being slapped and killed.\nI decided at one point that I wanted to try out the Test Of Faith, I did so and Maguroni instantly blacklisted me for gunplanting, when I saw that a Test of Faith was carried out many times!!!\n\nI was OBVIOUSLY mislead into believing it was not breaking any rules due to how common it is and the fact I even saw it happen 2 times that day!!\n\nAnyway Maguroni was having none of it, He couldn't grasp the fact that I made a mistake and even called me ''One of the bad people''.\n\nIm sorry but I payed to stop minges on the server!\nI have infact made a NameHackerFreekiller leave the server after slaying him and kicking him multiple times.\nI have put hours into this server and respect the community!\nYet I get repayed by being blacklisted for an obvious mistake!\n\nI WAS MISLEAD AND THEN HELD ACCOUNTABLE!!!\n\nI think now it is obvious that Maguroni hates me and I cant think of a reason why other than the fact that I ASK to be unblacklisted!\n\nThis has really just dragged the NNJG name in the dirt slightly that one of their VIP's in which help in the server get's repayed the way he just did.\n\nNow I appologies for any disrespect but yesterday taught me that even the best servers and the one's that you put time and effort into keeping minge-free can back stab you for an obvious mistake, and in my honest opinion just shows lack of a good admin system.\n\nI hope Maguroni will now reconsider my blacklist but yesterday I did infact tell him I was mislead but as said before he didn't give a crap about me or anything I had to say.\nAnd I am really hoping that he doesn't treat any others like this! I did see a person freekill 3 people on purpose and Maguroni did not blacklist him! How is any of this fair?\n\nWell I will stop this semi-rant now but I can tell you this was not the Maguroni I knew from when I first joined the server, but I did realize he has always been like that, Giving no real warning and just leaving people shocked and in rage.\n\nRegards, James.\n\n\n_______________________________________________________________________________________________________\n\nChat log of my conversation with him...\n\nMaguroni: Ok I read it\nRemnants3: Do you think im mistaken then in believing your being more harsh to me?\nMaguroni: No\nMaguroni: I am\nRemnants3: And now I sound pathetic in begging\nMaguroni: Because you have already had your chance for me to be nice\nRemnants3: My chance?\nRemnants3: I made 1 mistake about 1-2 months ago Mag\nRemnants3: And even that was an accident\nMaguroni: and now that you have been forgiven\nMaguroni: I am not forgiving a second time\nRemnants3: Seriously? Do you not realise both times were accidents?\nRemnants3: Do you not see that or am I actually going mad?\nRemnants3: I shot you by mistake once, then you hold me against it when millions of RDM's go on every day with only a slay.\nRemnants3: Then this time I do somthing ive seen many people do and im executed for it\nRemnants3: I cant actually believe your actions right now, I think i may need a 2nd opinion on this.\nMaguroni: I am sorry then\nMaguroni: All gunplating I see is a blacklist no questions asked\nMaguroni: You are no exception\nRemnants3: But your a good admin! Thats why i dont understand this\nRemnants3: YOu hold me accountable for 1 mistake\nRemnants3: And now I know that this is wrong you wont forgive me?\nRemnants3: I was mislead\nRemnants3: There was no intention in rule breaking\nMaguroni: I said no questions asked\nRemnants3: Or trying to get a guy to pick up a gun so i can kill him\nRemnants3: So after I pay to help the server and keep it from minges when your gone, I get repayed with no forgiveness after a mistake.\nMaguroni: I guess\nRemnants3: Ok i need to go to sleep now for work tomorrow\nMaguroni: I just enforce the rules\nMaguroni: I don't care about drama\nMaguroni: Like this\nMaguroni: I am a black and white kind of guy\nMaguroni: Either you are good or you are bad\nMaguroni: You went bad today\nMaguroni: And were punished for it\n Maguroni: Then you blew it way out of porportions  <--- did I really have a choice? I wasn't just going to let him ruin my favorite server for when I was blatantly mislead!\n\nMaguroni: And now we are here\nRemnants3: I will be posting this on the forum for more opinions as im stunned tbh. I MADE A MISTAKE, And that is it, Many people done it before me with no punishment\nRemnants3: I hope im mistaken in believing you cant understand basic mistakes from actually trying to rule break\nMaguroni: Ok\nMaguroni: I await your post\nMaguroni: Good bye\n_______________________________________________________________________________________________________\n\nAll I see is that he does not give a crap about me and doesn't give a crap about my time put in the server and cant see the injustice in this, Please look on the server and you WILL see people doing exactly what I did, or even ask the regular members."},{"postId":29385,"topicId":3630,"posterId":112,"postTime":1313407137,"postText":"You have no proof.\nAnd the \"Test of Faith\" is gunplanting.\n\n\nYou're contradicting yourself. First you said you wanted to try out the test of faith, then later you said it was an accident.\n\n\nEdit: And by the way, Donating to the server does NOT give you safety from getting banned. If anything its the except opposites. The vips are supposed to know the rules and follow them more than anybody."},{"postId":29396,"topicId":3630,"posterId":838,"postTime":1313416968,"postText":">> You have no proof.\nAnd the \"Test of Faith\" is gunplanting.\n\n\nYou're contradicting yourself. First you said you wanted to try out the test of faith, then later you said it was an accident.\n \n\nSorry I was not clear in what I was saying.\n\nI meant to say the I wanted to do the test of faith thing for the first time, Then I said that I did not KNOW it was gunplanting.\nNot that I said it was an accident that I did it.\nI believed it to not be a rule break as I have said before many times that I had witnessed test of faiths go on without any consequence many many times before.\n\nI am sorry for rule breaking but I did not know I was doing wrong, that is why I made this post.\nThank you for telling me of my mis-communication!\n\nRegards, James.\n\n(EDIT) - What I am trying to get across is that I had no idea it was a rule break and I wish to be forgiven."},{"postId":29397,"topicId":3630,"posterId":112,"postTime":1313417512,"postText":">> \n(EDIT) - What I am trying to get across is that I had no idea it was a rule break and I wish to be forgiven. \n\nThen make an unblacklist request, not an abuse report."},{"postId":29401,"topicId":3630,"posterId":838,"postTime":1313420857,"postText":">> >> \n(EDIT) - What I am trying to get across is that I had no idea it was a rule break and I wish to be forgiven. \n\nThen make an unblacklist request, not an abuse report. \n\nWhat I also wanted to know is in another admins opinion was it worth a blacklist and not somthing like a Slay in which would teach me exactly the same lesson, I felt it would be Semi-Admin-Abuse because of the way he treated the situation regard me and then not punishing other's for doing acts much worse.\nYou obviously don't believe it is so thank you for letting me know!\n\nI say again, I had 0 intention on breaking a rule, at the time I believed it was perfectly acceptable to see if you can trust a prisoner and that is it, and for my mistake I wish to be forgiven and unblacklisted.\n\n(Should this be moved then?)"}]}